Repository: Nizhal/git-ta-po
Catalog: po/*.po
Languages: ta

source: max length of output filename
ta: வெளியீட்டு கோப்பு பெயரின் அதிகபட்ச நீளம்

source: cover-from-description-mode
ta: கவர்-விவரிப்பு-பயன்முறை

source: generate parts of a cover letter based on a branch's description
ta: ஒரு கிளையின் விளக்கத்தின் அடிப்படையில் ஒரு கவர் கடிதத்தின் பகுதிகளை உருவாக்குங்கள்

source: use branch description from file
ta: கோப்பிலிருந்து கிளை விளக்கத்தைப் பயன்படுத்தவும்

source: use [<prefix>] instead of [PATCH]
ta: [பேட்ச்] க்கு பதிலாக [<முன்னொட்டு>] பயன்படுத்தவும்

source: store resulting files in <dir>
ta: இதன் விளைவாக வரும் கோப்புகளை <dir> இல் சேமிக்கவும்

source: don't strip/add [PATCH]
ta: [பேட்ச்] ஐ ச்ட்ரிப்/சேர்க்க வேண்டாம்

source: don't output binary diffs
ta: பைனரி வேறுபட வேண்டாம்

source: output all-zero hash in From header
ta: தலைப்பிலிருந்து அனைத்து சுழிய ஆசையும் வெளியீடு

source: don't include a patch matching a commit upstream
ta: அப்ச்ட்ரீமில் பொருந்தக்கூடிய ஒரு பேட்சை சேர்க்க வேண்டாம்

source: show patch format instead of default (patch + stat)
ta: இயல்புநிலைக்கு பதிலாக ஒட்டு வடிவமைப்பைக் காட்டு (பேட்ச் + stat)

source: Messaging
ta: செய்தியிடல்

source: header
ta: தலைப்பி

source: add email header
ta: மின்னஞ்சல் தலைப்பைச் சேர்க்கவும்

source: email
ta: மின்னஞ்சல்

source: add To: header
ta: சேர்க்க: தலைப்பு

source: add Cc: header
ta: சி.சி: தலைப்பு சேர்க்கவும்

source: ident
ta: அடையாளம்

source: set From address to <ident> (or committer ident if absent)
ta: முகவரியிலிருந்து <dindel> க்கு அமைக்கவும் (அல்லது இல்லாவிட்டால் கமிசர் அடையாளம்)

source: message-id
ta: செய்தி-அடையாளம்

source: make first mail a reply to <message-id>
ta: முதல் அஞ்சலை <செய்தி-அடையாளம்> க்கு பதில் அளிக்கவும்

source: boundary
ta: எல்லை

source: attach the patch
ta: பேட்சை இணைக்கவும்

source: inline the patch
ta: இணைப்பு

source: enable message threading, styles: shallow, deep
ta: செய்தி த்ரெட்டிங், பாணிகளை இயக்கவும்: ஆழமற்ற, ஆழமான

source: signature
ta: கையொப்பம்

source: add a signature
ta: ஒரு கையொப்பத்தைச் சேர்க்கவும்

source: base-commit
ta: அடிப்படை-கட்டளை

source: add prerequisite tree info to the patch series
ta: ஒட்டு தொடரில் முன்நிபந்தனை மரத் தகவலைச் சேர்க்கவும்

source: add a signature from a file
ta: ஒரு கோப்பிலிருந்து கையொப்பத்தைச் சேர்க்கவும்

source: don't print the patch filenames
ta: ஒட்டு கோப்பு பெயர்களை அச்சிட வேண்டாம்

source: show progress while generating patches
ta: திட்டுகளை உருவாக்கும் போது முன்னேற்றத்தைக் காட்டு

source: show changes against <rev> in cover letter or single patch
ta: கவர் கடிதம் அல்லது ஒற்றை பேட்சில் <ver> க்கு எதிராக மாற்றங்களைக் காட்டு

source: show changes against <refspec> in cover letter or single patch
ta: கவர் கடிதம் அல்லது ஒற்றை இணைப்பில் <sepspec> க்கு எதிராக மாற்றங்களைக் காட்டு

source: percentage by which creation is weighted
ta: படைப்பு எடையுள்ள விழுக்காடு

source: show in-body From: even if identical to the e-mail header
ta: இதிலிருந்து உடல் காட்டு: மின்னஞ்சல் தலைப்புக்கு ஒத்ததாக இருந்தாலும் கூட

source: invalid ident line: %s
ta: தவறான உள்தள்ளல் வரி: %s

source: --name-only does not make sense
ta: --name-only பொருளல்ல

source: --name-status does not make sense
ta: --name-status பொருளல்ல

source: --check does not make sense
ta: --check பொருளல்ல

source: --remerge-diff does not make sense
ta: --remerge-diff பொருளில்லை

source: could not create directory '%s'
ta: '%s' கோப்பகத்தை உருவாக்க முடியவில்லை

source: --interdiff requires --cover-letter or single patch
ta: --interdiff தேவை --cover-letter அல்லது ஒற்றை ஒட்டு

source: Interdiff:
ta: இடைமுகம்:

source: Interdiff against v%d:
ta: v%d க்கு எதிராக இன்டர்டிஃப்:

source: --range-diff requires --cover-letter or single patch
ta: --range-diff தேவை --cover-letter அல்லது ஒற்றை ஒட்டு

source: Range-diff:
ta: வரம்பு-டிஃப்:

source: Range-diff against v%d:
ta: v%d க்கு எதிராக வரம்பு-டிஃப்:

source: unable to read signature file '%s'
ta: கையொப்பக் கோப்பை '%s' படிக்க முடியவில்லை

source: Generating patches
ta: திட்டுகளை உருவாக்குகிறது

source: failed to create output files
ta: வெளியீட்டு கோப்புகளை உருவாக்கத் தவறிவிட்டது

source: git cherry [-v] [<upstream> [<head> [<limit>]]]
ta: அறிவிலி செர்ரி [-v] [<parstream> [<head> [<வரம்பு>]]]

source: Could not find a tracked remote branch, please specify <upstream> manually.
ta: கண்காணிக்கப்பட்ட தொலை கிளையைக் கண்டுபிடிக்க முடியவில்லை, தயவுசெய்து <அப்ச்ட்ரீம்> கைமுறையாக குறிப்பிடவும்.

source: could not get object info about '%s'
ta: '%s' பற்றிய பொருள் தகவலைப் பெற முடியவில்லை

source: git ls-files [<options>] [<file>...]
ta: git ls-files [<விருப்பங்கள்>] [<file> ...]

source: separate paths with the NUL character
ta: nul எழுத்துடன் பாதைகளை பிரிக்கவும்

source: identify the file status with tags
ta: குறிச்சொற்களுடன் கோப்பு நிலையை அடையாளம் காணவும்

source: use lowercase letters for 'assume unchanged' files
ta: 'மாறாத' கோப்புகளுக்கு சிறிய எழுத்துக்களைப் பயன்படுத்தவும்

source: use lowercase letters for 'fsmonitor clean' files
ta: 'fsmonitor தூய்மையான' கோப்புகளுக்கு சிறிய எழுத்துக்களைப் பயன்படுத்தவும்

source: show cached files in the output (default)
ta: வெளியீட்டில் தற்காலிக சேமிப்பு கோப்புகளைக் காட்டு (இயல்புநிலை)

source: show deleted files in the output
ta: வெளியீட்டில் நீக்கப்பட்ட கோப்புகளைக் காட்டு

source: show modified files in the output
ta: மாற்றியமைக்கப்பட்ட கோப்புகளை வெளியீட்டில் காட்டு

source: show other files in the output
ta: வெளியீட்டில் மற்ற கோப்புகளைக் காட்டுங்கள்

source: show ignored files in the output
ta: வெளியீட்டில் புறக்கணிக்கப்பட்ட கோப்புகளைக் காட்டு

source: show staged contents' object name in the output
ta: வெளியீட்டில் அரங்கேற்றப்பட்ட உள்ளடக்கங்களின் பொருளைக் காட்டு

source: show files on the filesystem that need to be removed
ta: அகற்றப்பட வேண்டிய கோப்பு முறைமையில் கோப்புகளைக் காண்பி

source: show 'other' directories' names only
ta: 'பிற' கோப்பகங்கள் 'பெயர்களை மட்டும் காட்டு

source: show line endings of files
ta: கோப்புகளின் வரி முடிவுகளைக் காட்டு

source: don't show empty directories
ta: வெற்று கோப்பகங்களைக் காட்ட வேண்டாம்

source: show unmerged files in the output
ta: வெளியீட்டில் அவிழ்க்கப்படாத கோப்புகளைக் காட்டுங்கள்

source: show resolve-undo information
ta: தீர்வு-வாரோ தகவல்களைக் காண்பி

source: skip files matching pattern
ta: பொருந்தக்கூடிய வடிவங்களைத் தவிர்க்கவும்

source: read exclude patterns from <file>
ta: <கோப்பு> இலிருந்து வடிவங்களை விலக்கு

source: read additional per-directory exclude patterns in <file>
ta: <file> இல் உள்ள கூடுதல் கூடுதல் விலக்கு வடிவங்களைப் படியுங்கள்

source: add the standard git exclusions
ta: நிலையான அறிவிலி விலக்குகளைச் சேர்க்கவும்

source: make the output relative to the project top directory
ta: திட்ட சிறந்த கோப்பகத்துடன் தொடர்புடைய வெளியீட்டை உருவாக்கவும்

source: if any <file> is not in the index, treat this as an error
ta: ஏதேனும் <file> குறியீட்டில் இல்லை என்றால், இதை பிழையாகக் கருதுங்கள்

source: tree-ish
ta: மரம்-இச்

source: pretend that paths removed since <tree-ish> are still present
ta: <ட்ரீ-இச்> இன்னும் இருப்பதால் பாதைகள் அகற்றப்பட்டதாக பாசாங்கு செய்யுங்கள்

source: show debugging data
ta: பிழைத்திருத்த தரவைக் காட்டு

source: suppress duplicate entries
ta: நகல் உள்ளீடுகளை அடக்கவும்

source: show sparse directories in the presence of a sparse index
ta: ஒரு சிதறிய குறியீட்டின் முன்னிலையில் சிதறிய கோப்பகங்களைக் காட்டு

source: do not print remote URL
ta: தொலைநிலை முகவரி ஐ அச்சிட வேண்டாம்

source: exec
ta: நிர்வாகி

source: path of git-upload-pack on the remote host
ta: தொலை ஓச்டில் git-upload-pack இன் பாதை

source: limit to tags
ta: குறிச்சொற்களுக்கு வரம்பு

source: do not show peeled tags
ta: உரிக்கப்பட்ட குறிச்சொற்களைக் காட்ட வேண்டாம்

source: take url.<base>.insteadOf into account
ta: முகவரி ஐ எடுத்துக் கொள்ளுங்கள். <base> .insteadof கணக்கில்

source: exit with exit code 2 if no matching refs are found
ta: பொருந்தக்கூடிய குறிப்புகள் எதுவும் காணப்படவில்லை என்றால் வெளியேறும் குறியீடு 2 உடன் வெளியேறவும்

source: show underlying ref in addition to the object pointed by it
ta: அதன் சுட்டிக்காட்டப்பட்ட பொருளுக்கு கூடுதலாக அடிப்படை ref ஐக் காட்டு

source: git ls-tree [<options>] <tree-ish> [<path>...]
ta: git ls-tree [<விருப்பங்கள்>] <மரம்-இச்> [<athe> ...]

source: only show trees
ta: மரங்களைக் காட்டுங்கள்

source: recurse into subtrees
ta: சப்டிரீசில் மீண்டும்

source: show trees when recursing
ta: சுழலும் போது மரங்களைக் காட்டு

source: terminate entries with NUL byte
ta: நுல் பைட் உடன் உள்ளீடுகளை நிறுத்தவும்

source: include object size
ta: பொருள் அளவு அடங்கும்

source: list only filenames
ta: கோப்பு பெயர்களை மட்டுமே பட்டியலிடுங்கள்

source: list only objects
ta: பொருள்களை மட்டும் பட்டியலிடுங்கள்

source: use full path names
ta: முழு பாதை பெயர்களைப் பயன்படுத்துங்கள்

source: list entire tree; not just current directory (implies --full-name)
ta: முழு மரத்தையும் பட்டியலிடுங்கள்; தற்போதைய அடைவு மட்டுமல்ல (--full-name ஐ குறிக்கிறது)

source: --format can't be combined with other format-altering options
ta: --format ஐ மற்ற வடிவமைப்பு மாற்றும் விருப்பங்களுடன் இணைக்க முடியாது

source: git mailinfo [<options>] <msg> <patch> < mail >info
ta: git mailinfo [<விருப்பங்கள்>] <தகவல்> <ஒட்டு> < அஞ்சல் >செய்தி

source: keep subject
ta: பொருள் வைத்திருங்கள்

source: keep non patch brackets in subject
ta: அல்லாத ஒட்டு அடைப்புக்குறிகளை விசயத்தில் வைத்திருங்கள்

source: copy Message-ID to the end of commit message
ta: செய்தி-ஐடியை உறுதி செய்தியின் இறுதி வரை நகலெடுக்கவும்

source: re-code metadata to i18n.commitEncoding
ta: i18n.commitencoding க்கு மெட்டாடேட்டாவை மீண்டும் குறியீடு

source: disable charset re-coding of metadata
ta: மெட்டாடேட்டாவின் சார்செட் மறு குறியீட்டை முடக்கு

source: encoding
ta: குறியாக்கம்

source: re-code metadata to this encoding
ta: இந்த குறியாக்கத்திற்கு மெட்டாடேட்டாவை மீண்டும் குறியீடு

source: use scissors
ta: கத்தரிக்கோல் பயன்படுத்தவும்

source: <action>
ta: <செயல்>

source: action when quoted CR is found
ta: மேற்கோள் காட்டப்பட்ட சிஆர் காணப்படும் போது நடவடிக்கை

source: use headers in message's body
ta: செய்தி உடலில் தலைப்புகளைப் பயன்படுத்துங்கள்

source: reading patches from stdin/tty...
ta: stdin/tty இலிருந்து திட்டுகளைப் படித்தல் ...

source: empty mbox: '%s'
ta: வெற்று எம்பாக்ச்: '%s'

source: git merge-base [-a | --all] <commit> <commit>...
ta: git merge-base [-a | --all] <உறுதி> <உறுதி>...

source: git merge-base [-a | --all] --octopus <commit>...
ta: git merge-base [-a | --all] --octopus <உறுதி>...

source: git merge-base --is-ancestor <commit> <commit>
ta: git merge-base --is-ancestor <உறுதி> <உறுதி>

source: git merge-base --independent <commit>...
ta: git merge-base --independent <உறுதி>...

source: git merge-base --fork-point <ref> [<commit>]
ta: git merge-base --fork-point <குறி> [<உறுதி>]

source: output all common ancestors
ta: அனைத்து பொதுவான மூதாதையர்களையும் வெளியிடுங்கள்

source: find ancestors for a single n-way merge
ta: ஒற்றை என்-வழி ஒன்றிணைக்க மூதாதையர்களைக் கண்டறியவும்

source: list revs not reachable from others
ta: பட்டியல் மற்றவர்களிடமிருந்து அடைய முடியாது

source: is the first one ancestor of the other?
ta: முதல் ஒரு மூதாதையர் மற்றவர்?

source: find where <commit> forked from reflog of <ref>
ta: <eff> இன் பிரதிபலிப்பிலிருந்து <comit> முட்கரண்டி இடத்தைக் கண்டறியவும்

source: git merge-file [<options>] [-L <name1> [-L <orig> [-L <name2>]]] <file1> <orig-file> <file2>
ta: git merge-file [<விருப்பங்கள்>] [-L <பெயர்1> [-L <தோற்றம்> [-L <பெயர்2>]]] <பெயர்1> <அசல்-கோப்பு> <பெயர்2>

source: option diff-algorithm accepts "myers", "minimal", "patience" and "histogram"
ta: விருப்பம் வேறுபாடு-அல்காரிதம் "மியர்ச்", "குறைந்தபட்ச", "பொறுமை" மற்றும் "இச்டோகிராம்" ஆகியவற்றை ஏற்றுக்கொள்கிறது

source: send results to standard output
ta: நிலையான வெளியீட்டிற்கு முடிவுகளை அனுப்பவும்

source: use object IDs instead of filenames
ta: கோப்பு பெயர்களுக்கு பதிலாக பொருள் ஐடிகளைப் பயன்படுத்தவும்

source: use a diff3 based merge
ta: டிஃப் 3 அடிப்படையிலான ஒன்றிணைப்பைப் பயன்படுத்தவும்

source: use a zealous diff3 based merge
ta: வைராக்கியமான வேறுபாடு 3 அடிப்படையிலான ஒன்றிணைப்பைப் பயன்படுத்தவும்

source: <algorithm>
ta: <வழிமுறை>

source: choose a diff algorithm
ta: வேறுபட்ட வழிமுறையைத் தேர்வுசெய்க

source: for conflicts, use this marker size
ta: மோதல்களுக்கு, இந்த மார்க்கர் அளவைப் பயன்படுத்தவும்

source: do not warn about conflicts
ta: மோதல்கள் பற்றி எச்சரிக்க வேண்டாம்

source: set labels for file1/orig-file/file2
ta: file1/origy-file/file2 க்கான லேபிள்களை அமைக்கவும்

source: object '%s' does not exist
ta: பொருள் '%s' இல்லை

source: Could not write object file
ta: பொருள் கோப்பை எழுத முடியவில்லை

source: unknown option %s
ta: அறியப்படாத விருப்பம் %s

source: could not parse object '%s'
ta: பொருளை '%s' அலச முடியவில்லை

source: cannot handle more than %d base. Ignoring %s.
ta: %d தளத்திற்கு மேல் கையாள முடியாது. %s புறக்கணிக்கிறது.

source: not handling anything other than two heads merge.
ta: இரண்டு தலைகளைத் தவிர வேறு எதையும் கையாளவில்லை.

source: could not resolve ref '%s'
ta: ref '%s' ஐ தீர்க்க முடியவில்லை

source: Merging %s with %s
ta: %s உடன் %s உடன் இணைத்தல்

source: not something we can merge
ta: நாம் ஒன்றிணைக்கக்கூடிய ஒன்று அல்ல

source: refusing to merge unrelated histories
ta: தொடர்பில்லாத வரலாறுகளை ஒன்றிணைக்க மறுக்கிறது

source: failure to merge
ta: ஒன்றிணைக்கத் தவறியது

source: git merge-tree [--write-tree] [<options>] <branch1> <branch2>
ta: git merge-tree [--write-tree] [<விருப்பங்கள்>] <கிளை1> <கிளை2>

source: git merge-tree [--trivial-merge] <base-tree> <branch1> <branch2>
ta: git merge-tree [--trivial-merge] <அடி-மரம்> <கிளை1> <கிளை2>

source: do a real merge instead of a trivial merge
ta: கீழான ஒன்றிணைப்புக்கு பதிலாக உண்மையான ஒன்றிணைக்கவும்

source: do a trivial merge only
ta: ஒரு கீழான ஒன்றிணைக்க மட்டுமே செய்யுங்கள்

source: also show informational/conflict messages
ta: தகவல்/மோதல் செய்திகளையும் காட்டுங்கள்

source: list filenames without modes/oids/stages
ta: முறைகள்/oids/நிலைகள் இல்லாமல் கோப்பு பெயர்களை பட்டியலிடுங்கள்

source: allow merging unrelated histories
ta: தொடர்பில்லாத வரலாறுகளை ஒன்றிணைக்க அனுமதிக்கவும்

source: perform multiple merges, one per line of input
ta: பல இணைப்புகளைச் செய்யுங்கள், உள்ளீட்டின் ஒரு வரிக்கு ஒன்று

source: specify a merge-base for the merge
ta: ஒன்றிணைப்பதற்கான ஒன்றிணைப்பு-தளத்தைக் குறிப்பிடவும்

source: option=value
ta: விருப்பம் = மதிப்பு

source: option for selected merge strategy
ta: தேர்ந்தெடுக்கப்பட்ட ஒன்றிணைக்கும் மூலோபாயத்திற்கான விருப்பம்

source: --trivial-merge is incompatible with all other options
ta: --trivial-merge மற்ற எல்லா விருப்பங்களுடனும் பொருந்தாது

source: unknown strategy option: -X%s
ta: அறியப்படாத மூலோபாய விருப்பம்: -x%s

source: malformed input line: '%s'.
ta: தவறாக உள்ளீட்டு வரி: '%s'.

source: git merge [<options>] [<commit>...]
ta: git ஒன்றிணைப்பு [<விருப்பங்கள்>] [< உறுதி> ...]

source: switch `m' requires a value
ta: சுவிட்ச் `எம் 'ஒரு மதிப்பு தேவை

source: option `%s' requires a value
ta: விருப்பம் `%s 'க்கு மதிப்பு தேவை

source: Could not find merge strategy '%s'.
ta: ஒன்றிணைக்கும் மூலோபாயத்தை '%s' கண்டுபிடிக்க முடியவில்லை.

source: Available strategies are:
ta: கிடைக்கக்கூடிய உத்திகள்:

source: Available custom strategies are:
ta: கிடைக்கும் தனிப்பயன் உத்திகள்:

source: do not show a diffstat at the end of the merge
ta: ஒன்றிணைக்கும் முடிவில் ஒரு டிஃப்ச்டாட்டைக் காட்ட வேண்டாம்

source: show a diffstat at the end of the merge
ta: ஒன்றிணைப்பின் முடிவில் ஒரு டிஃப்ச்டாட்டைக் காட்டு

source: (synonym to --stat)
ta: (--stat க்கு ஒத்ததாக)

source: add (at most <n>) entries from shortlog to merge commit message
ta: சார்ட்லாக் நிறுவனத்திலிருந்து சேர்க்கை (அதிகபட்சம் <n>) உள்ளீடுகளைச் சேர்க்கவும்

source: create a single commit instead of doing a merge
ta: ஒன்றிணைப்பதற்கு பதிலாக ஒரு உறுதிடத்தை உருவாக்கவும்

source: perform a commit if the merge succeeds (default)
ta: ஒன்றிணைப்பு செய் பெற்றால் (இயல்புநிலை) ஒரு உறுதிப்பாட்டை செய்யுங்கள்

source: edit message before committing
ta: செய்வதற்கு முன் செய்தியைத் திருத்தவும்

source: allow fast-forward (default)
ta: வேகமாக முன்னோக்கி (இயல்புநிலை) அனுமதிக்கவும்

source: abort if fast-forward is not possible
ta: வேகமாக முன்னோக்கி சாத்தியமில்லை என்றால் கைவிடவும்

source: verify that the named commit has a valid GPG signature
ta: பெயரிடப்பட்ட உறுதிடில் செல்லுபடியாகும் சிபிசி கையொப்பம் உள்ளதா என்பதை சரிபார்

source: strategy
ta: மூலோபாயம்

source: merge strategy to use
ta: பயன்படுத்த மூலோபாயத்தை ஒன்றிணைக்கவும்

source: merge commit message (for a non-fast-forward merge)
ta: உறுதி செய்தியை ஒன்றிணைக்கவும் (வேகமான முன்னோக்கி ஒன்றிணைக்க)

source: use <name> instead of the real target
ta: உண்மையான இலக்குக்கு பதிலாக <பெயர்> ஐப் பயன்படுத்தவும்

source: abort the current in-progress merge
ta: தற்போதைய முன்னேற்றம் ஒன்றிணைப்பதை நிறுத்துங்கள்

source: --abort but leave index and working tree alone
ta: --abort ஆனால் குறியீட்டு மற்றும் பணி மரத்தை தனியாக விட்டுவிடுங்கள்

source: continue the current in-progress merge
ta: தற்போதைய முன்னேற்றம் ஒன்றைத் தொடரவும்

source: bypass pre-merge-commit and commit-msg hooks
ta: பைபாச் முன்-மெர்ச்- உறுதி மற்றும் உறுதி-எம்எச்சி கொக்கிகள்

source: could not run stash.
ta: ச்டாச் இயக்க முடியவில்லை.

source: stash failed
ta: ச்டாச் தோல்வியுற்றது

source: not a valid object: %s
ta: செல்லுபடியாகும் பொருள் அல்ல: %s

source: read-tree failed
ta: வாசிப்பு-மரம் தோல்வியடைந்தது

source: Already up to date. (nothing to squash)
ta: ஏற்கனவே புதுப்பித்த நிலையில். (ச்குவாச் எதுவும் இல்லை)

source: Already up to date.
ta: ஏற்கனவே புதுப்பித்த நிலையில்.

source: Squash commit -- not updating HEAD
ta: ச்குவாச் உறுதி - தலையைப் புதுப்பிக்கவில்லை

source: No merge message -- not updating HEAD
ta: ஒன்றிணைக்கும் செய்தி இல்லை - தலையைப் புதுப்பிக்கவில்லை

source: '%s' does not point to a commit
ta: '%s' ஒரு உறுதிப்பாட்டை சுட்டிக்காட்டாது

source: Bad branch.%s.mergeoptions string: %s
ta: மோசமான கிளை. %s.mergeoptions string: %s

source: Unable to write index.
ta: குறியீட்டை எழுத முடியவில்லை.

source: Not handling anything other than two heads merge.
ta: இரண்டு தலைகளைத் தவிர வேறு எதையும் கையாளவில்லை.

source: unable to write %s
ta: %s எழுத முடியவில்லை

source: Could not read from '%s'
ta: '%s' இலிருந்து படிக்க முடியவில்லை

source: Not committing merge; use 'git commit' to complete the merge.
ta: ஒன்றிணைக்கவில்லை; ஒன்றிணைக்க 'அறிவிலி உறுதி' ஐப் பயன்படுத்தவும்.

source: Please enter a commit message to explain why this merge is necessary, especially if it merges an updated upstream into a topic branch.
ta: இந்த ஒன்றிணைப்பு ஏன் தேவை என்பதை விளக்க தயவுசெய்து ஒரு செய்தியை உள்ளிடவும், குறிப்பாக இது புதுப்பிக்கப்பட்ட அப்ச்ட்ரீமை ஒரு தலைப்புக் கிளையில் இணைத்தால்.

source: An empty message aborts the commit.
ta: ஒரு வெற்று செய்தி உறுதிப்பாட்டை நிறுத்துகிறது.

source: Empty commit message.
ta: வெற்று உறுதி செய்தி.

source: Wonderful.
ta: புதுமை.

source: Automatic merge failed; fix conflicts and then commit the result.
ta: தானியங்கி ஒன்றிணைப்பு தோல்வியுற்றது; மோதல்களை சரிசெய்து, பின்னர் முடிவைச் செய்யுங்கள்.

source: No current branch.
ta: தற்போதைய கிளை இல்லை.

source: No remote for the current branch.
ta: தற்போதைய கிளைக்கு தொலை இல்லை.

source: No default upstream defined for the current branch.
ta: தற்போதைய கிளைக்கு இயல்புநிலை மேலோடை வரையறுக்கப்படவில்லை.

source: No remote-tracking branch for %s from %s
ta: %s இலிருந்து %s க்கு தொலை-கண்காணிப்பு கிளை இல்லை

source: Bad value '%s' in environment '%s'
ta: சுற்றுச்சூழலில் மோசமான மதிப்பு '%s'%s '

source: could not close '%s'
ta: '%s' ஐ மூட முடியவில்லை

source: not something we can merge in %s: %s
ta: நாம் %s இல் ஒன்றிணைக்கக்கூடிய ஒன்றல்ல: %s

source: --abort expects no arguments
ta: --abort எந்த வாதங்களையும் எதிர்பார்க்கவில்லை

source: There is no merge to abort (MERGE_HEAD missing).
ta: கருக்கலைப்பு செய்ய ஒன்றுமில்லை (MERGE_HEAD காணவில்லை).

source: --quit expects no arguments
ta: --quit எந்த வாதங்களையும் எதிர்பார்க்கவில்லை

source: --continue expects no arguments
ta: --continue எந்த வாதங்களையும் எதிர்பார்க்கவில்லை

source: There is no merge in progress (MERGE_HEAD missing).
ta: ஒன்றிணைப்பு செயலில் இல்லை (MERGE_HEAD காணவில்லை).

source: You have not concluded your merge (MERGE_HEAD exists). Please, commit your changes before you merge.
ta: உங்கள் இணைப்பை நீங்கள் முடிவு செய்யவில்லை (MERGE_HEAD உள்ளது). தயவுசெய்து, நீங்கள் ஒன்றிணைவதற்கு முன் உங்கள் மாற்றங்களைச் செய்யுங்கள்.

source: You have not concluded your cherry-pick (CHERRY_PICK_HEAD exists). Please, commit your changes before you merge.
ta: உங்கள் செர்ரி-பிக் (CHERRY_PICK_HEAD உள்ளது) என்று நீங்கள் முடிவு செய்யவில்லை. தயவுசெய்து, நீங்கள் ஒன்றிணைவதற்கு முன் உங்கள் மாற்றங்களைச் செய்யுங்கள்.

source: You have not concluded your cherry-pick (CHERRY_PICK_HEAD exists).
ta: உங்கள் செர்ரி-பிக் (CHERRY_PICK_HEAD உள்ளது) என்று நீங்கள் முடிவு செய்யவில்லை.

source: No commit specified and merge.defaultToUpstream not set.
ta: எந்தவொரு உறுதிப்பாடும் குறிப்பிடப்படவில்லை மற்றும் merge.defaultToUpstream அமைக்கபடவில்லை.

source: Squash commit into empty head not supported yet
ta: ச்குவாச் வெற்று தலையில் இன்னும் ஆதரிக்கப்படவில்லை

source: Non-fast-forward commit does not make sense into an empty head
ta: வேகமான முன்னோக்கி உறுதிடி வெற்று தலையில் பொருளல்ல

source: %s - not something we can merge
ta: %s - நாம் ஒன்றிணைக்கக்கூடிய ஒன்று அல்ல

source: Can merge only exactly one commit into empty head
ta: வெற்று தலையில் ஒன்று சரியாக ஒன்றிணைக்க முடியும்

source: Updating %s..%s
ta: %s புதுப்பித்தல் .. %s

source: Your local changes to the following files would be overwritten by merge: %s
ta: பின்வரும் கோப்புகளில் உங்கள் உள்ளக மாற்றங்கள் ஒன்றிணைப்பதன் மூலம் மேலெழுதப்படும்: %s

source: Trying really trivial in-index merge...
ta: இன்-இன்டெக்ச் ஒன்றிணைக்க மிகவும் கீழான முயற்சிக்கிறது ...

source: Nope.
ta: இல்லை.

source: Rewinding the tree to pristine...
ta: மரத்தை அழகாக மாற்றியமைத்தல் ...

source: Trying merge strategy %s...
ta: ஒன்றிணைக்கும் மூலோபாயம் %s ...

source: No merge strategy handled the merge.
ta: ஒன்றிணைக்கும் மூலோபாயத்தை ஒன்றிணைக்கவில்லை.

source: Merge with strategy %s failed.
ta: மூலோபாயத்துடன் ஒன்றிணைக்கவும் %s தோல்வியுற்றது.

source: Using the %s strategy to prepare resolving by hand.
ta: கையால் தீர்க்கத் தயாரிக்க %s மூலோபாயத்தைப் பயன்படுத்துதல்.

source: Automatic merge went well; stopped before committing as requested
ta: தானியங்கி ஒன்றிணைப்பு நன்றாக சென்றது; கோரியபடி ஈடுபடுவதற்கு முன்பு நிறுத்தப்பட்டது

source: When finished, apply stashed changes with `git stash pop`
ta: முடிந்ததும், `கிட் ச்டாச் பாப்` உடன் மாற்றப்பட்ட மாற்றங்களைப் பயன்படுத்துங்கள்

source: warning: tag input does not pass fsck: %s
ta: முன்னறிவிப்பு: குறிச்சொல் உள்ளீடு fsck ஐ கடக்காது: %s

source: error: tag input does not pass fsck: %s
ta: பிழை: குறிச்சொல் உள்ளீடு fsck ஐ கடக்காது: %s

source: %d (FSCK_IGNORE?) should never trigger this callback
ta: %d (FSCK_IGNORE?) இந்த அழைப்பைத் தூண்டக்கூடாது

source: could not read tagged object '%s'
ta: குறிக்கப்பட்ட பொருளை '%s' படிக்க முடியவில்லை

source: object '%s' tagged as '%s', but is a '%s' type
ta: பொருள் '%s' குறிக்கப்பட்ட '%s', ஆனால் இது ஒரு '%s' வகை

source: tag on stdin did not pass our strict fsck check
ta: stdin இல் குறிச்சொல் எங்கள் கடுமையான fsck காசோலையை அனுப்பவில்லை

source: tag on stdin did not refer to a valid object
ta: stdin இல் குறிச்சொல் செல்லுபடியாகும் பொருளைக் குறிக்கவில்லை

source: unable to write tag file
ta: டேக் கோப்பை எழுத முடியவில்லை

source: input is NUL terminated
ta: உள்ளீடு nul நிறுத்தப்பட்டது

source: allow missing objects
ta: காணாமல் போன பொருள்களை அனுமதிக்கவும்

source: allow creation of more than one tree
ta: ஒன்றுக்கு மேற்பட்ட மரங்களை உருவாக்க அனுமதிக்கவும்

source: git multi-pack-index [<options>] write [--preferred-pack=<pack>][--refs-snapshot=<path>]
ta: git multi-pack-index [<விருப்பங்கள்>] எழுது [--preferred-pack=<கட்டு>] [-refs-snapshot = <athe>]]

source: git multi-pack-index [<options>] verify
ta: git multi-pack-index [<விருப்பங்கள்>] சரிபார்

source: git multi-pack-index [<options>] expire
ta: git multi-pack-index [<விருப்பங்கள்>] காலாவதியாகிறது

source: git multi-pack-index [<options>] repack [--batch-size=<size>]
ta: git multi-pack-index [<விருப்பங்கள்>] repack [--batch-size = <அளவு>]

source: directory
ta: அடைவு
