Repository: Nizhal/git-ta-po
Catalog: po/*.po
Languages: ta

source: validation failed, cannot remove working tree: %s
ta: சரிபார்ப்பு தோல்வியடைந்தது, பணி மரத்தை அகற்ற முடியாது: %s

source: repair: %s: %s
ta: பழுது: %s: %s

source: error: %s: %s
ta: பிழை: %s: %s

source: git write-tree [--missing-ok] [--prefix=<prefix>/]
ta: git write-tree [--missing-ok] [--prefix=<முன்னொட்டு>/]

source: <prefix>/
ta: <முன்னொட்டு>/

source: write tree object for a subdirectory <prefix>
ta: ஒரு துணை அடைவு <முன்னொட்டு> க்கு மர பொருளை எழுதுங்கள்

source: only useful for debugging
ta: பிழைத்திருத்தத்திற்கு மட்டுமே பயனுள்ளதாக இருக்கும்

source: core.fsyncMethod = batch is unsupported on this platform
ta: core.fsyncMethod = தொகுதி இந்த மேடையில் ஆதரிக்கப்படவில்லை

source: could not parse bundle list key %s with value '%s'
ta: '%s' மதிப்புடன் மூட்டை பட்டியல் விசை %s ஐ அலச முடியவில்லை

source: bundle list at '%s' has no mode
ta: '%s' இல் மூட்டை பட்டியலில் இல்லை

source: failed to create temporary file
ta: தற்காலிக கோப்பை உருவாக்கத் தவறிவிட்டது

source: insufficient capabilities
ta: போதிய திறன்கள்

source: file downloaded from '%s' is not a bundle
ta: '%s' இலிருந்து பதிவிறக்கம் செய்யப்பட்ட கோப்பு ஒரு மூட்டை அல்ல

source: failed to store maximum creation token
ta: அதிகபட்ச படைப்பு கிள்ளாக்கை சேமிக்கத் தவறிவிட்டது

source: unrecognized bundle mode from URI '%s'
ta: யூரி '%s' இலிருந்து அங்கீகரிக்கப்படாத மூட்டை பயன்முறை

source: exceeded bundle URI recursion limit (%d)
ta: மூட்டை யுஆர்ஐ மறுநிகழ்வு வரம்பு (%d) ஐ மீறியது

source: failed to download bundle from URI '%s'
ta: யூரி '%s' இலிருந்து மூட்டை பதிவிறக்கம் செய்யத் தவறிவிட்டது

source: file at URI '%s' is not a bundle or bundle list
ta: யூரி '%s' இல் கோப்பு ஒரு மூட்டை அல்லது மூட்டை பட்டியல் அல்ல

source: bundle-uri: unexpected argument: '%s'
ta: மூட்டை-யூரி: எதிர்பாராத வாதம்: '%s'

source: bundle-uri: expected flush after arguments
ta: மூட்டை-யூரி: வாதங்களுக்குப் பிறகு எதிர்பார்க்கப்படும் பறிப்பு

source: bundle-uri: got an empty line
ta: மூட்டை-உரி: ஒரு வெற்று வரி கிடைத்தது

source: bundle-uri: line is not of the form 'key=value'
ta: மூட்டை-யூரி: வரி 'விசை = மதிப்பு' வடிவத்தில் இல்லை

source: bundle-uri: line has empty key or value
ta: மூட்டை-யூரி: வரியில் வெற்று விசை அல்லது மதிப்பு உள்ளது

source: unrecognized bundle hash algorithm: %s
ta: அங்கீகரிக்கப்படாத மூட்டை ஆச் வழிமுறை: %s

source: unknown capability '%s'
ta: அறியப்படாத திறன் '%s'

source: '%s' does not look like a v2 or v3 bundle file
ta: '%s' வி 2 அல்லது வி 3 மூட்டை கோப்பு போல் இல்லை

source: unrecognized header: %s%s (%d)
ta: அங்கீகரிக்கப்படாத தலைப்பு:%s%s (%d)

source: Repository lacks these prerequisite commits:
ta: களஞ்சியத்தில் இந்த முன்நிபந்தனை உறுதிடுகள் இல்லை:

source: some prerequisite commits exist in the object store, but are not connected to the repository's history
ta: சில முன்நிபந்தனை உறுதிடுகள் பொருள் கடையில் உள்ளன, ஆனால் அவை களஞ்சியத்தின் வரலாற்றுடன் இணைக்கப்படவில்லை

source: The bundle contains this ref:
ta: மூட்டையில் இந்த குறிப்பு உள்ளது:

source: The bundle records a complete history.
ta: மூட்டை ஒரு முழுமையான வரலாற்றை பதிவு செய்கிறது.

source: The bundle requires this ref:
ta: மூட்டைக்கு இந்த குறிப்பு தேவைப்படுகிறது:

source: The bundle uses this hash algorithm: %s
ta: மூட்டை இந்த ஆச் வழிமுறையைப் பயன்படுத்துகிறது: %s

source: The bundle uses this filter: %s
ta: மூட்டை இந்த வடிப்பானைப் பயன்படுத்துகிறது: %s

source: unable to dup bundle descriptor
ta: டூப் மூட்டை விவரிப்பாளருக்கு முடியவில்லை

source: Could not spawn pack-objects
ta: கட்டு-பொருள்களை உருவாக்க முடியவில்லை

source: pack-objects died
ta: கட்டு-பொருள்கள் இறந்தன

source: ref '%s' is excluded by the rev-list options
ta: ரெஃப் '%s' ரெவ்-பட்டியல் விருப்பங்களால் விலக்கப்படுகின்றன

source: unsupported bundle version %d
ta: ஆதரிக்கப்படாத மூட்டை பதிப்பு %d

source: cannot write bundle version %d with algorithm %s
ta: மூட்டை பதிப்பு %d ஐ நெறிமுறை %s உடன் எழுத முடியாது

source: Refusing to create empty bundle.
ta: வெற்று மூட்டை உருவாக்க மறுக்கிறது.

source: cannot create '%s'
ta: '%s' உருவாக்க முடியாது

source: index-pack died
ta: இன்டெக்ச்-கட்டு இறந்தது

source: terminating chunk id appears earlier than expected
ta: துண்டின் அடையாளம் நிறுத்தப்படுவது எதிர்பார்த்ததை விட முன்னதாகவே தோன்றுகிறது

source: chunk id %<PRIx32> not %d-byte aligned
ta: துண்டின் அடையாளம் %<PRIx32> %d-பைட் சீரமைக்கப்படவில்லை

source: improper chunk offset(s) %<PRIx64> and %<PRIx64>
ta: முறையற்ற துண்டின் ஆஃப்செட் (கள்) %<PRIx64> மற்றும் %<PRIx64>

source: duplicate chunk ID %<PRIx32> found
ta: நகல் துண்டின் அடையாளம் %<PRIx32> காணப்பட்டது

source: final chunk has non-zero id %<PRIx32>
ta: இறுதி துண்டுக்கு பூச்சியமற்ற அடையாளம் %<PRIx32> உள்ளது

source: invalid hash version
ta: தவறான ஆச் பதிப்பு

source: invalid color value: %.*s
ta: தவறான வண்ண மதிப்பு: %.*s

source: Add file contents to the index
ta: குறியீட்டில் கோப்பு உள்ளடக்கங்களைச் சேர்க்கவும்

source: Apply a series of patches from a mailbox
ta: ஒரு அஞ்சல் பெட்டியிலிருந்து தொடர்ச்சியான திட்டுகளைப் பயன்படுத்துங்கள்

source: Annotate file lines with commit information
ta: உறுதி தகவலுடன் கோப்பு வரிகளை சிறுகுறிப்பு செய்யுங்கள்

source: Apply a patch to files and/or to the index
ta: கோப்புகள் மற்றும்/அல்லது குறியீட்டுக்கு ஒரு இணைப்பு பயன்படுத்தவும்

source: Import a GNU Arch repository into Git
ta: ஒரு குனு வளைவு களஞ்சியத்தை கிட்ள் இறக்குமதி செய்யுங்கள்

source: Create an archive of files from a named tree
ta: பெயரிடப்பட்ட மரத்திலிருந்து கோப்புகளின் காப்பகத்தை உருவாக்கவும்

source: Use binary search to find the commit that introduced a bug
ta: ஒரு பிழையை அறிமுகப்படுத்திய உறுதிப்பாட்டைக் கண்டுபிடிக்க பைனரி தேடலைப் பயன்படுத்தவும்

source: Show what revision and author last modified each line of a file
ta: ஒரு கோப்பின் ஒவ்வொரு வரியையும் கடைசியாக மாற்றியமைத்தது என்ன என்பதைக் காட்டு

source: List, create, or delete branches
ta: கிளைகளை பட்டியலிடவும், உருவாக்கவும் அல்லது நீக்கவும்

source: Collect information for user to file a bug report
ta: பிழை அறிக்கையை தாக்கல் செய்ய பயனருக்கு தகவல்களை சேகரிக்கவும்

source: Move objects and refs by archive
ta: காப்பகத்தால் பொருள்கள் மற்றும் குறிப்புகளை நகர்த்தவும்

source: Provide contents or details of repository objects
ta: களஞ்சிய பொருட்களின் உள்ளடக்கங்கள் அல்லது விவரங்களை வழங்குதல்

source: Display gitattributes information
ta: gitattributes தகவலைக் காண்பி

source: Debug gitignore / exclude files
ta: கிட்னோர் பிழைத்திருத்த / கோப்புகளை விலக்கவும்

source: Show canonical names and email addresses of contacts
ta: தொடர்புகளின் நியமன பெயர்கள் மற்றும் மின்னஞ்சல் முகவரிகளைக் காண்பி

source: Ensures that a reference name is well formed
ta: குறிப்பு பெயர் நன்கு உருவாகிறது என்பதை உறுதி செய்கிறது

source: Switch branches or restore working tree files
ta: கிளைகளை மாற்றவும் அல்லது பணி மரக் கோப்புகளை மீட்டெடுக்கவும்

source: Copy files from the index to the working tree
ta: குறியீட்டிலிருந்து பணி மரத்திற்கு கோப்புகளை நகலெடுக்கவும்

source: Find commits yet to be applied to upstream
ta: அப்ச்ட்ரீமில் இன்னும் பயன்படுத்தப்படாமல் இருப்பதைக் கண்டறியவும்

source: Apply the changes introduced by some existing commits
ta: தற்போதுள்ள சில உறுதிடுகளால் அறிமுகப்படுத்தப்பட்ட மாற்றங்களைப் பயன்படுத்துங்கள்

source: Graphical alternative to git-commit
ta: git-commit க்கு வரைகலை மாற்று

source: Remove untracked files from the working tree
ta: பணி மரத்திலிருந்து கட்டுப்படுத்தப்படாத கோப்புகளை அகற்றவும்

source: Clone a repository into a new directory
ta: ஒரு களஞ்சியத்தை ஒரு புதிய கோப்பகமாக நகலி செய்யுங்கள்

source: Display data in columns
ta: நெடுவரிசைகளில் தரவைக் காண்பி

source: Record changes to the repository
ta: களஞ்சியத்தில் மாற்றங்களை பதிவு செய்யுங்கள்

source: Write and verify Git commit-graph files
ta: git உறுதி-வரைபடம் கோப்புகளை எழுதி சரிபார்

source: Create a new commit object
ta: புதிய உறுதி பொருளை உருவாக்கவும்

source: Get and set repository or global options
ta: களஞ்சியம் அல்லது உலகளாவிய விருப்பங்களைப் பெற்று அமைக்கவும்

source: Count unpacked number of objects and their disk consumption
ta: திறக்கப்படாத பொருட்களின் எண்ணிக்கையையும் அவற்றின் வட்டு நுகர்வுகளையும் எண்ணுங்கள்

source: Retrieve and store user credentials
ta: பயனர் சான்றுகளை மீட்டெடுத்து சேமிக்கவும்

source: Helper to temporarily store passwords in memory
ta: கடவுச்சொற்களை தற்காலிகமாக நினைவகத்தில் சேமிக்க உதவியாளர்

source: Helper to store credentials on disk
ta: நற்சான்றிதழ்களை வட்டில் சேமிக்க உதவியாளர்

source: Export a single commit to a CVS checkout
ta: சி.வி.எச் புதுப்பித்தலுக்கு ஒரு உறுதிப்பாட்டை ஏற்றுமதி செய்யுங்கள்

source: Salvage your data out of another SCM people love to hate
ta: உங்கள் தரவை மற்றொரு எச்சிஎம் மக்கள் வெறுக்க விரும்புகிறார்கள்

source: A CVS server emulator for Git
ta: அறிவிலி ஒரு சி.வி.எச் சேவையக முன்மாதிரி

source: A really simple server for Git repositories
ta: அறிவிலி களஞ்சியங்களுக்கான மிகவும் எளிய சேவையகம்

source: Give an object a human readable name based on an available ref
ta: கிடைக்கக்கூடிய ref இன் அடிப்படையில் ஒரு பொருளுக்கு மனிதப் படிக்கக்கூடிய பெயரைக் கொடுங்கள்

source: Generate a zip archive of diagnostic information
ta: கண்டறியும் தகவல்களின் சிப் காப்பகத்தை உருவாக்கவும்

source: Show changes between commits, commit and working tree, etc
ta: உறுதிச், உறுதி மற்றும் பணி மரம் போன்றவற்றுக்கு இடையில் மாற்றங்களைக் காட்டு

source: Compares files in the working tree and the index
ta: பணி மரம் மற்றும் குறியீட்டில் உள்ள கோப்புகளை ஒப்பிடுக

source: Compare a tree to the working tree or index
ta: ஒரு மரத்தை பணி மரம் அல்லது குறியீட்டுடன் ஒப்பிடுக

source: Compares the content and mode of blobs found via two tree objects
ta: இரண்டு மரப் பொருள்கள் வழியாகக் காணப்படும் குமிழ்களின் உள்ளடக்கம் மற்றும் பயன்முறையை ஒப்பிடுகிறது

source: Show changes using common diff tools
ta: பொதுவான வேறுபாடு கருவிகளைப் பயன்படுத்தி மாற்றங்களைக் காட்டு

source: Git data exporter
ta: அறிவிலி தரவு ஏற்றுமதியாளர்

source: Backend for fast Git data importers
ta: வேகமான அறிவிலி தரவு இறக்குமதியாளர்களுக்கான பின்தளத்தில்

source: Download objects and refs from another repository
ta: மற்றொரு களஞ்சியத்திலிருந்து பொருள்கள் மற்றும் குறிப்புகளைப் பதிவிறக்கவும்

source: Receive missing objects from another repository
ta: மற்றொரு களஞ்சியத்திலிருந்து காணாமல் போன பொருட்களைப் பெறுங்கள்

source: Rewrite branches
ta: கிளைகளை மீண்டும் எழுதவும்

source: Produce a merge commit message
ta: ஒன்றிணைக்கும் செய்தியை உருவாக்குங்கள்

source: Output information on each ref
ta: ஒவ்வொரு குறிப்பிலும் வெளியீட்டு செய்தி

source: Run a Git command on a list of repositories
ta: களஞ்சியங்களின் பட்டியலில் ஒரு அறிவிலி கட்டளையை இயக்கவும்

source: Prepare patches for e-mail submission
ta: மின்னஞ்சல் சமர்ப்பிப்புக்கு திட்டுகளைத் தயாரிக்கவும்

source: Verifies the connectivity and validity of the objects in the database
ta: தரவுத்தளத்தில் உள்ள பொருட்களின் இணைப்பு மற்றும் செல்லுபடியை சரிபார்க்கிறது

source: Cleanup unnecessary files and optimize the local repository
ta: தேவையற்ற கோப்புகளை தூய்மை செய்து உள்ளக களஞ்சியத்தை மேம்படுத்தவும்

source: Extract commit ID from an archive created using git-archive
ta: git-archive பயன்படுத்தி உருவாக்கப்பட்ட ஒரு காப்பகத்திலிருந்து உறுதி ஐடியைப் பிரித்தெடுக்கவும்

source: Print lines matching a pattern
ta: ஒரு வடிவத்துடன் பொருந்தக்கூடிய கோடுகளை அச்சிடுங்கள்

source: A portable graphical interface to Git
ta: git க்கு ஒரு சிறிய வரைகலை இடைமுகம்

source: Compute object ID and optionally create an object from a file
ta: பொருள் ஐடியைக் கணக்கிட்டு, விருப்பமாக ஒரு கோப்பிலிருந்து ஒரு பொருளை உருவாக்கவும்

source: Display help information about Git
ta: git பற்றிய உதவி தகவலைக் காண்பி

source: Run git hooks
ta: git கொக்கிகள் இயக்கவும்

source: Server side implementation of Git over HTTP
ta: http க்கு மேல் git இன் சேவையக பக்க செயல்படுத்தல்

source: Download from a remote Git repository via HTTP
ta: தொலை அறிவிலி களஞ்சியத்திலிருந்து http வழியாக பதிவிறக்கவும்

source: Push objects over HTTP/DAV to another repository
ta: http/dav மீது பொருட்களை மற்றொரு களஞ்சியத்திற்கு தள்ளுங்கள்

source: Send a collection of patches from stdin to an IMAP folder
ta: stdin இலிருந்து imap கோப்புறைக்கு திட்டுகளின் தொகுப்பை அனுப்பவும்

source: Build pack index file for an existing packed archive
ta: ஏற்கனவே உள்ள கட்டு காப்பகத்திற்கான கட்டு குறியீட்டு கோப்பை உருவாக்குங்கள்

source: Create an empty Git repository or reinitialize an existing one
ta: வெற்று அறிவிலி களஞ்சியத்தை உருவாக்கவும் அல்லது ஏற்கனவே உள்ள ஒன்றை மீண்டும் தொடங்கவும்

source: Instantly browse your working repository in gitweb
ta: கிட்வெபில் உங்கள் பணி களஞ்சியத்தை உடனடியாக உலாவுக

source: Add or parse structured information in commit messages
ta: உறுதி செய்திகளில் கட்டமைக்கப்பட்ட தகவல்களைச் சேர்க்கவும் அல்லது பாகுபடுத்தவும்

source: Show commit logs
ta: உறுதி பதிவுகளைக் காட்டு

source: Show information about files in the index and the working tree
ta: குறியீட்டில் உள்ள கோப்புகள் மற்றும் பணி மரத்தில் உள்ள தகவல்களைக் காட்டு

source: List references in a remote repository
ta: தொலை களஞ்சியத்தில் குறிப்புகளை பட்டியலிடுங்கள்

source: List the contents of a tree object
ta: மரத்தின் பொருளின் உள்ளடக்கங்களை பட்டியலிடுங்கள்

source: Extracts patch and authorship from a single e-mail message
ta: ஒற்றை மின்னஞ்சல் செய்தியிலிருந்து இணைப்பு மற்றும் படைப்புரிமையை பிரித்தெடுக்கிறது

source: Simple UNIX mbox splitter program
ta: எளிய யூனிக்ச் எம்பாக்ச் ச்ப்ளிட்டர் நிரல்

source: Run tasks to optimize Git repository data
ta: அறிவிலி களஞ்சிய தரவை மேம்படுத்த பணிகளை இயக்கவும்

source: Join two or more development histories together
ta: இரண்டு அல்லது அதற்கு மேற்பட்ட மேம்பாட்டு வரலாறுகளில் ஒன்றாக சேரவும்

source: Find as good common ancestors as possible for a merge
ta: ஒன்றிணைக்க முடிந்தவரை நல்ல பொதுவான மூதாதையர்களைக் கண்டறியவும்

source: Run a three-way file merge
ta: மூன்று வழி கோப்பு ஒன்றிணையை இயக்கவும்

source: Run a merge for files needing merging
ta: ஒன்றிணைக்க வேண்டிய கோப்புகளுக்கான ஒன்றிணையை இயக்கவும்

source: The standard helper program to use with git-merge-index
ta: git-merge-index உடன் பயன்படுத்த நிலையான உதவி திட்டம்

source: Perform merge without touching index or working tree
ta: குறியீட்டு அல்லது பணி மரம் இல்லாமல் ஒன்றிணைக்கவும்

source: Run merge conflict resolution tools to resolve merge conflicts
ta: ஒன்றிணைக்கும் மோதல்களைத் தீர்க்க ஒன்றிணைக்கும் மோதல் தீர்க்கும் கருவிகளை இயக்கவும்

source: Creates a tag object with extra validation
ta: கூடுதல் சரிபார்ப்புடன் ஒரு குறிச்சொல் பொருளை உருவாக்குகிறது

source: Build a tree-object from ls-tree formatted text
ta: எல்.எச்-மர வடிவமைக்கப்பட்ட உரையிலிருந்து ஒரு மரத்தை உருவாக்குங்கள்

source: Write and verify multi-pack-indexes
ta: மல்டி-கட்டு-இன்டெக்சை எழுதி சரிபார்

source: Move or rename a file, a directory, or a symlink
ta: ஒரு கோப்பு, ஒரு அடைவு அல்லது ஒரு சிம்லிங்கை நகர்த்தவும் அல்லது மறுபெயரிடவும்

source: Find symbolic names for given revs
ta: கொடுக்கப்பட்ட rev களுக்கு குறியீட்டு பெயர்களைக் கண்டறியவும்

source: Add or inspect object notes
ta: பொருள் குறிப்புகளைச் சேர்க்கவும் அல்லது ஆய்வு செய்யவும்

source: Import from and submit to Perforce repositories
ta: இறக்குமதி செய்து துளையிடும் களஞ்சியங்களுக்கு சமர்ப்பிக்கவும்

source: Create a packed archive of objects
ta: பொருள்களின் நிரம்பிய காப்பகத்தை உருவாக்கவும்

source: Find redundant pack files
ta: தேவையற்ற கட்டு கோப்புகளைக் கண்டறியவும்

source: Pack heads and tags for efficient repository access
ta: திறமையான களஞ்சிய அணுகலுக்கான தலைகள் மற்றும் குறிச்சொற்களை கட்டு செய்யுங்கள்

source: Compute unique ID for a patch
ta: ஒரு இணைப்புக்கு தனித்துவமான ஐடியைக் கணக்கிடுங்கள்

source: Prune all unreachable objects from the object database
ta: அணுக முடியாத அனைத்து பொருட்களையும் பொருள் தரவுத்தளத்திலிருந்து கத்தரிக்கவும்

source: Remove extra objects that are already in pack files
ta: ஏற்கனவே கட்டு கோப்புகளில் உள்ள கூடுதல் பொருள்களை அகற்றவும்

source: Fetch from and integrate with another repository or a local branch
ta: மற்றொரு களஞ்சியம் அல்லது உள்ளக கிளையுடன் இருந்து ஒருங்கிணைக்கவும்

source: Update remote refs along with associated objects
ta: தொடர்புடைய பொருள்களுடன் தொலை குறிப்புகளைப் புதுப்பிக்கவும்

source: Applies a quilt patchset onto the current branch
ta: தற்போதைய கிளையில் ஒரு குயில்ட் பேட்செட்டைப் பயன்படுத்துகிறது

source: Compare two commit ranges (e.g. two versions of a branch)
ta: இரண்டு உறுதி வரம்புகளை ஒப்பிடுக (எ.கா. ஒரு கிளையின் இரண்டு பதிப்புகள்)

source: Reads tree information into the index
ta: மரத் தகவல்களை குறியீட்டில் படிக்கிறது

source: Reapply commits on top of another base tip
ta: மற்றொரு அடிப்படை நுனியின் மேல் மீண்டும் பயன்படுத்துதல்

source: Receive what is pushed into the repository
ta: களஞ்சியத்தில் தள்ளப்பட்டதைப் பெறுங்கள்

source: Manage reflog information
ta: பிரதிபலிப்பு தகவல்களை நிர்வகிக்கவும்

source: Manage set of tracked repositories
ta: கண்காணிக்கப்பட்ட களஞ்சியங்களின் தொகுப்பை நிர்வகிக்கவும்

source: Pack unpacked objects in a repository
ta: திறக்கப்படாத பொருள்களை களஞ்சியத்தில் கட்டு செய்யுங்கள்

source: Create, list, delete refs to replace objects
ta: பொருள்களை மாற்ற refs ஐ உருவாக்கவும், பட்டியலிடவும், நீக்கவும்

source: EXPERIMENTAL: Replay commits on a new base, works with bare repos too
ta: சோதனை: ரீப்ளே ஒரு புதிய தளத்தில் ஈடுபடுகிறது, வெற்று களஞ்சியங்களுடனும் செயல்படுகிறது

source: Generates a summary of pending changes
ta: நிலுவையில் உள்ள மாற்றங்களின் சுருக்கத்தை உருவாக்குகிறது

source: Reuse recorded resolution of conflicted merges
ta: முரண்பட்ட ஒன்றிணைப்புகளின் பதிவு செய்யப்பட்ட தீர்மானத்தை மறுபயன்பாடு செய்யுங்கள்

source: Reset current HEAD to the specified state
ta: தற்போதைய தலையை குறிப்பிட்ட நிலைக்கு மீட்டமைக்கவும்

source: Restore working tree files
ta: பணி மரக் கோப்புகளை மீட்டெடுக்கவும்

source: Lists commit objects in reverse chronological order
ta: பட்டியல்கள் தலைகீழ் காலவரிசைப்படி பொருட்களைச் செய்கின்றன

source: Pick out and massage parameters
ta: அளவுருக்களைத் தேர்ந்தெடுத்து மசாச் செய்யுங்கள்

source: Revert some existing commits
ta: தற்போதுள்ள சில உறுதிடுகளை மாற்றவும்

source: Remove files from the working tree and from the index
ta: பணி மரத்திலிருந்தும் குறியீட்டிலிருந்தும் கோப்புகளை அகற்றவும்

source: Send a collection of patches as emails
ta: திட்டுகளின் தொகுப்பை மின்னஞ்சல்களாக அனுப்பவும்

source: Push objects over Git protocol to another repository
ta: அறிவிலி நெறிமுறையின் மீது பொருட்களை மற்றொரு களஞ்சியத்திற்கு தள்ளுங்கள்

source: Git's i18n setup code for shell scripts
ta: செல் ச்கிரிப்ட்களுக்கான git இன் ப18ல் அமைவு குறியீடு

source: Common Git shell script setup code
ta: பொதுவான அறிவிலி செல் ச்கிரிப்ட் அமைவு குறியீடு

source: Restricted login shell for Git-only SSH access
ta: git- மட்டும் பாஓடு அணுகலுக்கான தடைசெய்யப்பட்ட உள்நுழைவு செல்

source: Summarize 'git log' output
ta: 'அறிவிலி பதிவு' வெளியீட்டை சுருக்கமாகக் கூறுங்கள்

source: Show various types of objects
ta: பல்வேறு வகையான பொருட்களைக் காட்டு

source: Show branches and their commits
ta: கிளைகள் மற்றும் அவற்றின் உறுதிடிகளைக் காட்டு

source: Show packed archive index
ta: நிரம்பிய காப்பக குறியீட்டைக் காட்டு

source: List references in a local repository
ta: உள்ளக களஞ்சியத்தில் குறிப்புகளை பட்டியலிடுங்கள்

source: Reduce your working tree to a subset of tracked files
ta: கண்காணிக்கப்பட்ட கோப்புகளின் துணைக்குழுவுக்கு உங்கள் பணி மரத்தை குறைக்கவும்

source: Add file contents to the staging area
ta: ச்டேசிங் பகுதிக்கு கோப்பு உள்ளடக்கங்களைச் சேர்க்கவும்

source: Stash the changes in a dirty working directory away
ta: ஒரு அழுக்கு பணி கோப்பகத்தில் மாற்றங்களை அடுக்கி வைக்கவும்

source: Show the working tree status
ta: பணி மர நிலையை காட்டு

source: Remove unnecessary whitespace
ta: தேவையற்ற இடைவெளியை அகற்று

source: Initialize, update or inspect submodules
ta: துணைதொகுதிகளைத் தொடங்கவும், புதுப்பிக்கவும் அல்லது ஆய்வு செய்யவும்

source: Bidirectional operation between a Subversion repository and Git
ta: ஒரு துணை களஞ்சியம் மற்றும் அறிவிலி இடையே இருதரப்பு செயல்பாடு

source: Switch branches
ta: கிளைகளை மாற்றவும்

source: Read, modify and delete symbolic refs
ta: குறியீட்டு குறிப்புகளைப் படிக்கவும், மாற்றவும் நீக்கவும்

source: Create, list, delete or verify a tag object signed with GPG
ta: சிபிசியுடன் கையொப்பமிடப்பட்ட குறிச்சொல் பொருளை உருவாக்க, பட்டியலிட, நீக்க அல்லது சரிபார்

source: Creates a temporary file with a blob's contents
ta: ஒரு குமிழியின் உள்ளடக்கங்களுடன் தற்காலிக கோப்பை உருவாக்குகிறது

source: Unpack objects from a packed archive
ta: நிரம்பிய காப்பகத்திலிருந்து பொருட்களைத் திறக்கவும்

source: Register file contents in the working tree to the index
ta: பணி மரத்தில் கோப்பு உள்ளடக்கங்களை குறியீட்டுக்கு பதிவு செய்யுங்கள்

source: Update the object name stored in a ref safely
ta: பாதுகாப்பாக சேமிக்கப்பட்ட பொருள் பெயரை புதுப்பிக்கவும்

source: Update auxiliary info file to help dumb servers
ta: ஊமை சேவையகங்களுக்கு உதவ துணை செய்தி கோப்பைப் புதுப்பிக்கவும்

source: Send archive back to git-archive
ta: காப்பகத்தை மீண்டும் git-archive க்கு அனுப்பவும்

source: Send objects packed back to git-fetch-pack
ta: கட்டு செய்யப்பட்ட பொருட்களை மீண்டும் git-fetch-pack க்கு அனுப்பவும்

source: Show a Git logical variable
ta: ஒரு அறிவிலி தருக்க மாறியைக் காட்டு

source: Check the GPG signature of commits
ta: உறுதிசின் சிபிசி கையொப்பத்தை சரிபார்

source: Validate packed Git archive files
ta: கட்டு செய்யப்பட்ட அறிவிலி காப்பக கோப்புகளை சரிபார்

source: Check the GPG signature of tags
ta: குறிச்சொற்களின் சிபிசி கையொப்பத்தை சரிபார்

source: Display version information about Git
ta: git பற்றிய பதிப்பு தகவல்களைக் காண்பி

source: Show logs with differences each commit introduces
ta: ஒவ்வொரு உறுதிப்பாடும் அறிமுகப்படுத்தும் வேறுபாடுகளுடன் பதிவுகளைக் காட்டு

source: Manage multiple working trees
ta: பல பணி மரங்களை நிர்வகிக்கவும்

source: Create a tree object from the current index
ta: தற்போதைய குறியீட்டிலிருந்து ஒரு மர பொருளை உருவாக்கவும்

source: Defining attributes per path
ta: ஒரு பாதைக்கு பண்புகளை வரையறுத்தல்

source: Git command-line interface and conventions
ta: அறிவிலி கட்டளை-வரி இடைமுகம் மற்றும் மரபுகள்

source: A Git core tutorial for developers
ta: டெவலப்பர்களுக்கான அறிவிலி கோர் பயிற்சி

source: Providing usernames and passwords to Git
ta: பயனர்பெயர்கள் மற்றும் கடவுச்சொற்களை git க்கு வழங்குதல்

source: Git for CVS users
ta: சி.வி.எச் பயனர்களுக்கான அறிவிலி

source: Tweaking diff output
ta: முறுக்கு வேறுபாடு வெளியீடு

source: A useful minimum set of commands for Everyday Git
ta: அன்றாட அறிவிலி ஒரு பயனுள்ள குறைந்தபட்ச கட்டளைகளின் தொகுப்பு

source: Frequently asked questions about using Git
ta: அறிவிலி பயன்படுத்துவது குறித்து அடிக்கடி கேட்கப்படும் கேள்விகள்

source: The bundle file format
ta: மூட்டை கோப்பு வடிவம்

source: Chunk-based file formats
ta: துண்டின் அடிப்படையிலான கோப்பு வடிவங்கள்

source: Git commit-graph format
ta: அறிவிலி உறுதி-வரைபடம் வடிவம்

source: Git index format
ta: அறிவிலி குறியீட்டு வடிவம்

source: Git pack format
ta: அறிவிலி கட்டு வடிவம்

source: Git cryptographic signature formats
ta: அறிவிலி கிரிப்டோகிராஃபிக் கையொப்ப வடிவங்கள்

source: A Git Glossary
ta: ஒரு அறிவிலி சொற்களஞ்சியம்

source: Hooks used by Git
ta: அறிவிலி பயன்படுத்தும் கொக்கிகள்

source: Specifies intentionally untracked files to ignore
ta: புறக்கணிக்க வேண்டுமென்றே அறியப்படாத கோப்புகளைக் குறிப்பிடுகிறது

source: The Git repository browser
ta: அறிவிலி களஞ்சிய உலாவி

source: Map author/committer names and/or E-Mail addresses
ta: வரைபட ஆசிரியர்/கமிசர் பெயர்கள் மற்றும்/அல்லது மின்னஞ்சல் முகவரிகள்

source: Defining submodule properties
ta: துணைதொகுதி பண்புகளை வரையறுத்தல்

source: Git namespaces
ta: அறிவிலி பெயர்வெளிகள்

source: Protocol v0 and v1 capabilities
ta: நெறிமுறை v0 மற்றும் v1 திறன்கள்

source: Things common to various protocols
ta: பல்வேறு நெறிமுறைகளுக்கு பொதுவான விசயங்கள்

source: Git HTTP-based protocols
ta: git http- அடிப்படையிலான நெறிமுறைகள்

source: How packs are transferred over-the-wire
ta: பொய்களுக்கு மேல் பொதிகள் எவ்வாறு மாற்றப்படுகின்றன

source: Git Wire Protocol, Version 2
ta: அறிவிலி கம்பி நெறிமுறை, பதிப்பு 2

source: Helper programs to interact with remote repositories
ta: தொலைநிலை களஞ்சியங்களுடன் தொடர்பு கொள்ள உதவி திட்டங்கள்

source: Git Repository Layout
ta: அறிவிலி களஞ்சிய தளவமைப்பு

source: Specifying revisions and ranges for Git
ta: அறிவிலி திருத்தங்கள் மற்றும் வரம்புகளைக் குறிப்பிடுகிறது

source: Mounting one repository inside another
ta: ஒரு களஞ்சியத்தை மற்றொன்றுக்குள் ஏற்றுவது
