Repository: Nizhal/git-ta-po
Catalog: po/*.po
Languages: ta

source: You can amend the commit now, with git commit --amend %s Once you are satisfied with your changes, run git rebase --continue
ta: நீங்கள் இப்போது உறுதிப்பாட்டை திருத்தலாம் git commit --amend %s உங்கள் மாற்றங்களில் நீங்கள் நிறைவு அடைந்தவுடன், இயக்கவும் git rebase --continue

source: Could not apply %s... %.*s
ta: %s ... %.*s ஐப் பயன்படுத்த முடியவில்லை

source: Could not merge %.*s
ta: %.*s ஐ ஒன்றிணைக்க முடியவில்லை

source: Executing: %s
ta: செயல்படுத்துதல்: %s

source: execution failed: %s %sYou can fix the problem, and then run git rebase --continue
ta: இயக்கம் தோல்வியடைந்தது: %s %s நீங்கள் சிக்கலை சரிசெய்ய முடியும், பின்னர் இயக்க முடியும் git rebase --continue

source: and made changes to the index and/or the working tree.
ta: மற்றும் குறியீட்டு மற்றும்/அல்லது பணி மரத்தில் மாற்றங்களைச் செய்தது.

source: execution succeeded: %s but left changes to the index and/or the working tree. Commit or stash your changes, and then run git rebase --continue
ta: இயக்கம் செய் பெற்றது: %s ஆனால் குறியீட்டு மற்றும்/அல்லது பணி மரத்தில் இடது மாற்றங்கள். உங்கள் மாற்றங்களைச் செய்யுங்கள் அல்லது சேமிக்கவும், பின்னர் இயக்கவும் git rebase --continue

source: illegal label name: '%.*s'
ta: சட்டவிரோத சிட்டை பெயர்: '%.*s'

source: could not resolve '%s'
ta: '%s' தீர்க்க முடியவில்லை

source: writing fake root commit
ta: போலி வேர் உறுதி எழுதுதல்

source: writing squash-onto
ta: ச்குவாச்-ஒன்டோ எழுதுதல்

source: cannot merge without a current revision
ta: தற்போதைய திருத்தம் இல்லாமல் ஒன்றிணைக்க முடியாது

source: unable to parse '%.*s'
ta: '%.*s' ஐ அலச முடியவில்லை

source: nothing to merge: '%.*s'
ta: ஒன்றிணைக்க எதுவும் இல்லை: '%.*s'

source: octopus merge cannot be executed on top of a [new root]
ta: ஆக்டோபச் ஒன்றிணைப்பை [புதிய வேர்] மேல் செயல்படுத்த முடியாது

source: could not get commit message of '%s'
ta: '%s' இன் செய்தியைச் பெற முடியவில்லை

source: could not even attempt to merge '%.*s'
ta: '%.*s' ஐ ஒன்றிணைக்க கூட முயற்சிக்க முடியவில்லை

source: merge: Unable to write new index file
ta: ஒன்றிணைத்தல்: புதிய குறியீட்டு கோப்பை எழுத முடியவில்லை

source: another 'rebase' process appears to be running; '%s.lock' already exists
ta: மற்றொரு 'மறுதொடக்கம்' செயல்முறை இயங்குவதாகத் தெரிகிறது; '%s.lock' ஏற்கனவே உள்ளது

source: Updated the following refs with %s: %s
ta: பின்வரும் குறிப்புகள் %s உடன் புதுப்பிக்கப்பட்டன: %s

source: Failed to update the following refs with %s: %s
ta: %s உடன் பின்வரும் குறிப்புகளைப் புதுப்பிக்கத் தவறிவிட்டது: %s

source: Cannot autostash
ta: ஆட்டோச்டாச் செய்ய முடியாது

source: Unexpected stash response: '%s'
ta: எதிர்பாராத ச்டாச் பதில்: '%s'

source: Could not create directory for '%s'
ta: '%s' க்கான கோப்பகத்தை உருவாக்க முடியவில்லை

source: Created autostash: %s
ta: உருவாக்கப்பட்ட ஆட்டோச்டாச்: %s

source: could not reset --hard
ta: மீட்டமைக்க முடியவில்லை --hard

source: Applied autostash.
ta: பயன்பாட்டு ஆட்டோச்டாச்.

source: cannot store %s
ta: %s ஐ சேமிக்க முடியாது

source: %s Your changes are safe in the stash. You can run "git stash pop" or "git stash drop" at any time.
ta: %s உங்கள் மாற்றங்கள் ச்டாசில் பாதுகாப்பானவை. நீங்கள் எந்த நேரத்திலும் "அறிவிலி ச்டாச் பாப்" அல்லது "அறிவிலி ச்டாச் டிராப்" ஐ இயக்கலாம்.

source: Applying autostash resulted in conflicts.
ta: ஆட்டோச்டாசைப் பயன்படுத்துவதால் மோதல்கள் ஏற்பட்டன.

source: Autostash exists; creating a new stash entry.
ta: ஆட்டோச்டாச் உள்ளது; புதிய ச்டாச் நுழைவை உருவாக்குதல்.

source: autostash reference is a symref
ta: ஆட்டோச்டாச் குறிப்பு ஒரு சிமிரெஃப்

source: could not detach HEAD
ta: தலையைப் பிரிக்க முடியவில்லை

source: Stopped at HEAD
ta: தலையில் நிறுத்தப்பட்டது

source: Stopped at %s
ta: %s இல் நிறுத்தப்பட்டது

source: Could not execute the todo command %.*s It has been rescheduled; To edit the command before continuing, please edit the todo list first: git rebase --edit-todo git rebase --continue
ta: செய்யவேண்டிய கட்டளையை இயக்க முடியவில்லை %.*s அது மாற்றியமைக்கப்பட்டுள்ளது; தொடர்வதற்கு முன் கட்டளையைத் திருத்த, தயவுசெய்து செய்யவேண்டிய பட்டியலை முதலில் திருத்தவும்: git rebase --edit-todo git rebase --continue

source: Stopped at %s... %.*s
ta: %s... இல் நிறுத்தப்பட்டது %.*s

source: Rebasing (%d/%d)%s
ta: மறுசீரமைத்தல் (%d/%d)%s

source: unknown command %d
ta: அறியப்படாத கட்டளை %d

source: could not read orig-head
ta: தோற்றம்-தலை படிக்க முடியவில்லை

source: could not read 'onto'
ta: 'ஆன்' படிக்க முடியவில்லை

source: could not update HEAD to %s
ta: தலையை %s க்கு புதுப்பிக்க முடியவில்லை

source: Successfully rebased and updated %s.
ta: வெற்றிகரமாக மறுவடிவமைப்பு மற்றும் புதுப்பிக்கப்பட்ட %s.

source: cannot rebase: You have unstaged changes.
ta: திரும்பப் பெற முடியாது: உங்களிடம் நிலையற்ற மாற்றங்கள் உள்ளன.

source: cannot amend non-existing commit
ta: இல்லாத உறுதிப்பாட்டை திருத்த முடியாது

source: invalid file: '%s'
ta: தவறான கோப்பு: '%s'

source: invalid contents: '%s'
ta: தவறான உள்ளடக்கங்கள்: '%s'

source: You have uncommitted changes in your working tree. Please, commit them first and then run 'git rebase --continue' again.
ta: உங்கள் பணி மரத்தில் மாற்றப்படாத மாற்றங்கள் உள்ளன. தயவுசெய்து, அவர்களை செய்யுங்கள் முதலில் 'git rebase --continue' ஐ மீண்டும் இயக்கவும்.

source: could not write file: '%s'
ta: கோப்பை எழுத முடியவில்லை: '%s'

source: could not remove CHERRY_PICK_HEAD
ta: CHERRY_PICK_HEAD அகற்ற முடியவில்லை

source: could not commit staged changes.
ta: அரங்கேற்ற மாற்றங்களைச் செய்ய முடியவில்லை.

source: %s: can't cherry-pick a %s
ta: %s: செர்ரி-பிக் ஒரு %s

source: %s: bad revision
ta: %s: மோசமான திருத்தம்

source: can't revert as initial commit
ta: ஆரம்ப உறுதிப்பாடாக மாற்ற முடியாது

source: skipped previously applied commit %s
ta: முன்னர் பயன்படுத்தப்பட்ட உறுதி %s தவிர்த்தது

source: use --reapply-cherry-picks to include skipped commits
ta: தவிர்க்கப்பட்ட உறுதிடுகளைச் சேர்க்க --reapply-cherry-picks ஐப் பயன்படுத்தவும்

source: make_script: unhandled options
ta: make_script: தடையற்ற விருப்பங்கள்

source: make_script: error preparing revisions
ta: make_script: திருத்தங்களைத் தயாரிப்பதில் பிழை

source: nothing to do
ta: ஒன்றும் செய்வதற்கில்லை

source: could not skip unnecessary pick commands
ta: தேவையற்ற தேர்வு கட்டளைகளைத் தவிர்க்க முடியவில்லை

source: the script was already rearranged.
ta: ச்கிரிப்ட் ஏற்கனவே மறுசீரமைக்கப்பட்டது.

source: update-refs file at '%s' is invalid
ta: '%s' இல் புதுப்பிப்பு-refs கோப்பு தவறானது

source: '%s' is outside repository at '%s'
ta: '%s' என்பது '%s' இல் களஞ்சியத்திற்கு வெளியே உள்ளது

source: %s: no such path in the working tree. Use 'git <command> -- <path>...' to specify paths that do not exist locally.
ta: %s: பணி மரத்தில் அத்தகைய பாதை இல்லை. உள்நாட்டில் இல்லாத பாதைகளைக் குறிப்பிட 'அறிவிலி <கட்டளை> - <athe> ...' ஐப் பயன்படுத்தவும்.

source: ambiguous argument '%s': unknown revision or path not in the working tree. Use '--' to separate paths from revisions, like this: 'git <command> [<revision>...] -- [<file>...]'
ta: தெளிவற்ற உரையாடல் '%s': அறியப்படாத திருத்தம் அல்லது பாதை பணி மரத்தில் இல்லை. இது போன்ற திருத்தங்களிலிருந்து பாதைகளை பிரிக்க '-' பயன்படுத்தவும்: 'அறிவிலி <கட்டளை> [<திருத்தம்> ...] - [<file> ...]'

source: option '%s' must come before non-option arguments
ta: விருப்பம் '%s' விருப்பமற்ற வாதங்களுக்கு முன் வர வேண்டும்

source: ambiguous argument '%s': both revision and filename Use '--' to separate paths from revisions, like this: 'git <command> [<revision>...] -- [<file>...]'
ta: தெளிவற்ற உரையாடல் '%s': திருத்தம் மற்றும் கோப்பு பெயர் இரண்டும் இது போன்ற திருத்தங்களிலிருந்து பாதைகளை பிரிக்க '-' பயன்படுத்தவும்: 'அறிவிலி <கட்டளை> [<திருத்தம்> ...] - [<file> ...]'

source: unable to set up work tree using invalid config
ta: தவறான உள்ளமைவைப் பயன்படுத்தி பணி மரத்தை அமைக்க முடியவில்லை

source: Expected git repo version <= %d, found %d
ta: எதிர்பார்க்கப்படும் அறிவிலி ரெப்போ பதிப்பு <= %d, காணப்படுகிறது %d

source: unknown repository extension found:
ta: அறியப்படாத களஞ்சிய நீட்டிப்பு காணப்படுகிறது:

source: repo version is 0, but v1-only extension found:
ta: ரெப்போ பதிப்பு 0, ஆனால் வி 1-மட்டும் நீட்டிப்பு காணப்படுகிறது:

source: error opening '%s'
ta: '%s' திறப்பது பிழை

source: too large to be a .git file: '%s'
ta: ஒரு .git கோப்பாக மிகப் பெரியது: '%s'

source: error reading %s
ta: %s வாசிப்பு

source: invalid gitfile format: %s
ta: தவறான கிட்ஃபைல் வடிவம்: %s

source: no path in gitfile: %s
ta: கிட்ஃபைலில் பாதை இல்லை: %s

source: not a git repository: %s
ta: ஒரு அறிவிலி களஞ்சியம் அல்ல: %s

source: '$%s' too big
ta: '$%s' மிகப் பெரியது

source: not a git repository: '%s'
ta: ஒரு அறிவிலி களஞ்சியம் அல்ல: '%s'

source: cannot chdir to '%s'
ta: chdir பெறுநர் '%s'

source: cannot come back to cwd
ta: cwd க்கு மீண்டும் வர முடியாது

source: failed to stat '%*s%s%s'
ta: stat '%*s%s%s' இல் தோல்வியுற்றது

source: detected dubious ownership in repository at '%s' %sTo add an exception for this directory, call: git config --global --add safe.directory %s
ta: '%s' இல் களஞ்சியத்தில் சந்தேகத்திற்குரிய உரிமையைக் கண்டறியப்பட்டது %s இந்த கோப்பகத்திற்கு ஒரு விதிவிலக்கைச் சேர்க்க, அழை: git config --global --add safe.directory %s

source: Unable to read current working directory
ta: தற்போதைய பணி கோப்பகத்தைப் படிக்க முடியவில்லை

source: cannot change to '%s'
ta: '%s' என மாற்ற முடியாது

source: not a git repository (or any of the parent directories): %s
ta: ஒரு அறிவிலி களஞ்சியம் அல்ல (அல்லது பெற்றோர் கோப்பகங்களில் ஏதேனும்): %s

source: not a git repository (or any parent up to mount point %s) Stopping at filesystem boundary (GIT_DISCOVERY_ACROSS_FILESYSTEM not set).
ta: ஒரு அறிவிலி களஞ்சியம் அல்ல (அல்லது மவுண்ட் பாயிண்ட் %s வரை எந்த பெற்றோரும்) கோப்பு முறைமை எல்லையில் நிறுத்துதல் (GIT_DISCOVERY_ACROSS_FILESYSTEM அமைக்கப்படவில்லை).

source: cannot use bare repository '%s' (safe.bareRepository is '%s')
ta: வெற்று களஞ்சியத்தை '%s' (safe.bareRepository என்பது '%s') பயன்படுத்த முடியாது)

source: problem with core.sharedRepository filemode value (0%.3o). The owner of files must always have read and write permissions.
ta: core.sharedRepository filemode மதிப்பு (0%.3o) உடன் சிக்கல். கோப்புகளின் உரிமையாளர் எப்போதும் படித்து எழுத அனுமதித்திருக்க வேண்டும்.

source: fork failed
ta: முட்கரண்டி தோல்வியடைந்தது

source: setsid failed
ta: setsid தோல்வியுற்றது

source: cannot stat template '%s'
ta: ச்டேட் வார்ப்புரு '%s'

source: cannot opendir '%s'
ta: ஓபண்டிர் '%s'

source: cannot readlink '%s'
ta: '%s' என்ற அளவைப் படிக்க முடியாது

source: cannot symlink '%s' '%s'
ta: '%s'%s '

source: cannot copy '%s' to '%s'
ta: '%s' ஐ '%s' க்கு நகலெடுக்க முடியாது

source: ignoring template %s
ta: வார்ப்புரு %s புறக்கணித்தல்

source: templates not found in %s
ta: வார்ப்புருக்கள் %s இல் காணப்படவில்லை

source: not copying templates from '%s': %s
ta: '%s' இலிருந்து வார்ப்புருக்கள் நகலெடுக்கவில்லை: %s

source: invalid initial branch name: '%s'
ta: தவறான ஆரம்ப கிளை பெயர்: '%s'

source: re-init: ignored --initial-branch=%s
ta: மீண்டும் தொடங்குதல்: புறக்கணிக்கப்பட்ட --initial-branch=%s

source: unable to handle file type %d
ta: கோப்பு வகை %d ஐ கையாள முடியவில்லை

source: unable to move %s to %s
ta: %s க்கு %s க்கு நகர்த்த முடியவில்லை

source: attempt to reinitialize repository with different hash
ta: வெவ்வேறு ஆசுடன் களஞ்சியத்தை மீண்டும் நிறைவேற்ற முயற்சி

source: attempt to reinitialize repository with different reference storage format
ta: வெவ்வேறு குறிப்பு சேமிப்பக வடிவத்துடன் களஞ்சியத்தை மீண்டும் நிறைவேற்ற முயற்சிக்கவும்

source: %s already exists
ta: %s ஏற்கனவே உள்ளன

source: Reinitialized existing shared Git repository in %s%s
ta: %s %s இல் தற்போதுள்ள பகிரப்பட்ட அறிவிலி களஞ்சியத்தை மறுசீரமைத்தது

source: Reinitialized existing Git repository in %s%s
ta: %s %s இல் தற்போதுள்ள அறிவிலி களஞ்சியத்தை மறுசீரமைத்தது

source: Initialized empty shared Git repository in %s%s
ta: %s %s இல் வெற்று பகிரப்பட்ட அறிவிலி களஞ்சியத்தை துவக்கியது

source: Initialized empty Git repository in %s%s
ta: %s %s இல் வெற்று அறிவிலி களஞ்சியத்தை துவக்கியது

source: index entry is a directory, but not sparse (%08x)
ta: குறியீட்டு நுழைவு ஒரு அடைவு, ஆனால் சிதறல் அல்ல (%08x)

source: cannot use split index with a sparse index
ta: சிதறிய குறியீட்டைக் கொண்டு பிளவு குறியீட்டைப் பயன்படுத்த முடியாது

source: %u.%2.2u GiB
ta: %u.%2.2u கிகாபை

source: %u.%2.2u GiB/s
ta: %u.%2.2u கிகாபை/நொ

source: %u.%2.2u MiB
ta: %u.%2.2u மேபை

source: %u.%2.2u MiB/s
ta: %u.%2.2u மேபை/நொ

source: %u.%2.2u KiB
ta: %u.%2.2u கிபை

source: %u.%2.2u KiB/s
ta: %u.%2.2u கிபை/நொ

source: %u byte
ta: %u பைட்

source: %u byte/s
ta: %u பைட்/நொ

source: ignoring suspicious submodule name: %s
ta: சந்தேகத்திற்கிடமான துணைதொகுதி பெயரைப் புறக்கணித்தல்: %s

source: negative values not allowed for submodule.fetchJobs
ta: எதிர்மறை மதிப்புகள் submodule.fetchJobs க்கு அனுமதிக்கப்படவில்லை

source: ignoring '%s' which may be interpreted as a command-line option: %s
ta: கட்டளை-வரி விருப்பமாக விளக்கப்படக்கூடிய '%s' ஐ புறக்கணித்தல்: %s

source: Could not update .gitmodules entry %s
ta: புதுப்பிக்க முடியவில்லை .gitmodules நுழைவு %s

source: Cannot change unmerged .gitmodules, resolve merge conflicts first
ta: அன்செர்செர்

source: Could not find section in .gitmodules where path=%s
ta: .gitmodules இல் பகுதியைக் கண்டுபிடிக்க முடியவில்லை, அங்கு பாதை =%s

source: Could not remove .gitmodules entry for %s
ta: %s க்கான .gitmodules நுழைவை அகற்ற முடியவில்லை

source: staging updated .gitmodules failed
ta: புதுப்பிக்கப்பட்ட .gitmodules தோல்வியுற்றது

source: in unpopulated submodule '%s'
ta: மக்கள்தொகை இல்லாத துணைதொகுதியில் '%s'

source: Pathspec '%s' is in submodule '%.*s'
ta: பாதைகுறி '%s' துணைதொகுதி '%.*s' இல் உள்ளது

source: bad --ignore-submodules argument: %s
ta: bad --ignore-submodules வாதம்: %s

source: Submodule in commit %s at path: '%s' collides with a submodule named the same. Skipping it.
ta: பாதையில் %s துணைதொகுதி: '%s' அதே பெயரிடப்பட்ட ஒரு துணைதொகுதியுடன் மோதுகின்றன. அதைத் தவிர்க்கிறது.

source: submodule entry '%s' (%s) is a %s, not a commit
ta: துணைதொகுதி நுழைவு '%s' (%s) ஒரு%s, ஒரு உறுதி அல்ல

source: Could not run 'git rev-list <commits> --not --remotes -n 1' command in submodule %s
ta: துணைதொகுதி %s இல் 'git rev-list <உறுதிகள்> --not --remotes -n 1' கட்டளையை இயக்க முடியவில்லை

source: process for submodule '%s' failed
ta: துணைதொகுதி '%s' என்பதற்கான செயல்முறை தோல்வியடைந்தது

source: Pushing submodule '%s'
ta: துணைதொகுதி '%s'

source: Unable to push submodule '%s'
ta: துணைதொகுதியை '%s' தள்ள முடியவில்லை

source: Fetching submodule %s%s
ta: துணைதொகுதி %s %s ஐப் பெறுதல்

source: Could not access submodule '%s'
ta: துணைதொகுதி '%s' ஐ அணுக முடியவில்லை

source: Could not access submodule '%s' at commit %s
ta: துணைதொகுதி %s இல் '%s' ஐ அணுக முடியவில்லை

source: Fetching submodule %s%s at commit %s
ta: துணைதொகுதி %s%s இல் %s ஐப் பெறுதல்

source: Errors during submodule fetch: %s
ta: துணைதொகுதி பெறும் போது பிழைகள்: %s

source: '%s' not recognized as a git repository
ta: '%s' ஒரு அறிவிலி களஞ்சியமாக அங்கீகரிக்கப்படவில்லை

source: Could not run 'git status --porcelain=2' in submodule %s
ta: துணைதொகுதி %s இல் 'git status --porcelain=2' ஐ இயக்க முடியவில்லை

source: 'git status --porcelain=2' failed in submodule %s
ta: 'git status --porcelain=2' துணைதொகுதி %s இல் தோல்வியுற்றது

source: could not start 'git status' in submodule '%s'
ta: துணைதொகுதி '%s' இல் 'அறிவிலி நிலையை' தொடங்க முடியவில்லை

source: could not run 'git status' in submodule '%s'
ta: துணைதொகுதி '%s' இல் 'அறிவிலி நிலையை' இயக்க முடியவில்லை

source: Could not unset core.worktree setting in submodule '%s'
ta: துணைதொகுதி '%s' இல் core.worktree அமைப்பை இணைக்க முடியவில்லை

source: could not recurse into submodule '%s'
ta: துணைதொகுதி '%s' க்குள் திரும்ப முடியவில்லை

source: could not reset submodule index
ta: துணைதொகுதி குறியீட்டை மீட்டமைக்க முடியவில்லை

source: submodule '%s' has dirty index
ta: துணைதொகுதி '%s' அழுக்கு குறியீட்டைக் கொண்டுள்ளது

source: Submodule '%s' could not be updated.
ta: துணைதொகுதி '%s' புதுப்பிக்க முடியவில்லை.

source: submodule git dir '%s' is inside git dir '%.*s'
ta: துணைதொகுதி அறிவிலி டிர் '%s' என்பது அறிவிலி டிர் '%.*s'க்குள் உள்ளது

source: relocate_gitdir for submodule '%s' with more than one worktree not supported
ta: ஒன்றுக்கு மேற்பட்ட பணிமரங்களுடன் துணைதொகுதி '%s' க்கான relocate_gitdir ஆதரிக்கப்படவில்லை

source: could not lookup name for submodule '%s'
ta: துணைதொகுதி '%s' க்கான பெயரைத் தேட முடியவில்லை

source: refusing to move '%s' into an existing git dir
ta: '%s' ஐ ஏற்கனவே இருக்கும் அறிவிலி டிர் நகர்த்த மறுப்பது

source: Migrating git directory of '%s%s' from '%s' to '%s'
ta: '%s%s' இன் git கோப்பகத்தை இடம்பெயர்கிறது '%s' பெறுநர் '%s'

source: could not start ls-files in ..
ta: எல்.எச்-ஃபைல்களைத் தொடங்க முடியவில்லை ..

source: ls-tree returned unexpected return code %d
ta: எல்.எச்-ட்ரீ எதிர்பாராத வருவாய் குறியீடு %d

source: failed to lstat '%s'
ta: '%s' இல் lstat இல் தோல்வியுற்றது

source: no remote configured to get bundle URIs from
ta: மூட்டை யூரி களைப் பெற தொலை கட்டமைக்கப்படவில்லை

source: could not get the bundle-uri list
ta: மூட்டை-யூரி பட்டியலைப் பெற முடியவில்லை

source: test-tool cache-tree <options> (control|prime|update)
ta: டெச்ட்-டூல் கேச்-மரம் <விருப்பங்கள்> (கட்டுப்பாடு | பிரைம் | புதுப்பிப்பு)

source: clear the cache tree before each iteration
ta: ஒவ்வொரு மறு செய்கைக்கு முன் கேச் மரத்தை அழிக்கவும்

source: number of entries in the cache tree to invalidate (default 0)
ta: செல்லாததாக்க கேச் மரத்தில் உள்ளீடுகளின் எண்ணிக்கை (இயல்புநிலை 0)

source: commit %s is not marked reachable
ta: உறுதி %s அடையக்கூடியதாக இல்லை

source: too many commits marked reachable
ta: பல உறுதிடுகள் அடையக்கூடியவை

source: could not determine MIDX preferred pack
ta: மிட்எக்ச் விருப்பமான பேக்கை தீர்மானிக்க முடியவில்லை

source: test-tool serve-v2 [<options>]
ta: டெச்ட்-டூல் சேவை-வி 2 [<விருப்பங்கள்>]

source: exit immediately after advertising capabilities
ta: விளம்பர திறன்களுக்குப் பிறகு உடனடியாக வெளியேறவும்

source: test-helper simple-ipc is-active [<name>] [<options>]
ta: டெச்ட்-உதவியாளர் சிம்பிள்-ஐ.பி.சி ஐ.எச்-ஆக்டிவ் [<amen>] [<விருப்பங்கள்>]

source: test-helper simple-ipc run-daemon [<name>] [<threads>]
ta: டெச்ட்-உதவியாளர் சிம்பிள்-ஐ.பி.சி ரன்-டீமன் [<amane>] [<நூல்கள்>]

source: test-helper simple-ipc start-daemon [<name>] [<threads>] [<max-wait>]
ta: டெச்ட்-உதவியாளர் சிம்பிள்-ஐ.பி.சி ச்டார்ட்-டீமன் [<பெயர்>] [<நூல்கள்>] [<அதிகபட்ச-வாரியாக>]]

source: test-helper simple-ipc stop-daemon [<name>] [<max-wait>]
ta: டெச்ட்-உதவியாளர் சிம்பிள்-ஐ.பி.சி ச்டாப்-டீமன் [<amane>] [<அதிகபட்ச-வாரியாக>]

source: test-helper simple-ipc send [<name>] [<token>]
ta: டெச்ட்-உதவியாளர் சிம்பிள்-ஐ.பி.சி அனுப்பு [<பெயர்>] [<டோக்கன்>]

source: test-helper simple-ipc sendbytes [<name>] [<bytecount>] [<byte>]
ta: டெச்ட்-உதவியாளர் சிம்பிள்-ஐ.பி.சி அனுப்பு பைட்டுகள் [<பெயர்>] [<bytecount>] [<பைட்>]

source: test-helper simple-ipc multiple [<name>] [<threads>] [<bytecount>] [<batchsize>]
ta: டெச்ட்-உதவியாளர் சிம்பிள்-ஐ.பி.சி பல [<பெயர்>] [<adeds>] [<betecount>] [<batchsize>]

source: name or pathname of unix domain socket
ta: யுனிக்ச் டொமைன் சாக்கெட்டின் பெயர் அல்லது பாதை பெயர்

source: named-pipe name
ta: பெயரிடப்பட்ட பைப் பெயர்

source: number of threads in server thread pool
ta: சேவையக நூல் குளத்தில் நூல்களின் எண்ணிக்கை

source: seconds to wait for daemon to start or stop
ta: டீமான் தொடங்க அல்லது நிறுத்த காத்திருக்க வினாடிகள்

source: number of bytes
ta: பைட்டுகளின் எண்ணிக்கை

source: number of requests per thread
ta: ஒரு நூலுக்கு கோரிக்கைகளின் எண்ணிக்கை

source: byte
ta: பைட்

source: ballast character
ta: நிலைப்படுத்தும் தன்மை

source: token
ta: கிள்ளாக்கு

source: command token to send to the server
ta: சேவையகத்திற்கு அனுப்ப கிள்ளாக்கு கட்டளையிடவும்

source: running trailer command '%s' failed
ta: டிரெய்லர் கட்டளை '%s' இயங்குவது தோல்வியடைந்தது

source: unknown value '%s' for key '%s'
ta: முக்கிய '%s' க்கான அறியப்படாத மதிப்பு '%s'

source: empty trailer token in trailer '%.*s'
ta: டிரெய்லரில் வெற்று டிரெய்லர் கிள்ளாக்கு '%.*s'

source: full write to remote helper failed
ta: தொலை உதவியாளருக்கு முழு எழுத்து தோல்வியடைந்தது

source: unable to find remote helper for '%s'
ta: '%s' க்கு தொலை உதவியாளரைக் கண்டுபிடிக்க முடியவில்லை

source: can't dup helper output fd
ta: உதவி வெளியீடு fd ஐ dup முடியாது

source: unknown mandatory capability %s; this remote helper probably needs newer version of Git
ta: அறியப்படாத கட்டாய திறன் %s; இந்த தொலை உதவியாளருக்கு அறிவிலி புதிய பதிப்பு தேவைப்படலாம்

source: this remote helper should implement refspec capability
ta: இந்த தொலை உதவியாளர் refspec திறனை செயல்படுத்த வேண்டும்

source: %s unexpectedly said: '%s'
ta: %s எதிர்பாராத விதமாக கூறினார்: '%s'

source: %s also locked %s
ta: %s %s பூட்டப்பட்டுள்ளன

source: couldn't run fast-import
ta: வேகமாக இறக்குமதி செய்ய முடியவில்லை

source: error while running fast-import
ta: வேகமாக இறக்குமதி செய்யும் போது பிழை

source: could not read ref %s
ta: ref %s ஐப் படிக்க முடியவில்லை

source: unknown response to connect: %s
ta: இணைப்புக்கு தெரியாத பதில்: %s

source: setting remote service path not supported by protocol
ta: நெறிமுறையால் ஆதரிக்கப்படாத தொலைநிலை பணி பாதையை அமைத்தல்

source: invalid remote service path
ta: தவறான தொலைநிலை பணி பாதை

source: can't connect to subservice %s
ta: துணை %s உடன் இணைக்க முடியாது

source: --negotiate-only requires protocol v2
ta: --negotiate-only நெறிமுறை v2 தேவைப்படுகிறது

source: 'option' without a matching 'ok/error' directive
ta: பொருந்தாமல் 'விருப்பம்' 'சரி/பிழை' கட்டளை

source: expected ok/error, helper said '%s'
ta: எதிர்பார்த்த சரி/பிழை, உதவியாளர் '%s' என்றார்

source: helper reported unexpected status of %s
ta: உதவியாளர் %s இன் எதிர்பாராத நிலையை அறிவித்தார்

source: helper %s does not support dry-run
ta: உதவியாளர் %s உலர்-ஓட்டத்தை ஆதரிக்காது

source: helper %s does not support --signed
ta: உதவியாளர் %s ஆதரிக்கவில்லை --signed

source: helper %s does not support --signed=if-asked
ta: உதவியாளர் %s ஆதரிக்கவில்லை --signed=if-asked

source: helper %s does not support --atomic
ta: உதவியாளர் %s --atomic ஐ ஆதரிக்கவில்லை

source: helper %s does not support --%s
ta: உதவியாளர் %s ஆதரிக்கவில்லை - %s

source: helper %s does not support 'push-option'
ta: உதவியாளர் %s 'புச்-விருப்பத்தை' ஆதரிக்காது

source: remote-helper doesn't support push; refspec needed
ta: தொலை-உதவியாளர் உந்துதலை ஆதரிக்கவில்லை; refspec தேவை

source: couldn't run fast-export
ta: வேகமாக ஏற்றுமதி செய்ய முடியவில்லை

source: error while running fast-export
ta: வேகமான ஏற்றுமதி செய்யும் போது பிழை

source: No refs in common and none specified; doing nothing. Perhaps you should specify a branch.
ta: பொதுவானவை இல்லை, எதுவும் குறிப்பிடப்படவில்லை; எதுவும் செய்யவில்லை. ஒருவேளை நீங்கள் ஒரு கிளையைக் குறிப்பிட வேண்டும்.

source: unsupported object format '%s'
ta: ஆதரிக்கப்படாத பொருள் வடிவம் '%s'

source: malformed response in ref list: %s
ta: ref பட்டியலில் தவறான பதில்: %s

source: read(%s) failed
ta: படிக்க (%s) தோல்வியடைந்தது

source: write(%s) failed
ta: எழுது (%s) தோல்வியடைந்தது

source: %s thread failed
ta: %s நூல் தோல்வியடைந்தது

source: %s thread failed to join: %s
ta: %s நூல் சேரத் தவறிவிட்டது: %s

source: can't start thread for copying data: %s
ta: தரவை நகலெடுப்பதற்கான நூலைத் தொடங்க முடியாது: %s

source: %s process failed to wait
ta: %s செயல்முறை காத்திருக்கத் தவறிவிட்டது

source: %s process failed
ta: %s செயல்முறை தோல்வியடைந்தது

source: can't start thread for copying data
ta: தரவை நகலெடுப்பதற்கான நூலைத் தொடங்க முடியாது

source: Would set upstream of '%s' to '%s' of '%s'
ta: '%s' இன் அப்ச்ட்ரீமை '%s' முதல் '%s' வரை அமைக்கும்

source: could not read bundle '%s'
ta: '%s' என்ற மூட்டை படிக்க முடியவில்லை

source: transport: invalid depth option '%s'
ta: போக்குவரத்து: தவறான ஆழம் விருப்பம் '%s'

source: see protocol.version in 'git help config' for more details
ta: மேலும் விவரங்களுக்கு 'git help config' இல் protocol.version ஐப் பார்

source: server options require protocol version 2 or later
ta: சேவையக விருப்பங்களுக்கு நெறிமுறை பதிப்பு 2 அல்லது அதற்குப் பிறகு தேவைப்படுகிறது

source: server does not support wait-for-done
ta: சேவையகம் செய்ய காத்திருப்பதை ஆதரிக்காது

source: could not parse transport.color.* config
ta: அலச முடியவில்லை transport.color.* கட்டமைப்பு
