Repository: Nizhal/git-ta-po
Catalog: po/*.po
Languages: ta

source: references to exclude
ta: விலக்குவதற்கான குறிப்புகள்

source: git patch-id [--stable | --unstable | --verbatim]
ta: git patch-id [--stable | --nstable | --verbatim]

source: use the unstable patch-id algorithm
ta: நிலையற்ற பேட்ச்-அடையாளம் வழிமுறையைப் பயன்படுத்தவும்

source: use the stable patch-id algorithm
ta: நிலையான பேட்ச்-அடையாளம் வழிமுறையைப் பயன்படுத்தவும்

source: don't strip whitespace from the patch
ta: பேட்சிலிருந்து இடைவெளியை அகற்ற வேண்டாம்

source: git prune [-n] [-v] [--progress] [--expire <time>] [--] [<head>...]
ta: git prune [-n] [-v] [--progress] [--expire <நேரம்>] [-] [<தலை>...]

source: report pruned objects
ta: கத்தரிக்காய் பொருள்களைப் புகாரளிக்கவும்

source: expire objects older than <time>
ta: <நேரம்> ஐ விட பழைய பொருட்களை காலாவதியாகுங்கள்

source: limit traversal to objects outside promisor packfiles
ta: உறுதிமொழி பேக்ஃபைல்களுக்கு வெளியே உள்ள பொருட்களுக்கு பயணத்தை கட்டுப்படுத்துங்கள்

source: cannot prune in a precious-objects repo
ta: ஒரு விலைமதிப்பற்ற-பொருள்களை ரெப்போவில் கத்தரிக்க முடியாது

source: git pull [<options>] [<repository> [<refspec>...]]
ta: git pull [<விருப்பங்கள்>] [<களஞ்சிய> [<குறி>...]]

source: control for recursive fetching of submodules
ta: துணைதொகுதிகளின் சுழல்நிலை பெறுதலுக்கான கட்டுப்பாடு

source: Options related to merging
ta: ஒன்றிணைத்தல் தொடர்பான விருப்பங்கள்

source: incorporate changes by rebasing rather than merging
ta: ஒன்றிணைவதை விட மறுகட்டமைப்பதன் மூலம் மாற்றங்களை இணைக்கவும்

source: allow fast-forward
ta: வேகமாக முன்னோக்கி அனுமதிக்கவும்

source: control use of pre-merge-commit and commit-msg hooks
ta: முன்-மெர்ச்- உறுதி மற்றும் உறுதி-எம்எச்சி கொக்கிகள் ஆகியவற்றின் பயன்பாடு

source: automatically stash/stash pop before and after
ta: முன்னும் பின்னும் தானாகவே ச்டாச்/ச்டாச் பாப்

source: Options related to fetching
ta: பெறுவது தொடர்பான விருப்பங்கள்

source: force overwrite of local branch
ta: உள்ளக கிளையின் ஓவர்ரைட் ஃபோர்ச்

source: number of submodules pulled in parallel
ta: இணையாக இழுக்கப்பட்ட துணைதொகுதிகளின் எண்ணிக்கை

source: use IPv4 addresses only
ta: ipv4 முகவரிகளை மட்டுமே பயன்படுத்தவும்

source: use IPv6 addresses only
ta: ipv6 முகவரிகளை மட்டுமே பயன்படுத்தவும்

source: There is no candidate for rebasing against among the refs that you just fetched.
ta: நீங்கள் இப்போது பெற்ற குறிப்புகளுக்கு எதிராக மறுவாழ்வு செய்வதற்கான வேட்பாளர் இல்லை.

source: There are no candidates for merging among the refs that you just fetched.
ta: நீங்கள் இப்போது பெற்ற குறிப்புகள் மத்தியில் ஒன்றிணைவதற்கான வேட்பாளர்கள் யாரும் இல்லை.

source: Generally this means that you provided a wildcard refspec which had no matches on the remote end.
ta: பொதுவாக இதன் பொருள் நீங்கள் ஒரு வைல்டு அட்டை ரெஃப்ச்பெக்கை வழங்கவில்லை, அதில் இல்லை தொலைநிலை முடிவில் பொருந்துகிறது.

source: You asked to pull from the remote '%s', but did not specify a branch. Because this is not the default configured remote for your current branch, you must specify a branch on the command line.
ta: தொலை '%s' இலிருந்து இழுக்கும்படி கேட்டீர்கள், ஆனால் குறிப்பிடவில்லை ஒரு கிளை. ஏனெனில் இது இயல்புநிலை கட்டமைக்கப்பட்ட தொலைநிலை அல்ல உங்கள் தற்போதைய கிளைக்கு, கட்டளை வரியில் ஒரு கிளையை நீங்கள் குறிப்பிட வேண்டும்.

source: You are not currently on a branch.
ta: நீங்கள் தற்போது ஒரு கிளையில் இல்லை.

source: Please specify which branch you want to rebase against.
ta: நீங்கள் எந்த கிளைக்கு எதிராக திரும்பப் பெற விரும்புகிறீர்கள் என்பதைக் குறிப்பிடவும்.

source: Please specify which branch you want to merge with.
ta: நீங்கள் எந்த கிளையுடன் இணைக்க விரும்புகிறீர்கள் என்பதைக் குறிப்பிடவும்.

source: See git-pull(1) for details.
ta: விவரங்களுக்கு git-pull(1) ஐப் பார்.

source: <remote>
ta: <தொலை>

source: <branch>
ta: <கிளை>

source: There is no tracking information for the current branch.
ta: தற்போதைய கிளைக்கு கண்காணிப்பு தகவல்கள் எதுவும் இல்லை.

source: If you wish to set tracking information for this branch you can do so with:
ta: இந்த கிளைக்கு கண்காணிப்பு தகவல்களை அமைக்க விரும்பினால், நீங்கள் அவ்வாறு செய்யலாம்:

source: Your configuration specifies to merge with the ref '%s' from the remote, but no such ref was fetched.
ta: உங்கள் உள்ளமைவு '%s' உடன் ஒன்றிணைக்க குறிப்பிடுகிறது தொலைதூரத்திலிருந்து, ஆனால் அத்தகைய ரெஃப் எதுவும் பெறப்படவில்லை.

source: unable to access commit %s
ta: %s ஐ அணுக முடியவில்லை

source: invalid refspec '%s'
ta: தவறான refspec '%s'

source: ignoring --verify-signatures for rebase
ta: மறுதளத்திற்கான --verify-signatures புறக்கணித்தல்

source: You have divergent branches and need to specify how to reconcile them. You can do so by running one of the following commands sometime before your next pull: git config pull.rebase false # merge git config pull.rebase true # rebase git config pull.ff only # fast-forward only You can replace "git config" with "git config --global" to set a default preference for all repositories. You can also pass --rebase, --no-rebase, or --ff-only on the command line to override the configured default per invocation.
ta: உங்களிடம் மாறுபட்ட கிளைகள் உள்ளன, அவற்றை எவ்வாறு சரிசெய்வது என்பதைக் குறிப்பிட வேண்டும். பின்வரும் கட்டளைகளில் ஒன்றை இயக்குவதன் மூலம் நீங்கள் அவ்வாறு செய்யலாம் உங்கள் அடுத்த இழுப்பு: git config pull.rebase false # ஒன்றிணைப்பு git config pull.rebase true # மறுதளம் git config pull.ff only # வேகமாக முன்னோக்கி மட்டும் இயல்புநிலையை அமைக்க "git config" ஐ "git config --global" உடன் மாற்றலாம் அனைத்து களஞ்சியங்களுக்கும் விருப்பம். நீங்கள் --rebase, --no-rebase, அல்லது --ff-only கட்டளை வரியில் மட்டுமே கட்டமைக்கப்பட்ட இயல்புநிலையை மீறுகிறது அழைப்பிதழ்.

source: Updating an unborn branch with changes added to the index.
ta: குறியீட்டில் சேர்க்கப்பட்ட மாற்றங்களுடன் பிறக்காத கிளையை புதுப்பித்தல்.

source: pull with rebase
ta: மறுபயன்பாட்டுடன் இழுக்கவும்

source: Please commit or stash them.
ta: தயவுசெய்து அவர்களை ஈடுபடுத்துங்கள் அல்லது சேமிக்கவும்.

source: fetch updated the current branch head. fast-forwarding your working tree from commit %s.
ta: தற்போதைய கிளை தலையை புதுப்பிக்கப்பட்டது. உங்கள் உழைக்கும் மரத்தை வேகமாக செலுத்துதல் %s.

source: Cannot fast-forward your working tree. After making sure that you saved anything precious from $ git diff %s output, run $ git reset --hard to recover.
ta: உங்கள் உழைக்கும் மரத்தை வேகமாக முன்னோக்கி கொண்டு செல்ல முடியாது. விலைமதிப்பற்ற எதையும் நீங்கள் சேமித்தீர்கள் என்பதை உறுதிசெய்த பிறகு $ git diff %s வெளியீடு, இயக்கம் $ git reset --hard மீட்க.

source: Cannot merge multiple branches into empty head.
ta: பல கிளைகளை வெற்று தலையில் ஒன்றிணைக்க முடியாது.

source: Cannot rebase onto multiple branches.
ta: பல கிளைகளில் திரும்பப் பெற முடியாது.

source: Cannot fast-forward to multiple branches.
ta: பல கிளைகளுக்கு வேகமாக முன்னோக்கி செல்ல முடியாது.

source: Need to specify how to reconcile divergent branches.
ta: வேறுபட்ட கிளைகளை எவ்வாறு சரிசெய்வது என்பதைக் குறிப்பிட வேண்டும்.

source: cannot rebase with locally recorded submodule modifications
ta: உள்நாட்டில் பதிவுசெய்யப்பட்ட துணைதொகுதி மாற்றங்களுடன் திரும்பப் பெற முடியாது

source: git push [<options>] [<repository> [<refspec>...]]
ta: git புச் [<விருப்பங்கள்>] [<களஞ்சிய> [<effspec> ...]]

source: tag shorthand without <tag>
ta: <dag> இல்லாமல் சுருக்கெழுத்து குறிச்சொல்

source: --delete only accepts plain target ref names
ta: --delete வெற்று இலக்கு ref பெயர்களை மட்டுமே ஏற்றுக்கொள்கிறது

source: To choose either option permanently, see push.default in 'git help config'.
ta: எந்தவொரு விருப்பத்தையும் நிரந்தரமாக தேர்வு செய்ய, 'git help config' இல் push.default ஐப் பார்.

source: To avoid automatically configuring an upstream branch when its name won't match the local branch, see option 'simple' of branch.autoSetupMerge in 'git help config'.
ta: ஒரு மேலோடை கிளையை அதன் பெயராக இருக்கும்போது தானாகவே கட்டமைப்பதைத் தவிர்க்க உள்ளக கிளையுடன் பொருந்தாது, கிளையின் branch.autoSetupMerge 'எளிய' விருப்பத்தைப் பார் 'git help config' இல்.

source: The upstream branch of your current branch does not match the name of your current branch. To push to the upstream branch on the remote, use git push %s HEAD:%s To push to the branch of the same name on the remote, use git push %s HEAD %s%s
ta: உங்கள் தற்போதைய கிளையின் மேலோடை கிளை பொருந்தவில்லை உங்கள் தற்போதைய கிளையின் பெயர். மேலோடை கிளைக்கு தள்ள தொலைதூரத்தில், பயன்படுத்தவும் git புச் %s தலை: %s தொலைதூரத்தில் அதே பெயரின் கிளைக்கு தள்ள, பயன்படுத்தவும் அறிவிலி புச் %s தலை %s%s

source: You are not currently on a branch. To push the history leading to the current (detached HEAD) state now, use git push %s HEAD:<name-of-remote-branch>
ta: நீங்கள் தற்போது ஒரு கிளையில் இல்லை. மின்னோட்டத்திற்கு வழிவகுக்கும் வரலாற்றை (பிரிக்கப்பட்ட தலை) இப்போது, பயன்படுத்தவும் git புச் %s தலை: <பெயர்-remote-franch>

source: To have this happen automatically for branches without a tracking upstream, see 'push.autoSetupRemote' in 'git help config'.
ta: கண்காணிப்பு இல்லாமல் கிளைகளுக்கு இது தானாகவே நிகழ்கிறது மேலோடை, 'git help config' இல் 'push.autoSetupRemote' ஐப் பார்.

source: The current branch %s has no upstream branch. To push the current branch and set the remote as upstream, use git push --set-upstream %s %s %s
ta: தற்போதைய கிளை %s மேலோடை கிளை இல்லை. தற்போதைய கிளையைத் தள்ளி, தொலைடை அப்ச்ட்ரீமாக அமைக்க, பயன்படுத்தவும் git push --set-upstream %s %s %s

source: The current branch %s has multiple upstream branches, refusing to push.
ta: தற்போதைய கிளை %s பல மேலோடை கிளைகளைக் கொண்டுள்ளது, இது தள்ள மறுக்கிறது.

source: You didn't specify any refspecs to push, and push.default is "nothing".
ta: தள்ளுவதற்கு நீங்கள் எந்த ரெஃப்ச்பெக்குகளையும் குறிப்பிடவில்லை, மேலும் push.default "ஒன்றுமில்லை".

source: You are pushing to remote '%s', which is not the upstream of your current branch '%s', without telling me what to push to update which remote branch.
ta: நீங்கள் தொலை '%s' க்கு அழுத்தம் கொடுக்கிறீர்கள், இது மேலோடை அல்ல உங்கள் தற்போதைய கிளை '%s', என்ன தள்ள வேண்டும் என்று சொல்லாமல் எந்த தொலை கிளையை புதுப்பிக்க.

source: Updates were rejected because the tip of your current branch is behind its remote counterpart. If you want to integrate the remote changes, use 'git pull' before pushing again. See the 'Note about fast-forwards' in 'git push --help' for details.
ta: புதுப்பிப்புகள் நிராகரிக்கப்பட்டன, ஏனெனில் உங்கள் தற்போதைய கிளையின் முனை பின்னால் உள்ளது அதன் தொலைநிலை எதிர். தொலை மாற்றங்களை ஒருங்கிணைக்க விரும்பினால், மீண்டும் தள்ளும் முன் 'அறிவிலி புல்' ஐப் பயன்படுத்தவும். விவரங்களுக்கு 'git push --help' இல் 'ஃபாச்ட்-ஃபார்வர்டுகள் பற்றிய குறிப்பு' ஐப் பார்.

source: Updates were rejected because a pushed branch tip is behind its remote counterpart. If you want to integrate the remote changes, use 'git pull' before pushing again. See the 'Note about fast-forwards' in 'git push --help' for details.
ta: புதுப்பிப்புகள் நிராகரிக்கப்பட்டன, ஏனெனில் தள்ளப்பட்ட கிளை முனை அதன் தொலைதூரத்தின் பின்னால் உள்ளது எதிர். தொலை மாற்றங்களை ஒருங்கிணைக்க விரும்பினால், 'git pull' ஐப் பயன்படுத்தவும் மீண்டும் தள்ளும் முன். விவரங்களுக்கு 'git push --help' இல் 'ஃபாச்ட்-ஃபார்வர்டுகள் பற்றிய குறிப்பு' ஐப் பார்.

source: Updates were rejected because the remote contains work that you do not have locally. This is usually caused by another repository pushing to the same ref. If you want to integrate the remote changes, use 'git pull' before pushing again. See the 'Note about fast-forwards' in 'git push --help' for details.
ta: புதுப்பிப்புகள் நிராகரிக்கப்பட்டன, ஏனெனில் தொலைடில் நீங்கள் இல்லாத பணி உள்ளது உள்ளூரில் உள்ளது. இது வழக்கமாக மற்றொரு களஞ்சியத்தால் ஏற்படுகிறது அதே குறிப்பு. தொலை மாற்றங்களை ஒருங்கிணைக்க விரும்பினால், பயன்படுத்தவும் மீண்டும் தள்ளும் முன் 'அறிவிலி புல்'. விவரங்களுக்கு 'git push --help' இல் 'ஃபாச்ட்-ஃபார்வர்டுகள் பற்றிய குறிப்பு' ஐப் பார்.

source: Updates were rejected because the tag already exists in the remote.
ta: புதுப்பிப்புகள் நிராகரிக்கப்பட்டன, ஏனெனில் குறிச்சொல் ஏற்கனவே தொலைதூரத்தில் உள்ளது.

source: You cannot update a remote ref that points at a non-commit object, or update a remote ref to make it point at a non-commit object, without using the '--force' option.
ta: கம்யூட் அல்லாத பொருளில் சுட்டிக்காட்டும் தொலை ref ஐ நீங்கள் புதுப்பிக்க முடியாது, . '--force' விருப்பத்தைப் பயன்படுத்தாமல்.

source: Updates were rejected because the tip of the remote-tracking branch has been updated since the last checkout. If you want to integrate the remote changes, use 'git pull' before pushing again. See the 'Note about fast-forwards' in 'git push --help' for details.
ta: தொலை கண்காணிப்பு கிளையின் நுனி இருப்பதால் புதுப்பிப்புகள் நிராகரிக்கப்பட்டன கடைசி புதுப்பித்தலில் இருந்து புதுப்பிக்கப்பட்டது. நீங்கள் ஒருங்கிணைக்க விரும்பினால் தொலை மாற்றங்கள், மீண்டும் தள்ளும் முன் 'அறிவிலி புல்' ஐப் பயன்படுத்தவும். விவரங்களுக்கு 'git push --help' இல் 'ஃபாச்ட்-ஃபார்வர்டுகள் பற்றிய குறிப்பு' ஐப் பார்.

source: Pushing to %s
ta: %s க்கு தள்ளுதல்

source: failed to push some refs to '%s'
ta: சில குறிப்புகளை '%s' என்று தள்ளுவதில் தோல்வி

source: recursing into submodule with push.recurseSubmodules=only; using on-demand instead
ta: push.recurseSubmodules=only உடன் மறுஉள்ளே துணைதொகுதி; அதற்கு பதிலாக on-demand பயன்படுத்துதல்

source: invalid value for '%s'
ta: '%s' க்கு தவறான மதிப்பு

source: repository
ta: களஞ்சியம்

source: push all branches
ta: அனைத்து கிளைகளையும் தள்ளுங்கள்

source: mirror all refs
ta: அனைத்து குறிப்புகளையும் மிரர்

source: delete refs
ta: refs ஐ நீக்கு

source: push tags (can't be used with --all or --branches or --mirror)
ta: குறிச்சொற்களை தள்ளு (--all அல்லது --branches அல்லது --mirror உடன் பயன்படுத்த முடியாது)

source: force updates
ta: புதுப்பிப்புகளை கட்டாயப்படுத்துங்கள்

source: <refname>:<expect>
ta: <effname>:<எதிர்பார்ப்பு>

source: require old value of ref to be at this value
ta: இந்த மதிப்பில் இருக்க ref இன் பழைய மதிப்பு தேவை

source: require remote updates to be integrated locally
ta: உள்நாட்டில் ஒருங்கிணைக்க தொலைநிலை புதுப்பிப்புகள் தேவை

source: control recursive pushing of submodules
ta: துணைதொகுதிகளின் சுழல்நிலை உந்துதலைக் கட்டுப்படுத்துங்கள்

source: use thin pack
ta: மெல்லிய கட்டு பயன்படுத்தவும்

source: receive pack program
ta: கட்டு நிரலைப் பெறுங்கள்

source: set upstream for git pull/status
ta: அறிவிலி புல்/நிலைக்கு அப்ச்ட்ரீமை அமைக்கவும்

source: prune locally removed refs
ta: உள்நாட்டில் அகற்றப்பட்ட குறிப்புகளை கத்தரிக்கவும்

source: bypass pre-push hook
ta: பைபாச் முன்-புச் கொக்கி

source: push missing but relevant tags
ta: காணாமல் போன ஆனால் தொடர்புடைய குறிச்சொற்களை தள்ளுங்கள்

source: GPG sign the push
ta: சிபிசி உந்துதலில் கையொப்பமிடுங்கள்

source: request atomic transaction on remote side
ta: தொலை பக்கத்தில் அணு பரிவர்த்தனையை கோருங்கள்

source: --delete doesn't make sense without any refs
ta: --delete எந்த குறிப்புகளும் இல்லாமல் பொருளல்ல

source: bad repository '%s'
ta: மோசமான களஞ்சியம் '%s'

source: No configured push destination. Either specify the URL from the command-line or configure a remote repository using git remote add <name> <url> and then push using the remote name git push <name>
ta: கட்டமைக்கப்பட்ட புச் இலக்கு இல்லை. கட்டளை-வரியிலிருந்து முகவரி ஐக் குறிப்பிடவும் அல்லது தொலைநிலை களஞ்சியத்தை உள்ளமைக்கவும் git தொலை சேர் <பெயர்> <url> பின்னர் தொலை பெயரைப் பயன்படுத்தி தள்ளுங்கள் அறிவிலி புச் <பெயர்>

source: --all can't be combined with refspecs
ta: --all refspec களுடன் இணைக்க முடியாது

source: --mirror can't be combined with refspecs
ta: --mirror ஐ refspecs உடன் இணைக்க முடியாது

source: push options must not have new line characters
ta: புச் விருப்பங்களில் புதிய வரி எழுத்துக்கள் இருக்கக்கூடாது

source: git range-diff [<options>] <old-base>..<old-tip> <new-base>..<new-tip>
ta: git range-diff [<விருப்பங்கள்>] <பழைய-அடிப்படை> .. <பழைய-முனை> <புதிய-அடிப்படை> .. <புதிய-முனை>

source: git range-diff [<options>] <old-tip>...<new-tip>
ta: git range-diff [<விருப்பங்கள்>] <பழைய-முனை> ... <புதிய-முனை>

source: git range-diff [<options>] <base> <old-tip> <new-tip>
ta: git range-diff [<விருப்பங்கள்>] <base> <பழைய-முனை> <புதிய-முனை>

source: use simple diff colors
ta: எளிய வேறுபாடு வண்ணங்களைப் பயன்படுத்துங்கள்

source: notes
ta: குறிப்புகள்

source: passed to 'git log'
ta: 'அறிவிலி லாக்' க்கு அனுப்பப்பட்டது

source: only emit output related to the first range
ta: முதல் வரம்பு தொடர்பான வெளியீட்டை மட்டுமே வெளியிடுகிறது

source: only emit output related to the second range
ta: இரண்டாவது வரம்பு தொடர்பான வெளியீட்டை மட்டுமே வெளியிடுகிறது

source: not a revision: '%s'
ta: ஒரு திருத்தம் அல்ல: '%s'

source: not a commit range: '%s'
ta: ஒரு உறுதி வரம்பு அல்ல: '%s'

source: not a symmetric range: '%s'
ta: ஒரு சமச்சீர் வரம்பு அல்ல: '%s'

source: need two commit ranges
ta: இரண்டு உறுதி வரம்புகள் தேவை

source: git read-tree [(-m [--trivial] [--aggressive] | --reset | --prefix=<prefix>) [-u | -i]] [--index-output=<file>] [--no-sparse-checkout] (--empty | <tree-ish1> [<tree-ish2> [<tree-ish3>]])
ta: git read-tree [(-m [--trivial] [--aggressive] | --reset | --prefix=<முன்னொட்டு>) [-u | -i]] [--index-output=<கோப்பு>] [--no-sparse-checkout] (--empty | <மரமாக1> [<மரமாக2> [<மரமாக3>]])

source: write resulting index to <file>
ta: இதன் விளைவாக குறியீட்டை <file> க்கு எழுதுங்கள்

source: only empty the index
ta: குறியீட்டை மட்டுமே வெறுமை செய்யுங்கள்

source: Merging
ta: ஒன்றிணைத்தல்

source: perform a merge in addition to a read
ta: ஒரு வாசிப்புக்கு கூடுதலாக ஒன்றிணைக்கவும்

source: 3-way merge if no file level merging required
ta: கோப்பு நிலை ஒன்றிணைப்பு தேவையில்லை என்றால் 3-வழி ஒன்றிணைக்கவும்

source: 3-way merge in presence of adds and removes
ta: சேர்க்கை மற்றும் நீக்குதல் முன்னிலையில் 3-வழி ஒன்றிணைக்கவும்

source: same as -m, but discard unmerged entries
ta: -m ஐப் போலவே, ஆனால் ஒருங்கிணைக்கப்படாத உள்ளீடுகளை நிராகரிக்கவும்

source: <subdirectory>/
ta: <துணை அடைவு>/

source: read the tree into the index under <subdirectory>/
ta: <துணை அடைவு>/ இன் கீழ் மரத்தை குறியீட்டில் படியுங்கள்

source: update working tree with merge result
ta: ஒன்றிணைக்கும் முடிவுடன் பணி மரத்தைப் புதுப்பிக்கவும்

source: gitignore
ta: கிடிக்னோர்

source: allow explicitly ignored files to be overwritten
ta: வெளிப்படையாக புறக்கணிக்கப்பட்ட கோப்புகளை மேலெழுத அனுமதிக்கவும்

source: don't check the working tree after merging
ta: இணைந்த பிறகு பணி மரத்தை சரிபார்க்க வேண்டாம்

source: don't update the index or the work tree
ta: குறியீட்டு அல்லது பணி மரத்தை புதுப்பிக்க வேண்டாம்

source: skip applying sparse checkout filter
ta: சிதறிய புதுப்பித்து வடிப்பானைப் பயன்படுத்துவதைத் தவிர்க்கவும்

source: debug unpack-trees
ta: பிழைத்திருத்த-மரங்களை பிழைத்திருத்தல்

source: suppress feedback messages
ta: பின்னூட்ட செய்திகளை அடக்கவும்

source: You need to resolve your current index first
ta: உங்கள் தற்போதைய குறியீட்டை முதலில் தீர்க்க வேண்டும்

source: git rebase [-i] [options] [--exec <cmd>] [--onto <newbase> | --keep-base] [<upstream> [<branch>]]
ta: git மறுசீரமைப்பு [-i] [விருப்பங்கள்] [--exec <cmd>] [--onto <புதிய பேச்> | -கீப்-பேச்] [<அப்ச்ட்ரீம்> [<கிளை>]]

source: git rebase [-i] [options] [--exec <cmd>] [--onto <newbase>] --root [<branch>]
ta: git மறுசீரமைப்பு [-i] [விருப்பங்கள்] [--exec <cmd>] [--onto <wechbase>] --root [<sblanch>]

source: could not read '%s'.
ta: '%s' படிக்க முடியவில்லை.

source: could not create temporary %s
ta: தற்காலிக %s ஐ உருவாக்க முடியவில்லை

source: could not mark as interactive
ta: ஊடாடும் என்று குறிக்க முடியவில்லை

source: could not generate todo list
ta: செய்யவேண்டிய பட்டியலை உருவாக்க முடியவில்லை

source: a base commit must be provided with --upstream or --onto
ta: ஒரு அடிப்படை உறுதிப்பாட்டை --upstream அல்லது --onto உடன் வழங்க வேண்டும்

source: %s requires the merge backend
ta: %s ஒன்றிணைக்கும் பின்தளத்தில் தேவை

source: invalid onto: '%s'
ta: செல்லாது: '%s'

source: invalid orig-head: '%s'
ta: தவறான தோற்றம்: '%s'

source: ignoring invalid allow_rerere_autoupdate: '%s'
ta: தவறான allow_rerere_autoupdate ஐ புறக்கணித்தல்: '%s'

source: could not remove '%s'
ta: '%s' ஐ அகற்ற முடியவில்லை

source: git encountered an error while preparing the patches to replay these revisions: %s As a result, git cannot rebase them.
ta: மறுசீரமைக்க திட்டுகளைத் தயாரிக்கும் போது அறிவிலி ஒரு பிழையை எதிர்கொண்டது இந்த திருத்தங்கள்: %s இதன் விளைவாக, அறிவிலி அவற்றை மீண்டும் செய்ய முடியாது.

source: Unknown rebase-merges mode: %s
ta: அறியப்படாத மறுதொடக்கம்-இணைப்பு பயன்முறை: %s

source: could not switch to %s
ta: %s க்கு மாற முடியவில்லை

source: apply options and merge options cannot be used together
ta: விருப்பங்களைப் பயன்படுத்துங்கள் மற்றும் ஒன்றிணைக்கும் விருப்பங்களை ஒன்றாகப் பயன்படுத்த முடியாது

source: --rebase-merges with an empty string argument is deprecated and will stop working in a future version of Git. Use --rebase-merges without an argument instead, which does the same thing.
ta: வெற்று சரம் வாதத்துடன் --rebase-merges நீக்கப்பட்டது மற்றும் அறிவிலி எதிர்கால பதிப்பில் பணி செய்வதை நிறுத்தும். அதற்கு பதிலாக ஒரு உரையாடல் இல்லாமல் --rebase-merges ஐப் பயன்படுத்துங்கள், இது அதையே செய்கிறது.

source: %s Please specify which branch you want to rebase against. See git-rebase(1) for details. git rebase '<branch>'
ta: %s நீங்கள் எந்த கிளைக்கு எதிராக திரும்பப் பெற விரும்புகிறீர்கள் என்பதைக் குறிப்பிடவும். விவரங்களுக்கு git-rebase(1) ஐப் பார். git rebase '<கிளை>'

source: If you wish to set tracking information for this branch you can do so with: git branch --set-upstream-to=%s/<branch> %s
ta: இந்த கிளைக்கு கண்காணிப்பு தகவல்களை அமைக்க விரும்பினால், நீங்கள் அவ்வாறு செய்யலாம்: git branch --set-upstream-to=%s/<கிளை> %s

source: exec commands cannot contain newlines
ta: இயக்கு கட்டளைகளில் புதிய வரிகள் இருக்க முடியாது

source: empty exec command
ta: வெற்று நிர்வாக கட்டளை

source: rebase onto given branch instead of upstream
ta: மேலோடைக்கு பதிலாக கொடுக்கப்பட்ட கிளையில் மீளவும்

source: use the merge-base of upstream and branch as the current base
ta: தற்போதைய தளமாக மேலோடை மற்றும் கிளையின் ஒன்றிணைப்பு-தளத்தைப் பயன்படுத்தவும்

source: allow pre-rebase hook to run
ta: முன் மறுதொடக்கம் ஊக்கை இயக்க அனுமதிக்கவும்

source: be quiet. implies --no-stat
ta: அமைதியாக இரு. --no-stat ஐ குறிக்கிறது

source: display a diffstat of what changed upstream
ta: அப்ச்ட்ரீமில் மாற்றப்பட்டவற்றின் டிஃப்ச்டாட்டைக் காண்பி

source: do not show diffstat of what changed upstream
ta: அப்ச்ட்ரீமில் மாற்றப்பட்டவற்றின் டிஃப்ச்டாட்டைக் காட்ட வேண்டாம்

source: add a Signed-off-by trailer to each commit
ta: ஒவ்வொரு உறுதிப்பாட்டிலும் கையொப்பமிடப்பட்ட டிரெய்லரைச் சேர்க்கவும்

source: make committer date match author date
ta: கமிசர் தேதியை ஆசிரியர் தேதியை உருவாக்குங்கள்

source: ignore author date and use current date
ta: எழுத்தாளர் தேதியை புறக்கணித்து தற்போதைய தேதியைப் பயன்படுத்தவும்

source: synonym of --reset-author-date
ta: --reset-author-date இதற்கான ஒத்த சொற்கள்

source: passed to 'git apply'
ta: 'அறிவிலி விண்ணப்பிக்கவும்'

source: ignore changes in whitespace
ta: இடைவெளியில் மாற்றங்களை புறக்கணி

source: cherry-pick all commits, even if unchanged
ta: மாறாமல் இருந்தாலும் செர்ரி-பிக் அனைத்து உறுதிடுகளும்

source: continue
ta: தொடரவும்

source: skip current patch and continue
ta: தற்போதைய பேட்சைத் தவிர்த்து தொடரவும்

source: abort and check out the original branch
ta: அசல் கிளையை நிறுத்தி பாருங்கள்

source: abort but keep HEAD where it is
ta: கருக்கலைப்பு, ஆனால் அது இருக்கும் இடத்தில் தலையை வைத்திருங்கள்

source: edit the todo list during an interactive rebase
ta: ஊடாடும் மறுசீரமைப்பின் போது செய்யவேண்டிய பட்டியலைத் திருத்தவும்

source: show the patch file being applied or merged
ta: ஒட்டு கோப்பு பயன்படுத்தப்படுவதோ அல்லது ஒன்றிணைக்கப்படுவதையோ காட்டு

source: use apply strategies to rebase
ta: திரும்பப் பெற பயன்பாட்டு உத்திகளைப் பயன்படுத்தவும்

source: use merging strategies to rebase
ta: திரும்பப் பெற ஒன்றிணைக்கும் உத்திகளைப் பயன்படுத்தவும்

source: let the user edit the list of commits to rebase
ta: மறுபயன்பாட்டுக்கான உறுதிடுகளின் பட்டியலை பயனர் திருத்தட்டும்

source: (REMOVED) was: try to recreate merges instead of ignoring them
ta: (அகற்றப்பட்டது): அவற்றைப் புறக்கணிப்பதற்குப் பதிலாக ஒன்றிணைவுகளை மீண்டும் உருவாக்க முயற்சிக்கவும்

source: how to handle commits that become empty
ta: காலியாக மாறும் உறுதிடுகளை எவ்வாறு கையாள்வது

source: keep commits which start empty
ta: காலியாகத் தொடங்கும் உறுதிடுகளை வைத்திருங்கள்
