Repository: Nizhal/git-ta-po
Catalog: po/*.po
Languages: ta

source: A tutorial introduction to Git
ta: அறிவிலி ஒரு பயிற்சி அறிமுகம்

source: A tutorial introduction to Git: part two
ta: git க்கு ஒரு பயிற்சி அறிமுகம்: பகுதி இரண்டு

source: Git web interface (web frontend to Git repositories)
ta: git வலை இடைமுகம் (git களஞ்சியங்களுக்கான வலை முன்புறம்)

source: An overview of recommended workflows with Git
ta: அறிவிலி உடன் பரிந்துரைக்கப்பட்ட பணிப்பாய்வுகளின் கண்ணோட்டம்

source: A tool for managing large Git repositories
ta: பெரிய அறிவிலி களஞ்சியங்களை நிர்வகிப்பதற்கான ஒரு கருவி

source: commit-graph file is too small
ta: உறுதி-வரைபடம் கோப்பு மிகவும் சிறியது

source: commit-graph oid fanout chunk is wrong size
ta: உறுதி-வரைபடம் ஓயிட் ஃபேன்அவுட் துண்டானது தவறான அளவு

source: commit-graph fanout values out of order
ta: உறுதி-வரைபடம் ஃபேன்அவுட் மதிப்புகள் வரிசையில் இல்லை

source: commit-graph OID lookup chunk is the wrong size
ta: உறுதி-வரைபடம் oid தேடல் துண்டானது தவறான அளவு

source: commit-graph commit data chunk is wrong size
ta: உறுதி-வரைபடம் உறுதி டேட்டா துண்டின் தவறான அளவு

source: commit-graph generations chunk is wrong size
ta: உறுதி-வரைபடம் தலைமுறையினர் துண்டின் தவறான அளவு

source: commit-graph changed-path index chunk is too small
ta: உறுதி-வரைபடம் மாற்றப்பட்ட-பாதை குறியீட்டு துண்டு மிகவும் சிறியது

source: ignoring too-small changed-path chunk (%<PRIuMAX> < %<PRIuMAX>) in commit-graph file
ta: உறுதி-வரைபடம் கோப்பில் மிகவும் சிறிய மாற்றப்பட்ட-பாதை துண்டை ( %<PRIuMAX> < %<PRIuMAX>) புறக்கணித்தல்

source: commit-graph signature %X does not match signature %X
ta: உறுதி-வரைபடம் கையொப்பம் %x கையொப்பத்துடன் பொருந்தவில்லை %x

source: commit-graph version %X does not match version %X
ta: உறுதி-வரைபடம் பதிப்பு %x பதிப்பு %x உடன் பொருந்தவில்லை

source: commit-graph hash version %X does not match version %X
ta: உறுதி-டிராஃப் ஆச் பதிப்பு %x பதிப்பு %x உடன் பொருந்தவில்லை

source: commit-graph file is too small to hold %u chunks
ta: உறுதி-வரைபடம் கோப்பு %u துண்டுகளை வைத்திருக்க மிகவும் சிறியது

source: commit-graph required OID fanout chunk missing or corrupted
ta: உறுதி-வரைபடம் தேவை oid சுவைஞர் மன்றம் காணாமல் போனது அல்லது சிதைந்தது

source: commit-graph required OID lookup chunk missing or corrupted
ta: உறுதி-கிராப் தேவை oid தேடல் துண்டானது காணவில்லை அல்லது சிதைந்தது

source: commit-graph required commit data chunk missing or corrupted
ta: உறுதி-வரைபடம் தேவை தரவு துண்டுகள் காணவில்லை அல்லது சிதைந்தன

source: commit-graph has no base graphs chunk
ta: உறுதி-வரைபடத்தில் அடிப்படை வரைபடங்கள் இல்லை

source: commit-graph base graphs chunk is too small
ta: உறுதி-வரைபடம் பேச் வரைபடங்கள் துண்டு மிகவும் சிறியது

source: commit-graph chain does not match
ta: உறுதி-வரைபடம் சங்கிலி பொருந்தவில்லை

source: commit count in base graph too high: %<PRIuMAX>
ta: அடிப்படை வரைபடத்தில் மிக அதிகமாக எண்ணிக்கை: %<PRIuMAX>

source: commit-graph chain file too small
ta: உறுதி-வரைபடம் சங்கிலி கோப்பு மிகச் சிறியது

source: invalid commit-graph chain: line '%s' not a hash
ta: தவறான உறுதி-வரைபடம் சங்கிலி: வரி '%s' ஒரு ஆச் அல்ல

source: unable to find all commit-graph files
ta: அனைத்து உறுதி-வரைபடம் கோப்புகளையும் கண்டுபிடிக்க முடியவில்லை

source: invalid commit position. commit-graph is likely corrupt
ta: தவறான உறுதி நிலை. உறுதி-கிராப் ஊழல் நிறைந்ததாக இருக்கும்

source: could not find commit %s
ta: உறுதி %s கண்டுபிடிக்க முடியவில்லை

source: commit-graph requires overflow generation data but has none
ta: உறுதி-வரைபடத்திற்கு வழிதல் தலைமுறை தரவு தேவைப்படுகிறது, ஆனால் எதுவும் இல்லை

source: commit-graph overflow generation data is too small
ta: உறுதி-வரைபடம் வழிதல் தலைமுறை தரவு மிகவும் சிறியது

source: commit-graph extra-edges pointer out of bounds
ta: உறுதி-வரைபடம் கூடுதல்-விளிம்பு சுட்டிக்காட்டி எல்லைக்கு வெளியே

source: Loading known commits in commit graph
ta: உறுதி வரைபடத்தில் அறியப்பட்ட உறுதிடுகளை ஏற்றுகிறது

source: Expanding reachable commits in commit graph
ta: உறுதி வரைபடத்தில் அடையக்கூடிய உறுதிடுகளை விரிவுபடுத்துதல்

source: Clearing commit marks in commit graph
ta: உறுதி வரைபடத்தில் உறுதி மதிப்பெண்களை அழித்தல்

source: Computing commit graph topological levels
ta: கம்ப்யூட்டிங் உறுதி வரைபட இடவியல் நிலைகள்

source: Computing commit graph generation numbers
ta: வரைபட தலைமுறை எண்களை கம்ப்யூட்டிங் செய்வது

source: Computing commit changed paths Bloom filters
ta: கம்ப்யூட்டிங் உறுதி மாற்றப்பட்ட பாதைகள் பூக்கும் வடிப்பான்கள்

source: Collecting referenced commits
ta: குறிப்பிடப்பட்ட உறுதிடுகளை சேகரித்தல்

source: Finding commits for commit graph in %<PRIuMAX> pack
ta: %<PRIuMAX> பேக்கில் உறுதி வரைபடத்திற்கான உறுதிடுகளைக் கண்டறிதல்

source: error adding pack %s
ta: கட்டு %s சேர்ப்பதில் பிழை

source: error opening index for %s
ta: %s க்கான பிழை திறப்பது

source: Finding commits for commit graph among packed objects
ta: நிரம்பிய பொருள்களிடையே உறுதி வரைபடத்திற்கான உறுதிப்பாட்டைக் கண்டறிதல்

source: Finding extra edges in commit graph
ta: உறுதி வரைபடத்தில் கூடுதல் விளிம்புகளைக் கண்டறிதல்

source: failed to write correct number of base graph ids
ta: அடிப்படை வரைபட ஐடிகளின் சரியான எண்ணிக்கையை எழுதுவதில் தோல்வி

source: unable to create temporary graph layer
ta: தற்காலிக வரைபட அடுக்கை உருவாக்க முடியவில்லை

source: unable to adjust shared permissions for '%s'
ta: '%s' க்கான பகிரப்பட்ட அனுமதிகளை சரிசெய்ய முடியவில்லை

source: Writing out commit graph in %d pass
ta: %d பாசில் வரைபடத்தை எழுதுதல்

source: unable to open commit-graph chain file
ta: உறுதி-வரைபடம் சங்கிலி கோப்பைத் திறக்க முடியவில்லை

source: failed to rename base commit-graph file
ta: அடிப்படை உறுதி-வரைபடம் கோப்பை மறுபெயரிடுவதில் தோல்வி

source: failed to rename temporary commit-graph file
ta: தற்காலிக உறுதி-வரைபடம் கோப்பை மறுபெயரிடுவதில் தோல்வி

source: cannot merge graphs with %<PRIuMAX>, %<PRIuMAX> commits
ta: %<PRIuMAX>, %<PRIuMAX> உடன் வரைபடங்களை ஒன்றிணைக்க முடியாது

source: cannot merge graph %s, too many commits: %<PRIuMAX>
ta: வரைபடம் %s, அதிகமான உறுதிடுகளை ஒன்றிணைக்க முடியாது: %<PRIuMAX>

source: Scanning merged commits
ta: ஒருங்கிணைந்த உறுதிடுகள் ச்கேனிங்

source: Merging commit-graph
ta: உறுதி-வரைபடம் ஒன்றிணைத்தல்

source: attempting to write a commit-graph, but 'core.commitGraph' is disabled
ta: ஒரு உறுதி-வரைப்படம் எழுத முயற்சிப்பது, ஆனால் 'core.commitGraph' முடக்கப்பட்டுள்ளது

source: too many commits to write graph
ta: வரைபடத்தை எழுத நிறைய காம்

source: the commit-graph file has incorrect checksum and is likely corrupt
ta: உறுதி-வரைபடம் தவறான செக்சம் மற்றும் ஊழல் நிறைந்ததாக இருக்கும்

source: commit-graph has incorrect OID order: %s then %s
ta: உறுதி-வரைப்படம் தவறான oid வரிசையைக் கொண்டுள்ளது: %s பின்னர் %s

source: commit-graph has incorrect fanout value: fanout[%d] = %u != %u
ta: உறுதி-வரைபடம் தவறான ஃபேன்அவுட் மதிப்பைக் கொண்டுள்ளது: ஃபேன்அவுட் [ %d] = %u! = %u

source: failed to parse commit %s from commit-graph
ta: உறுதி-வரைபடத்திலிருந்து %s கம்யூனிட்டத்தை அலசத் தவறிவிட்டது

source: failed to parse commit %s from object database for commit-graph
ta: உறுதி-ப்ராஃபிற்கான பொருள் தரவுத்தளத்திலிருந்து %s அலசுவதில் தோல்வி

source: root tree OID for commit %s in commit-graph is %s != %s
ta: உறுதி-வரைபடத்தில் உறுதி %sக்கு வேர் மர எண் %s! = %s

source: commit-graph parent list for commit %s is too long
ta: உறுதி-வரைபடம் பெற்றோர் பட்டியல் %s மிக நீளமானது

source: commit-graph parent for %s is %s != %s
ta: %s என்பது %s! = %s க்கான உறுதி-வரைபடம் பெற்றோர்

source: commit-graph parent list for commit %s terminates early
ta: உறுதி-வரைபடம் பெற்றோர் பட்டியல் %s ஆரம்பத்தில் நிறுத்தப்படுகிறது

source: commit-graph generation for commit %s is %<PRIuMAX> < %<PRIuMAX>
ta: உறுதி %s %<PRIuMAX> < %<PRIuMAX>

source: commit date for commit %s in commit-graph is %<PRIuMAX> != %<PRIuMAX>
ta: உறுதி-வரைபடத்தில் உறுதி %s %<PRIuMAX>! = %<PRIuMAX>

source: commit-graph has both zero and non-zero generations (e.g., commits '%s' and '%s')
ta: உறுதி-வரைபடம் சுழிய மற்றும் பூச்சியமற்ற தலைமுறையினரைக் கொண்டுள்ளது (எ.கா., '%s' மற்றும் '%s'

source: Verifying commits in commit graph
ta: உறுதி வரைபடத்தில் உறுதிடுகளை சரிபார்க்கிறது

source: could not parse commit %s
ta: %s கம்யூனிட்டை அலச முடியவில்லை

source: %s %s is not a commit!
ta: %s %s என்பது ஒரு உறுதிப்பாடு அல்ல!

source: commit %s exists in commit-graph but not in the object database
ta: உறுதி-கிராப்பில் %s உள்ளன, ஆனால் பொருள் தரவுத்தளத்தில் இல்லை

source: Commit %s has an untrusted GPG signature, allegedly by %s.
ta: உறுதி %s நம்பத்தகாத சிபிசி கையொப்பத்தைக் கொண்டுள்ளது, இது %s என்று கூறப்படுகிறது.

source: Commit %s has a bad GPG signature allegedly by %s.
ta: உறுதி %s %s என்று கூறப்படும் மோசமான சிபிசி கையொப்பத்தைக் கொண்டுள்ளது.

source: Commit %s does not have a GPG signature.
ta: உறுதி %s சிபிசி கையொப்பம் இல்லை.

source: Commit %s has a good GPG signature by %s
ta: உறுதி %s ஒரு நல்ல சிபிசி கையொப்பத்தை %s மூலம் கொண்டுள்ளது

source: Warning: commit message did not conform to UTF-8. You may want to amend it after fixing the message, or set the config variable i18n.commitEncoding to the encoding your project uses.
ta: முன்னறிவிப்பு: உறுதி செய்தி யுடிஎஃப் -8 உடன் இணங்கவில்லை. செய்தியை சரிசெய்த பிறகு அதைத் திருத்த விரும்பலாம் அல்லது கட்டமைப்பை அமைக்கலாம் உங்கள் திட்டத்தைப் பயன்படுத்தும் குறியாக்கத்திற்கு மாறி i18n.commitencoding.

source: no compiler information available
ta: கம்பைலர் தகவல்கள் எதுவும் கிடைக்கவில்லை

source: no libc information available
ta: லிபிசி செய்தி எதுவும் கிடைக்கவில்லை

source: could not determine free disk size for '%s'
ta: '%s' க்கு இலவச வட்டு அளவை தீர்மானிக்க முடியவில்லை

source: could not get info for '%s'
ta: '%s' க்கான தகவலைப் பெற முடியவில்லை

source: [GLE %ld] health thread could not open '%ls'
ta: [gle %ld] சுகாதார நூல் ' %ls' ஐ திறக்க முடியவில்லை

source: [GLE %ld] health thread getting BHFI for '%ls'
ta: [gle %ld] ' %ls' க்கு bhfi ஐப் பெறுதல் சுகாதார நூல்

source: could not convert to wide characters: '%s'
ta: பரந்த எழுத்துக்களாக மாற்ற முடியவில்லை: '%s'

source: BHFI changed '%ls'
ta: bhfi '%ls' ஐ மாற்றியது

source: unhandled case in 'has_worktree_moved': %d
ta: 'has_worktree_moved' இல் தடையற்ற வழக்கு: %d

source: health thread wait failed [GLE %ld]
ta: சுகாதார நூல் காத்திருப்பு தோல்வியுற்றது [gle %ld]

source: Invalid path: %s
ta: தவறான பாதை: %s

source: Unable to create FSEventStream.
ta: fseventstream ஐ உருவாக்க முடியவில்லை.

source: Failed to start the FSEventStream
ta: fseventstream ஐத் தொடங்குவதில் தோல்வி

source: [GLE %ld] could not convert path to UTF-8: '%.*ls'
ta: [gle %ld] பாதையை utf-8 ஆக மாற்ற முடியவில்லை: ' %.*ls'

source: [GLE %ld] could not watch '%s'
ta: [gle %ld] '%s' ஐப் பார்க்க முடியவில்லை

source: [GLE %ld] could not get longname of '%s'
ta: [gle %ld] '%s' இன் நீண்ட பெயர் பெற முடியவில்லை

source: ReadDirectoryChangedW failed on '%s' [GLE %ld]
ta: readdirectorychangedw '%s' இல் தோல்வியுற்றது [gle %ld]

source: GetOverlappedResult failed on '%s' [GLE %ld]
ta: '%s' [gle %ld] இல் getoverlappedresult தோல்வியுற்றது

source: could not read directory changes [GLE %ld]
ta: அடைவு மாற்றங்களைப் படிக்க முடியவில்லை [gle %ld]

source: opendir('%s') failed
ta: opendir ('%s') தோல்வியடைந்தது

source: lstat('%s') failed
ta: lstat ('%s') தோல்வியடைந்தது

source: strbuf_readlink('%s') failed
ta: strbuf_readlink ('%s') தோல்வியடைந்தது

source: closedir('%s') failed
ta: மூடியர் ('%s') தோல்வியடைந்தது

source: [GLE %ld] unable to open for read '%ls'
ta: [gle %ld] ' %ls' ஐப் படிக்க முடியவில்லை

source: [GLE %ld] unable to get protocol information for '%ls'
ta: [gle %ld] ' %ls' க்கான நெறிமுறை தகவல்களைப் பெற முடியவில்லை

source: failed to copy SID (%ld)
ta: sid (%ld) நகலெடுப்பதில் தோல்வி

source: memory exhausted
ta: நினைவகம் தீர்ந்தது

source: Success
ta: செய்

source: No match
ta: பொருத்தம் இல்லை

source: Invalid regular expression
ta: தவறான வழக்கமான வெளிப்பாடு

source: Invalid collation character
ta: தவறான கூட்டு எழுத்து

source: Invalid character class name
ta: தவறான எழுத்து வகுப்பு பெயர்

source: Trailing backslash
ta: பின்சாய்வுக்கோடுகள்

source: Invalid back reference
ta: தவறான பின் குறிப்பு

source: Unmatched [ or [^
ta: ஒப்பிடமுடியாத [அல்லது [^

source: Unmatched ( or \(
ta: ஒப்பிடமுடியாத (அல்லது \ (

source: Unmatched \{
ta: ஒப்பிடமுடியாத \ {

source: Invalid content of \{\}
ta: \ {\ of இன் தவறான உள்ளடக்கம்

source: Invalid range end
ta: தவறான வரம்பு முடிவு

source: Memory exhausted
ta: நினைவகம் தீர்ந்தது

source: Invalid preceding regular expression
ta: வழக்கமான வெளிப்பாட்டிற்கு முந்தைய தவறான

source: Premature end of regular expression
ta: வழக்கமான வெளிப்பாட்டின் முன்கூட்டிய முடிவு

source: Regular expression too big
ta: வழக்கமான வெளிப்பாடு மிகப் பெரியது

source: Unmatched ) or \)
ta: ஒப்பிடமுடியாத) அல்லது \)

source: No previous regular expression
ta: முந்தைய வழக்கமான வெளிப்பாடு இல்லை

source: could not send IPC command
ta: ஐபிசி கட்டளையை அனுப்ப முடியவில்லை

source: could not read IPC response
ta: ஐபிசி பதிலைப் படிக்க முடியவில்லை

source: could not start accept_thread '%s'
ta: accept_thread '%s' ஐ தொடங்க முடியவில்லை

source: could not start worker[0] for '%s'
ta: '%s' க்கு தொழிலாளியைத் தொடங்க முடியவில்லை [0]

source: ConnectNamedPipe failed for '%s' (%lu)
ta: '%s' (%lu) க்கு connectபெயர்dpipe தோல்வியுற்றது

source: could not create fd from pipe for '%s'
ta: '%s' க்கு குழாயிலிருந்து fd ஐ உருவாக்க முடியவில்லை

source: could not start thread[0] for '%s'
ta: '%s' க்கு நூல் [0] ஐ தொடங்க முடியவில்லை

source: wait for hEvent failed for '%s'
ta: '%s' க்கு அவர் தோல்வியுற்றதற்காக காத்திருங்கள்

source: cannot resume in the background, please use 'fg' to resume
ta: பின்னணியில் மீண்டும் தொடங்க முடியாது, தயவுசெய்து மீண்டும் தொடங்க 'fg' ஐப் பயன்படுத்தவும்

source: cannot restore terminal settings
ta: முனைய அமைப்புகளை மீட்டெடுக்க முடியாது

source: exceeded maximum include depth (%d) while including %s from %s This might be due to circular includes.
ta: சேர்க்கும் போது ஆழம் (%d) அடங்கும் %s இருந்து %s இது வட்டமானது காரணமாக இருக்கலாம்.

source: could not expand include path '%s'
ta: விரிவாக்க முடியவில்லை பாதை '%s'

source: relative config includes must come from files
ta: உறவினர் கட்டமைப்பு கோப்புகளிலிருந்து வர வேண்டும்

source: relative config include conditionals must come from files
ta: தொடர்புடைய கட்டமைப்பை உள்ளடக்கிய நிபந்தனைகள் கோப்புகளிலிருந்து வர வேண்டும்

source: remote URLs cannot be configured in file directly or indirectly included by includeIf.hasconfig:remote.*.url
ta: தொலைநிலை முகவரி களை நேரடியாகவோ அல்லது மறைமுகமாகவோ சேர்க்கலாம் includeIf.hasconfig:தொலை.*.முகவரி

source: invalid config format: %s
ta: தவறான கட்டமைப்பு வடிவம்: %s

source: missing environment variable name for configuration '%.*s'
ta: உள்ளமைவு '%.*s' க்கான சூழல் மாறி பெயரைக் காணவில்லை

source: missing environment variable '%s' for configuration '%.*s'
ta: உள்ளமைவுக்கான சுற்றுச்சூழல் மாறி '%s' காணவில்லை '%.*s'

source: key does not contain a section: %s
ta: விசையில் ஒரு பிரிவு இல்லை: %s

source: key does not contain variable name: %s
ta: விசையில் மாறி பெயர் இல்லை: %s

source: invalid key: %s
ta: தவறான விசை: %s

source: invalid key (newline): %s
ta: தவறான விசை (நியூலைன்): %s

source: empty config key
ta: வெற்று கட்டமைப்பு விசை

source: bogus config parameter: %s
ta: போலி கட்டமைப்பு அளவுரு: %s

source: bogus format in %s
ta: %s இல் போலி வடிவம்

source: bogus count in %s
ta: %s இல் போலி எண்ணிக்கை

source: too many entries in %s
ta: %s இல் பல உள்ளீடுகள்

source: missing config key %s
ta: இல்லை கட்டமைப்பு விசை %s

source: missing config value %s
ta: கட்டமைப்பு மதிப்பு %s காணவில்லை

source: bad config line %d in blob %s
ta: மோசமான கட்டமைப்பு வரி %d இருமபெபொ %s இல்

source: bad config line %d in file %s
ta: மோசமான கட்டமைப்பு வரி %d கோப்பு %s இல்

source: bad config line %d in standard input
ta: நிலையான உள்ளீட்டில் மோசமான கட்டமைப்பு வரி %d

source: bad config line %d in submodule-blob %s
ta: மோசமான கட்டமைப்பு வரி %d துணைதொகுதி-இருமபெபொ %s இல்

source: bad config line %d in command line %s
ta: மோசமான கட்டமைப்பு வரி %d கட்டளை வரியில் %s

source: bad config line %d in %s
ta: மோசமான கட்டமைப்பு வரி %d %s இல்

source: out of range
ta: வரம்பிற்கு வெளியே

source: invalid unit
ta: தவறான அலகு

source: bad numeric config value '%s' for '%s': %s
ta: '%s' க்கு மோசமான எண் கட்டமைப்பு மதிப்பு '%s':%s

source: bad numeric config value '%s' for '%s' in blob %s: %s
ta: மோசமான எண் கட்டமைப்பு மதிப்பு '%s' க்கு '%s' இல் குமிழ் %s: %s

source: bad numeric config value '%s' for '%s' in file %s: %s
ta: மோசமான எண் கட்டமைப்பு மதிப்பு '%s' க்கு '%s' கோப்பு %s: %s

source: bad numeric config value '%s' for '%s' in standard input: %s
ta: நிலையான உள்ளீட்டில் '%s' க்கான மோசமான எண் கட்டமைப்பு மதிப்பு '%s':%s

source: bad numeric config value '%s' for '%s' in submodule-blob %s: %s
ta: துணைதொகுதி-குமிழ் %s: %s இல் '%s' க்கான மோசமான எண் கட்டமைப்பு மதிப்பு '%s'

source: bad numeric config value '%s' for '%s' in command line %s: %s
ta: கட்டளை வரியில் '%s' க்கான மோசமான எண் கட்டமைப்பு மதிப்பு '%s': %s: %s

source: bad numeric config value '%s' for '%s' in %s: %s
ta: %s இல் '%s' க்கான மோசமான எண் கட்டமைப்பு மதிப்பு '%s': %s

source: invalid value for variable %s
ta: மாறி %s க்கு தவறான மதிப்பு

source: ignoring unknown core.fsync component '%s'
ta: அறியப்படாத core.fsync கூறு '%s'

source: bad boolean config value '%s' for '%s'
ta: மோசமான பூலியன் கட்டமைப்பு மதிப்பு '%s' '%s'

source: failed to expand user dir in: '%s'
ta: பயனர் டிர் விரிவாக்குவதில் தோல்வி: '%s'

source: '%s' for '%s' is not a valid timestamp
ta: '%s' க்கான '%s' சரியான நேர முத்திரை அல்ல

source: abbrev length out of range: %d
ta: வரம்பிலிருந்து சுருக்கமான நீளம்: %d

source: bad zlib compression level %d
ta: மோசமான ச்லிப் சுருக்க நிலை %d

source: ignoring unknown core.fsyncMethod value '%s'
ta: அறியப்படாத core.fsyncMethod மதிப்பு '%s' தவிர்க்கபடும்

source: core.fsyncObjectFiles is deprecated; use core.fsync instead
ta: core.fsyncObjectFiles நீக்கப்பட்டது; அதற்கு பதிலாக core.fsync ஐப் பயன்படுத்தவும்

source: invalid mode for object creation: %s
ta: பொருள் உருவாக்கத்திற்கான தவறான பயன்முறை: %s

source: malformed value for %s
ta: %s க்கான தவறான மதிப்பு

source: malformed value for %s: %s
ta: %s: %s க்கான தவறான மதிப்பு

source: must be one of nothing, matching, simple, upstream or current
ta: எதுவுமில்லை, பொருந்தும், எளிமையான, மேலோடை அல்லது நடப்பு

source: unable to load config blob object '%s'
ta: கட்டமைப்பு குமிழ் பொருளை '%s' ஏற்ற முடியவில்லை

source: reference '%s' does not point to a blob
ta: '%s' குறிப்பு ஒரு குமிழியை சுட்டிக்காட்டாது

source: unable to resolve config blob '%s'
ta: கட்டமைப்பு குமிழி '%s' ஐ தீர்க்க முடியவில்லை

source: unable to parse command-line config
ta: கட்டளை-வரி கட்டமைப்பை அலச முடியவில்லை

source: unknown error occurred while reading the configuration files
ta: உள்ளமைவு கோப்புகளைப் படிக்கும்போது அறியப்படாத பிழை ஏற்பட்டது

source: Invalid %s: '%s'
ta: தவறான %s: '%s'

source: splitIndex.maxPercentChange value '%d' should be between 0 and 100
ta: splitIndex.maxPercentChange மதிப்பு '%d' 0 முதல் 100 வரை இருக்க வேண்டும்

source: unable to parse '%s' from command-line config
ta: கட்டளை-வரி உள்ளமைவிலிருந்து '%s' பாகுபடுத்த முடியவில்லை

source: bad config variable '%s' in file '%s' at line %d
ta: '%s' மோசமான கட்டமைப்பு மாறி '%s' கோப்பில் வரி %d இல்

source: invalid section name '%s'
ta: தவறான பிரிவு பெயர் '%s'

source: %s has multiple values
ta: %s பல மதிப்புகளைக் கொண்டுள்ளன

source: failed to write new configuration file %s
ta: புதிய உள்ளமைவு கோப்பு %s எழுதுவதில் தோல்வி

source: could not lock config file %s
ta: கட்டமைப்பு கோப்பை %s பூட்ட முடியவில்லை

source: opening %s
ta: திறந்த %s

source: invalid config file %s
ta: தவறான கட்டமைப்பு கோப்பு %s

source: fstat on %s failed
ta: %s இல் fstat தோல்வியுற்றது

source: unable to mmap '%s'%s
ta: mmap '%s'%s ஐ முடிக்க முடியவில்லை

source: chmod on %s failed
ta: chmod on %s தோல்வியுற்றது

source: could not write config file %s
ta: கட்டமைப்பு கோப்பு %s ஐ எழுத முடியவில்லை

source: could not set '%s' to '%s'
ta: '%s' ஐ '%s' க்கு அமைக்க முடியவில்லை

source: invalid section name: %s
ta: தவறான பிரிவு பெயர்: %s

source: refusing to work with overly long line in '%s' on line %<PRIuMAX>
ta: '%s' இல் அதிகப்படியான நீண்ட வரிசையில் பணி செய்ய மறுக்கிறது வரி %<PRIuMAX> இல்

source: missing value for '%s'
ta: '%s' க்கான மதிப்பு இல்லை

source: the remote end hung up upon initial contact
ta: ஆரம்ப தொடர்பில் தொலைநிலை முடிவு தொங்கியது

source: Could not read from remote repository. Please make sure you have the correct access rights and the repository exists.
ta: தொலை களஞ்சியத்திலிருந்து படிக்க முடியவில்லை. உங்களிடம் சரியான அணுகல் உரிமைகள் இருப்பதை உறுதிப்படுத்திக் கொள்ளுங்கள் மற்றும் களஞ்சியம் உள்ளது.

source: server doesn't support '%s'
ta: சேவையகம் '%s' ஐ ஆதரிக்கவில்லை

source: server doesn't support feature '%s'
ta: சேவையகம் '%s' அம்சத்தை ஆதரிக்கவில்லை

source: expected flush after capabilities
ta: திறன்களுக்குப் பிறகு எதிர்பார்க்கப்படும் பறிப்பு

source: ignoring capabilities after first line '%s'
ta: முதல் வரிக்குப் பிறகு திறன்களை புறக்கணித்தல் '%s'

source: protocol error: unexpected capabilities^{}
ta: நெறிமுறை பிழை: எதிர்பாராத திறன்கள்^{}

source: protocol error: expected shallow sha-1, got '%s'
ta: நெறிமுறை பிழை: எதிர்பார்க்கப்படும் ஆழமற்ற sha-1, '%s' கிடைத்தது

source: repository on the other end cannot be shallow
ta: மறுமுனையில் களஞ்சியம் ஆழமற்றதாக இருக்க முடியாது

source: invalid packet
ta: தவறான பாக்கெட்

source: protocol error: unexpected '%s'
ta: நெறிமுறை பிழை: எதிர்பாராத '%s'

source: unknown object format '%s' specified by server
ta: அறியப்படாத பொருள் வடிவம் '%s' சேவையகத்தால் குறிப்பிடப்பட்டுள்ளது

source: error on bundle-uri response line %d: %s
ta: மூட்டை-யூரி மறுமொழி வரி %d: %s இல் பிழை

source: expected flush after bundle-uri listing
ta: மூட்டை-யூரி பட்டியலுக்குப் பிறகு எதிர்பார்க்கப்படும் பறிப்பு

source: expected response end packet after ref listing
ta: ref பட்டியலுக்குப் பிறகு எதிர்பார்க்கப்படும் மறுமொழி முடிவு பாக்கெட்

source: invalid ls-refs response: %s
ta: தவறான ls-refs பதில்: %s

source: expected flush after ref listing
ta: ref பட்டியலுக்குப் பிறகு எதிர்பார்க்கப்படும் பறிப்பு

source: protocol '%s' is not supported
ta: நெறிமுறை '%s' ஆதரிக்கப்படவில்லை

source: unable to set SO_KEEPALIVE on socket
ta: SO_KEEPALIVE ஐ சாக்கெட்டில் அமைக்க முடியவில்லை

source: Looking up %s ...
ta: %s மேலே ...

source: unable to look up %s (port %s) (%s)
ta: %s (துறைமுகம் %s) ( %s) பார்க்க முடியவில்லை

source: done. Connecting to %s (port %s) ...
ta: முடிந்தது. %s (துறைமுகம் %s) உடன் இணைக்கிறது ...

source: unable to connect to %s: %s
ta: %s உடன் இணைக்க முடியவில்லை: %s

source: done.
ta: முடிந்தது.

source: unable to look up %s (%s)
ta: %s ( %s) ஐப் பார்க்க முடியவில்லை

source: unknown port %s
ta: அறியப்படாத துறைமுகம் %s

source: strange hostname '%s' blocked
ta: விசித்திரமான ஓச்ட்பெயர் '%s' தடுக்கப்பட்டது

source: strange port '%s' blocked
ta: விசித்திரமான துறைமுகம் '%s' தடுக்கப்பட்டன

source: cannot start proxy %s
ta: பதிலாள் %s தொடங்க முடியாது

source: no path specified; see 'git help pull' for valid url syntax
ta: எந்த பாதையும் குறிப்பிடப்படவில்லை; செல்லுபடியாகும் முகவரி தொடரியல் 'அறிவிலி உதவி புல்' ஐப் பார்

source: newline is forbidden in git:// hosts and repo paths
ta: git: // ஓச்ட்கள் மற்றும் ரெப்போ பாதைகளில் நியூலைன் தடைசெய்யப்பட்டுள்ளது

source: ssh variant 'simple' does not support -4
ta: பாஓடு மாறுபாடு 'சிம்பிள்' -4 ஐ ஆதரிக்காது

source: ssh variant 'simple' does not support -6
ta: பாஓடு மாறுபாடு 'சிம்பிள்' -6 ஐ ஆதரிக்காது

source: ssh variant 'simple' does not support setting port
ta: பாஓடு மாறுபாடு 'சிம்பிள்' துறைமுகத்தை ஆதரிக்காது

source: strange pathname '%s' blocked
ta: விசித்திரமான பாதை பெயர் '%s' தடுக்கப்பட்டது

source: unable to fork
ta: முட்கரண்டி செய்ய முடியவில்லை

source: Could not run 'git rev-list'
ta: 'git rev-list' இயக்க முடியவில்லை

source: failed write to rev-list
ta: ரெவ்-லிச்டுக்கு எழுத்து தோல்வியுற்றது

source: failed to close rev-list's stdin
ta: ரெவ்-லிச்டின் எச்.டி.டி.இனை மூடுவதில் தோல்வி

source: illegal crlf_action %d
ta: சட்டவிரோத crlf_action %d

source: CRLF would be replaced by LF in %s
ta: சிஆர்எல்எஃப் %s இல் எல்எஃப் ஆல் மாற்றப்படும்
