Repository: Nizhal/git-ta-po
Catalog: po/*.po
Languages: ta

source: unable to load existing sparse-checkout patterns
ta: ஏற்கனவே உள்ள சிதறல்-சோதனை வடிவங்களை ஏற்ற முடியவில்லை

source: existing sparse-checkout patterns do not use cone mode
ta: தற்போதுள்ள சிதறல்-சோதனை வடிவங்கள் கூம்பு பயன்முறையைப் பயன்படுத்துவதில்லை

source: please run from the toplevel directory in non-cone mode
ta: கோன் அல்லாத பயன்முறையில் டோப்ல்வெல் கோப்பகத்திலிருந்து இயக்கவும்

source: specify directories rather than patterns (no leading slash)
ta: வடிவங்களை விட கோப்பகங்களைக் குறிப்பிடவும் (முன்னணி குறைப்பு இல்லை)

source: specify directories rather than patterns. If your directory starts with a '!', pass --skip-checks
ta: வடிவங்களை விட கோப்பகங்களைக் குறிப்பிடவும். உங்கள் அடைவு ஒரு '!' உடன் தொடங்கினால், அனுப்பு --skip-checks

source: specify directories rather than patterns. If your directory really has any of '*?[]\' in it, pass --skip-checks
ta: வடிவங்களை விட கோப்பகங்களைக் குறிப்பிடவும். உங்கள் கோப்பகத்தில் உண்மையில் அதில் '*?[]\' ஏதேனும் இருந்தால், அனுப்பு --skip-checks

source: '%s' is not a directory; to treat it as a directory anyway, rerun with --skip-checks
ta: '%s' ஒரு அடைவு அல்ல; எப்படியிருந்தாலும் அதை ஒரு கோப்பகமாகக் கருத, --skip-checks உடன் மீண்டும் இயக்கவும்

source: pass a leading slash before paths such as '%s' if you want a single file (see NON-CONE PROBLEMS in the git-sparse-checkout manual).
ta: நீங்கள் ஒரு கோப்பை விரும்பினால் '%s' போன்ற பாதைகளுக்கு முன் ஒரு முன்னணி குறைப்பைக் கடந்து செல்லுங்கள் (git-sparse-checkout கையேட்டில் கூம்பு அல்லாத சிக்கல்களைப் பார்).

source: git sparse-checkout add [--skip-checks] (--stdin | <patterns>)
ta: git sparse-checkout add [--skip-checks] (--stdin | <வடிவங்கள்>)

source: skip some sanity checks on the given paths that might give false positives
ta: தவறான நேர்மறைகளை வழங்கக்கூடிய கொடுக்கப்பட்ட பாதைகளில் சில நல்லறிவு சோதனைகளைத் தவிர்க்கவும்

source: read patterns from standard in
ta: தரநிலையிலிருந்து வடிவங்களைப் படியுங்கள்

source: no sparse-checkout to add to
ta: சேர்க்க சிதறிய-சோதனை இல்லை

source: git sparse-checkout set [--[no-]cone] [--[no-]sparse-index] [--skip-checks] (--stdin | <patterns>)
ta: git sparse-checkout set [--[no-]cone] [--[no-]sparse-index] [--skip-checks] (--stdin | <வடிவங்கள்>)

source: must be in a sparse-checkout to reapply sparsity patterns
ta: ச்பார்சிட்டி வடிவங்களை மீண்டும் பயன்படுத்த ஒரு சிதறிய-சரிபார்ப்பில் இருக்க வேண்டும்

source: error while refreshing working directory
ta: பணி கோப்பகத்தை புத்துணர்ச்சியூட்டும் போது பிழை

source: git sparse-checkout check-rules [-z] [--skip-checks][--[no-]cone] [--rules-file <file>]
ta: git sparse-checkout check-rules [-z] [--skip-checks][--[no-]cone] [--rules-file <கோப்பு>]

source: terminate input and output files by a NUL character
ta: உள்ளீடு மற்றும் வெளியீட்டு கோப்புகளை ஒரு nul எழுத்துக்குறி மூலம் நிறுத்தவும்

source: when used with --rules-file interpret patterns as cone mode patterns
ta: கூம்பு பயன்முறை வடிவங்களாக --rules-file விளக்க வடிவங்களுடன் பயன்படுத்தும்போது

source: use patterns in <file> instead of the current ones.
ta: தற்போதையவற்றுக்கு பதிலாக <file> இல் வடிவங்களைப் பயன்படுத்தவும்.

source: git stash list [<log-options>]
ta: அறிவிலி ச்டாச் பட்டியல் [<பதிவு-விருப்பங்கள்>]

source: git stash show [-u | --include-untracked | --only-untracked] [<diff-options>] [<stash>]
ta: git stash show [-u | --include-untracked | --only-untracked] [<வேறுபாடு-விருப்பங்கள்>] [<ஒதுக்கு>]

source: git stash drop [-q | --quiet] [<stash>]
ta: git stash drop [-q | --quiet] [<ச்டாச்>]

source: git stash pop [--index] [-q | --quiet] [<stash>]
ta: git stash pop [--index] [-q | --quiet] [<ச்டாச்>]

source: git stash apply [--index] [-q | --quiet] [<stash>]
ta: git stash apply [--index] [-q | --quiet] [<ச்டாச்>]

source: git stash branch <branchname> [<stash>]
ta: git stash branch <கிளை பெயர்> [<ச்டாச்>]

source: git stash store [(-m | --message) <message>] [-q | --quiet] <commit>
ta: git stash store [(-m |--message) <செய்தி>] [-q | --quiet] <உறுதி>

source: git stash [push [-p | --patch] [-S | --staged] [-k | --[no-]keep-index] [-q | --quiet] [-u | --include-untracked] [-a | --all] [(-m | --message) <message>] [--pathspec-from-file=<file> [--pathspec-file-nul]] [--] [<pathspec>...]]
ta: git stash [push [-p | --patch] [-S | --staged] [-k | --[no-]keep-index] [-q | --quiet] [-u | --include-untracked] [-a | --all] [(-m | --message) <செய்தி>] [--pathspec-from-file=<கோப்பு> [--pathspec-file-nul]] [--] [<பாதைகுறி>...]]

source: git stash save [-p | --patch] [-S | --staged] [-k | --[no-]keep-index] [-q | --quiet] [-u | --include-untracked] [-a | --all] [<message>]
ta: git stash save [-p | --patch] [-S | --staged] [-k | --[no-]keep-index] [-q | --quiet] [-u | --include-untracked] [-a | --all] [<செய்தி>]

source: git stash create [<message>]
ta: git stash create [<செய்தி>]

source: '%s' is not a stash-like commit
ta: '%s' என்பது ஒரு ச்டாச் போன்ற உறுதி அல்ல

source: Too many revisions specified:%s
ta: பல திருத்தங்கள் குறிப்பிடப்பட்டுள்ளன:%s

source: No stash entries found.
ta: ச்டாச் உள்ளீடுகள் எதுவும் கிடைக்கவில்லை.

source: %s is not a valid reference
ta: %s சரியான குறிப்பு அல்ல

source: git stash clear with arguments is unimplemented
ta: வாதங்களுடன் git stash தெளிவற்றது

source: WARNING: Untracked file in way of tracked file! Renaming %s -> %s to make room.
ta: முன்னறிவிப்பு: கண்காணிக்கப்பட்ட கோப்பின் வழியில் கட்டுப்படுத்தப்படாத கோப்பு! மறுபெயரிடுதல் %s -> %s அறை செய்ய.

source: cannot apply a stash in the middle of a merge
ta: ஒன்றிணைப்பின் நடுவில் ஒரு ச்டாசைப் பயன்படுத்த முடியாது

source: could not generate diff %s^!.
ta: வேறுபாடு %s^! ஐ உருவாக்க முடியவில்லை.

source: conflicts in index. Try without --index.
ta: குறியீட்டில் மோதல்கள். --index இல்லாமல் முயற்சி செய்யுங்கள்.

source: could not save index tree
ta: குறியீட்டு மரத்தை சேமிக்க முடியவில்லை

source: Merging %s with %s
ta: %s உடன் %s உடன் இணைத்தல்

source: Index was not unstashed.
ta: குறியீட்டு கட்டமைக்கப்படவில்லை.

source: could not restore untracked files from stash
ta: கட்டுப்படுத்தப்படாத கோப்புகளை ச்டாசிலிருந்து மீட்டெடுக்க முடியவில்லை

source: attempt to recreate the index
ta: குறியீட்டை மீண்டும் உருவாக்க முயற்சி

source: Dropped %s (%s)
ta: %s ( %s) கைவிடப்பட்டது

source: %s: Could not drop stash entry
ta: %s: ச்டாச் நுழைவை கைவிட முடியவில்லை

source: '%s' is not a stash reference
ta: '%s' ஒரு ச்டாச் குறிப்பு அல்ல

source: The stash entry is kept in case you need it again.
ta: உங்களுக்கு மீண்டும் தேவைப்பட்டால் ச்டாச் நுழைவு வைக்கப்படுகிறது.

source: No branch name specified
ta: கிளை பெயர் குறிப்பிடப்படவில்லை

source: failed to parse tree
ta: மரத்தை அலசத் தவறிவிட்டது

source: failed to unpack trees
ta: மரங்களைத் திறக்கத் தவறிவிட்டது

source: include untracked files in the stash
ta: கட்டுப்படுத்தப்படாத கோப்புகளை ச்டாசில் சேர்க்கவும்

source: only show untracked files in the stash
ta: கட்டுப்படுத்தப்படாத கோப்புகளை மட்டுமே காட்டுங்கள்

source: Cannot update %s with %s
ta: %s உடன் %s உடன் புதுப்பிக்க முடியாது

source: stash message
ta: செய்தி

source: "git stash store" requires one <commit> argument
ta: "அறிவிலி ச்டாச் கடை" க்கு ஒரு < உறுதி> உரையாடல் தேவை

source: No staged changes
ta: அரங்கேற்றப்பட்ட மாற்றங்கள் இல்லை

source: No changes selected
ta: எந்த மாற்றங்களும் தேர்ந்தெடுக்கப்படவில்லை

source: You do not have the initial commit yet
ta: உங்களிடம் இன்னும் ஆரம்ப உறுதி இல்லை

source: Cannot save the current index state
ta: தற்போதைய குறியீட்டு நிலையை சேமிக்க முடியாது

source: Cannot save the untracked files
ta: கட்டுப்படுத்தப்படாத கோப்புகளை சேமிக்க முடியாது

source: Cannot save the current worktree state
ta: தற்போதைய பணிப்படை நிலையை சேமிக்க முடியாது

source: Cannot save the current staged state
ta: தற்போதைய அரங்கேற்ற நிலையை சேமிக்க முடியாது

source: Cannot record working tree state
ta: பணி மர நிலையை பதிவு செய்ய முடியாது

source: Can't use --patch and --include-untracked or --all at the same time
ta: --patch மற்றும் --include-untracked அல்லது --all ஒரே நேரத்தில் பயன்படுத்த முடியாது

source: Can't use --staged and --include-untracked or --all at the same time
ta: --staged மற்றும் --include-untracked அல்லது --all ஒரே நேரத்தில் பயன்படுத்த முடியாது

source: Did you forget to 'git add'?
ta: 'git add' என்பதை மறந்துவிட்டீர்களா?

source: No local changes to save
ta: சேமிக்க உள்ளக மாற்றங்கள் இல்லை

source: Cannot initialize stash
ta: ச்டாசைத் தொடங்க முடியாது

source: Cannot save the current status
ta: தற்போதைய நிலையை சேமிக்க முடியாது

source: Saved working directory and index state %s
ta: சேமித்த பணி அடைவு மற்றும் குறியீட்டு நிலை %s

source: Cannot remove worktree changes
ta: பணியிட மாற்றங்களை அகற்ற முடியாது

source: keep index
ta: குறியீட்டை வைத்திருங்கள்

source: stash staged changes only
ta: ச்டாச் ச்டேச் மாற்றங்கள் மட்டுமே

source: stash in patch mode
ta: ஒட்டு பயன்முறையில் ச்டாச்

source: quiet mode
ta: அமைதியான பயன்முறை

source: include untracked files in stash
ta: கட்டுப்படுத்தப்படாத கோப்புகளை ச்டாசில் சேர்க்கவும்

source: include ignore files
ta: புறக்கணிப்பு கோப்புகளைச் சேர்க்கவும்

source: skip and remove all lines starting with comment character
ta: கருத்து எழுத்துடன் தொடங்கி அனைத்து வரிகளையும் தவிர்த்து அகற்றவும்

source: prepend comment character and space to each line
ta: ஒவ்வொரு வரிக்கும் கருத்து எழுத்து மற்றும் இடத்தை ஆயத்தம் செய்யுங்கள்

source: Expecting a full ref name, got %s
ta: ஒரு முழு ரெஃப் பெயரை எதிர்பார்த்து, %s கிடைத்தன

source: could not get a repository handle for submodule '%s'
ta: துணைதொகுதி '%s' க்கு ஒரு களஞ்சிய கைப்பிடியைப் பெற முடியவில்லை

source: could not look up configuration '%s'. Assuming this repository is its own authoritative upstream.
ta: '%s' உள்ளமைவை பார்க்க முடியவில்லை. இந்த களஞ்சியம் அதன் சொந்த அதிகாரப்பூர்வ மேலோடை என்று கருதுவது.

source: No url found for submodule path '%s' in .gitmodules
ta: துணைதொகுதி பாதை '%s' க்கு முகவரி எதுவும் கிடைக்கவில்லை .gitmodules

source: Entering '%s'
ta: '%s' என நுழைகிறது

source: run_command returned non-zero status for %s .
ta: run_command %s சுழியமற்ற நிலையை வழங்கியது .

source: run_command returned non-zero status while recursing in the nested submodules of %s .
ta: run_command %s இன் உள்ளமைக்கப்பட்ட துணைதொகுதிகளில் திரும்பும்போது சுழியமற்ற நிலையைத் திருப்பினார் .

source: suppress output of entering each submodule command
ta: ஒவ்வொரு துணைதொகுதி கட்டளையையும் உள்ளிடுவதற்கான வெளியீட்டை அடக்கவும்

source: recurse into nested submodules
ta: உள்ளமைக்கப்பட்ட துணைதொகுதிகளில் மீண்டும் உருவாகிறது

source: git submodule foreach [--quiet] [--recursive] [--] <command>
ta: git submodule foreach [--quiet] [--recursive] [--] <கட்டளை>

source: Failed to register url for submodule path '%s'
ta: துணைதொகுதி பாதை '%s' க்கு முகவரி ஐ பதிவு செய்வதில் தோல்வி

source: Submodule '%s' (%s) registered for path '%s'
ta: துணைதொகுதி '%s' (%s) பாதை '%s' க்கு பதிவு செய்யப்பட்டுள்ளது

source: warning: command update mode suggested for submodule '%s'
ta: முன்னறிவிப்பு: துணைதொகுதி '%s' க்கு பரிந்துரைக்கப்பட்ட கட்டளை புதுப்பிப்பு பயன்முறை

source: Failed to register update mode for submodule path '%s'
ta: துணைதொகுதி பாதை '%s' க்கான புதுப்பிப்பு பயன்முறையை பதிவு செய்வதில் தோல்வி

source: suppress output for initializing a submodule
ta: ஒரு துணைதொகுதி துவக்க வெளியீட்டை அடக்கவும்

source: git submodule init [<options>] [<path>]
ta: git துணைதொகுதி init [<விருப்பங்கள்>] [<ath>]

source: no submodule mapping found in .gitmodules for path '%s'
ta: துணைதொகுதி மேப்பிங் இல்லை.gitmodules இல் இந்த பாதைக்கான '%s'

source: could not resolve HEAD ref inside the submodule '%s'
ta: '%s' என்ற துணைதொகுதிக்குள் தலை ref ஐ தீர்க்க முடியவில்லை

source: failed to recurse into submodule '%s'
ta: துணைதொகுதி '%s' இல் மீண்டும் வருவதில் தோல்வி

source: suppress submodule status output
ta: துணைதொகுதி நிலை வெளியீட்டை அடக்கவும்

source: use commit stored in the index instead of the one stored in the submodule HEAD
ta: துணைதொகுதி தலையில் சேமிக்கப்பட்ட ஒன்றுக்கு பதிலாக குறியீட்டில் சேமிக்கப்பட்ட உறுதிப்பாட்டைப் பயன்படுத்தவும்

source: git submodule status [--quiet] [--cached] [--recursive] [<path>...]
ta: git submodule status [--quiet] [--cached] [--recursive] [<பாதை>...]

source: couldn't hash object from '%s'
ta: '%s' இலிருந்து பொருள் ஆச் செய்ய முடியவில்லை

source: use the commit stored in the index instead of the submodule HEAD
ta: துணைதொகுதி தலைக்கு பதிலாக குறியீட்டில் சேமிக்கப்பட்ட உறுதிப்பாட்டைப் பயன்படுத்தவும்

source: compare the commit in the index with that in the submodule HEAD
ta: குறியீட்டில் உள்ள உறுதிப்பாட்டை துணைதொகுதி தலையில் ஒப்பிடுக

source: skip submodules with 'ignore_config' value set to 'all'
ta: 'all' அமைக்கப்பட்ட 'ignore_config' மதிப்பைக் கொண்டு துணைதொகுதியைத் தவிர்

source: limit the summary size
ta: சுருக்கமான அளவைக் கட்டுப்படுத்துங்கள்

source: git submodule summary [<options>] [<commit>] [--] [<path>]
ta: git துணைதொகுதி சுருக்கம் [<விருப்பங்கள்>] [< உறுதி>] [-] [<athe>]

source: could not fetch a revision for HEAD
ta: தலைக்கு ஒரு திருத்தம் பெற முடியவில்லை

source: Synchronizing submodule url for '%s'
ta: '%s' க்கு துணைதொகுதி முகவரி ஐ ஒத்திசைத்தல்

source: failed to register url for submodule path '%s'
ta: துணைதொகுதி பாதை '%s' க்கு முகவரி ஐ பதிவு செய்வதில் தோல்வி

source: failed to update remote for submodule '%s'
ta: துணைதொகுதி '%s' க்கு தொலை புதுப்பிக்கத் தவறிவிட்டது

source: suppress output of synchronizing submodule url
ta: ஒத்திசைவு துணைதொகுதி முகவரி இன் வெளியீட்டை அடக்கவும்

source: git submodule sync [--quiet] [--recursive] [<path>]
ta: git submodule sync [--quiet] [--recursive] [<பாதை>]

source: Submodule work tree '%s' contains a .git directory. This will be replaced with a .git file by using absorbgitdirs.
ta: துணைதொகுதி பணி மரம் '%s' ஒரு .git கோப்பகத்தைக் கொண்டுள்ளது. இது உறிஞ்சுதல் மூலம் .git கோப்புடன் மாற்றப்படும்.

source: Submodule work tree '%s' contains local modifications; use '-f' to discard them
ta: துணைதொகுதி பணி மரம் '%s' உள்ளக மாற்றங்களைக் கொண்டுள்ளது; அவற்றை நிராகரிக்க '-f' ஐப் பயன்படுத்தவும்

source: Cleared directory '%s'
ta: அழிக்கப்பட்ட அடைவு '%s'

source: Could not remove submodule work tree '%s'
ta: துணைதொகுதி பணி மரத்தை '%s' அகற்ற முடியவில்லை

source: could not create empty submodule directory %s
ta: வெற்று துணைதொகுதி அடைவு %s ஐ உருவாக்க முடியவில்லை

source: Submodule '%s' (%s) unregistered for path '%s'
ta: துணைதொகுதி '%s' (%s) பாதையின் '%s' க்கு பதிவு செய்யப்படாதது

source: remove submodule working trees even if they contain local changes
ta: உள்ளக மாற்றங்களைக் கொண்டிருந்தாலும் துணைதொகுதி பணி மரங்களை அகற்றவும்

source: unregister all submodules
ta: அனைத்து துணைதொகுதிகளையும் பதிவு செய்யவும்

source: git submodule deinit [--quiet] [-f | --force] [--all | [--] [<path>...]]
ta: git submodule deinit [--quiet] [-f | --force] [--all | [--] [<பாதை>...]]

source: Use '--all' if you really want to deinitialize all submodules
ta: நீங்கள் உண்மையிலேயே அனைத்து துணைதொகுதிகளையும் நீக்க விரும்பினால் '--all' ஐப் பயன்படுத்தவும்

source: An alternate computed from a superproject's alternate is invalid. To allow Git to clone without an alternate in such a case, set submodule.alternateErrorStrategy to 'info' or, equivalently, clone with '--reference-if-able' instead of '--reference'.
ta: ஒரு சூப்பர் புரோசெக்டின் மாற்றியிலிருந்து கணக்கிடப்பட்ட மாற்று தவறானது. அத்தகைய விசயத்தில் மாற்று இல்லாமல் அறிவிலி நகலி செய்ய அனுமதிக்க, அமைக்கவும் submodule.alternateErrorStrategy மதிப்பு 'info' அல்லது, சமமாக, '--reference-if-able' உடன் நகலி '--reference'க்கு பதிலாக.

source: could not get a repository handle for gitdir '%s'
ta: கிடிர் '%s' க்கு ஒரு களஞ்சிய கைப்பிடியைப் பெற முடியவில்லை

source: submodule '%s' cannot add alternate: %s
ta: துணைதொகுதி '%s' மாற்றைச் சேர்க்க முடியாது: %s

source: Value '%s' for submodule.alternateErrorStrategy is not recognized
ta: submodule.alternateErrorStrategy க்கான மதிப்பு '%s' அங்கீகரிக்கப்படவில்லை

source: Value '%s' for submodule.alternateLocation is not recognized
ta: submodule.alternateLocation மதிப்பு '%s' அங்கீகரிக்கப்படவில்லை

source: refusing to create/use '%s' in another submodule's git dir
ta: மற்றொரு துணைதொகுதியின் அறிவிலி கோப்புறையில் '%s' உருவாக்க/பயன்படுத்த மறுக்கிறது

source: directory not empty: '%s'
ta: அடைவு காலியாக இல்லை: '%s'

source: clone of '%s' into submodule path '%s' failed
ta: துணைதொகுதி பாதையில் '%s' நகலி '%s' தோல்வியடைந்தது

source: could not get submodule directory for '%s'
ta: '%s' க்கான துணைதொகுதி கோப்பகத்தைப் பெற முடியவில்லை

source: alternative anchor for relative paths
ta: உறவினர் பாதைகளுக்கான மாற்று நங்கூரம்

source: where the new submodule will be cloned to
ta: புதிய துணைதொகுதி நகலி செய்யப்படும்

source: name of the new submodule
ta: புதிய துணைதொகுதியின் பெயர்

source: url where to clone the submodule from
ta: முகவரி எங்கிருந்து துணைதொகுதியை நகலி செய்ய வேண்டும்

source: depth for shallow clones
ta: ஆழமற்ற குளோன்களுக்கான ஆழம்

source: force cloning progress
ta: குளோனிங் முன்னேற்றத்தை கட்டாயப்படுத்துங்கள்

source: disallow cloning into non-empty directory
ta: காலியாக இல்லாத கோப்பகத்தில் குளோனிங் செய்ய அனுமதிக்காதீர்கள்

source: git submodule--helper clone [--prefix=<path>] [--quiet] [--reference <repository>] [--name <name>] [--depth <depth>] [--single-branch] [--filter <filter-spec>] --url <url> --path <path>
ta: git submodule--helper clone [--prefix=<பாதை>] [--quiet] [--reference <களஞ்சியம்>] [--name <பெயர்>] [--depth <ஆழம்>] [--single-branch] [--filter <வடிப்பன்-குறி>] --url <முகவரி> --path <பாதை>

source: Invalid update mode '%s' configured for submodule path '%s'
ta: தவறான புதுப்பிப்பு பயன்முறை '%s' துணைதொகுதி பாதைக்கு கட்டமைக்கப்பட்டுள்ளது '%s'

source: Submodule path '%s' not initialized
ta: துணைதொகுதி பாதை '%s' துவக்கப்படவில்லை

source: Maybe you want to use 'update --init'?
ta: ஒருவேளை நீங்கள் 'update --init' பயன்படுத்த விரும்புகிறீர்களா?

source: Skipping unmerged submodule %s
ta: அவிழ்க்கப்படாத துணைதொகுதி %s ஐத் தவிர்ப்பது

source: Skipping submodule '%s'
ta: துணைதொகுதி '%s' தவிர்ப்பது

source: cannot clone submodule '%s' without a URL
ta: ஒரு முகவரி இல்லாமல் துணைதொகுதி '%s' நகலி செய்ய முடியாது

source: Failed to clone '%s'. Retry scheduled
ta: '%s' நகலி செய்யத் தவறிவிட்டது. திட்டமிடப்பட்ட மீண்டும் முயற்சிக்கவும்

source: Failed to clone '%s' a second time, aborting
ta: இரண்டாவது முறையாக '%s' நகலி செய்யத் தவறிவிட்டது, கருக்கலைப்பு

source: Unable to checkout '%s' in submodule path '%s'
ta: துணைதொகுதி பாதையில் '%s' ஐப் பார்க்க முடியவில்லை '%s'

source: Unable to rebase '%s' in submodule path '%s'
ta: துணைதொகுதி பாதையில் '%s' ஐ மீண்டும் எடுக்க முடியவில்லை '%s'

source: Unable to merge '%s' in submodule path '%s'
ta: துணைதொகுதி பாதையில் '%s' ஐ ஒன்றிணைக்க முடியவில்லை '%s'

source: Execution of '%s %s' failed in submodule path '%s'
ta: இயக்கம் தோல்வியுற்றது '%s %s' துணைதொகுதி பாதையில் '%s'

source: Submodule path '%s': checked out '%s'
ta: துணைதொகுதி பாதை '%s': '%s' என்பதை சரிபார்

source: Submodule path '%s': rebased into '%s'
ta: துணைதொகுதி பாதை '%s': '%s' ஆக மீண்டும் திருத்தப்பட்டது

source: Submodule path '%s': merged in '%s'
ta: துணைதொகுதி பாதை '%s': '%s' இல் இணைக்கப்பட்டுள்ளது

source: Submodule path '%s': '%s %s'
ta: துணைதொகுதி பாதை '%s': '%s%s'

source: Unable to fetch in submodule path '%s'; trying to directly fetch %s:
ta: துணைதொகுதி பாதையில் '%s' பெற முடியவில்லை; %s ஐ நேரடியாக பெற முயற்சிக்கிறது:

source: Fetched in submodule path '%s', but it did not contain %s. Direct fetching of that commit failed.
ta: துணைதொகுதி பாதையில் '%s' இல் பெறப்பட்டது, ஆனால் அதில் %s இல்லை. அந்த உறுதிப்பாட்டை நேரடியாகப் பெறுவது தோல்வியடைந்தது.

source: could not initialize submodule at path '%s'
ta: '%s' பாதையில் துணைதொகுதியை துவக்க முடியவில்லை

source: Submodule (%s) branch configured to inherit branch from superproject, but the superproject is not on any branch
ta: சூப்பர் புரோசெக்டில் இருந்து கிளையை மரபுரிமையாக வரையறுக்கப்பட்ட துணைதொகுதி(%s) கிளை, ஆனால் சூப்பர் புரோசெக்ட் எந்த கிளையிலும் இல்லை

source: Unable to find current revision in submodule path '%s'
ta: துணைதொகுதி பாதையில் '%s' இல் தற்போதைய திருத்தத்தைக் கண்டுபிடிக்க முடியவில்லை

source: Unable to fetch in submodule path '%s'
ta: துணைதொகுதி பாதையில் '%s' பெற முடியவில்லை

source: Unable to find %s revision in submodule path '%s'
ta: துணைதொகுதி பாதையில் '%s' இல் %s திருத்தத்தைக் கண்டுபிடிக்க முடியவில்லை

source: Failed to recurse into submodule path '%s'
ta: துணைதொகுதி பாதையில் '%s' இல் மீண்டும் வருவதில் தோல்வி

source: force checkout updates
ta: புதுப்பிப்பு புதுப்பிப்புகளை கட்டாயப்படுத்துங்கள்

source: initialize uninitialized submodules before update
ta: புதுப்பிப்புக்கு முன் ஆரம்பமற்ற துணைதொகுதிகளைத் தொடங்கவும்

source: use SHA-1 of submodule's remote tracking branch
ta: துணைதொகுதியின் தொலை டிராக்கிங் கிளையின் sha-1 ஐப் பயன்படுத்தவும்

source: traverse submodules recursively
ta: துணைதொகுதிகளை மீண்டும் மீண்டும் கடந்து செல்லுங்கள்

source: don't fetch new objects from the remote site
ta: தொலை தளத்திலிருந்து புதிய பொருட்களைப் பெற வேண்டாம்

source: use the 'checkout' update strategy (default)
ta: 'புதுப்பித்து' புதுப்பிப்பு மூலோபாயத்தைப் பயன்படுத்தவும் (இயல்புநிலை)

source: use the 'merge' update strategy
ta: 'ஒன்றிணைத்தல்' புதுப்பிப்பு மூலோபாயத்தைப் பயன்படுத்தவும்

source: use the 'rebase' update strategy
ta: 'மறுசீரமைப்பு' புதுப்பிப்பு மூலோபாயத்தைப் பயன்படுத்தவும்

source: create a shallow clone truncated to the specified number of revisions
ta: குறிப்பிட்ட எண்ணிக்கையிலான திருத்தங்களுக்கு துண்டிக்கப்பட்ட ஒரு ஆழமற்ற நகலியை உருவாக்கவும்

source: parallel jobs
ta: இணையான பணிகள்

source: whether the initial clone should follow the shallow recommendation
ta: ஆரம்ப நகலி ஆழமற்ற பரிந்துரையைப் பின்பற்ற வேண்டுமா

source: don't print cloning progress
ta: குளோனிங் முன்னேற்றத்தை அச்சிட வேண்டாம்

source: disallow cloning into non-empty directory, implies --init
ta: காலியாக இல்லாத கோப்பகத்திற்கு குளோனிங் செய்வதை அனுமதிக்காதீர்கள்,--init ஐக் குறிக்கிறது

source: git submodule [--quiet] update [--init [--filter=<filter-spec>]] [--remote] [-N|--no-fetch] [-f|--force] [--checkout|--merge|--rebase] [--[no-]recommend-shallow] [--reference <repository>] [--recursive] [--[no-]single-branch] [--] [<path>...]
ta: git submodule [--quiet] update [--init [--filter=<வடிப்பு-குறி>]] [--remote] [-N|--no-fetch] [-f|--force] [--checkout|--merge|--rebase] [--[no-]recommend-shallow] [--reference <களஞ்சியம்>] [--recursive] [--[no-]single-branch] [--] <பாதை>...]

source: Failed to resolve HEAD as a valid ref.
ta: தலையை செல்லுபடியாகும் ref ஆக தீர்க்கத் தவறிவிட்டது.

source: git submodule absorbgitdirs [<options>] [<path>...]
ta: git துணைதொகுதி உறிஞ்சுதல் [<விருப்பங்கள்>] [<athe> ...]

source: suppress output for setting url of a submodule
ta: ஒரு துணைதொகுதியின் முகவரி ஐ அமைப்பதற்கான வெளியீட்டை அடக்கவும்

source: git submodule set-url [--quiet] <path> <newurl>
ta: git submodule set-url [--quiet] <பாதை> <புதியமுகவரி>

source: set the default tracking branch to master
ta: இயல்புநிலை கண்காணிப்பு கிளையை மாச்டர் என அமைக்கவும்

source: set the default tracking branch
ta: இயல்புநிலை கண்காணிப்பு கிளையை அமைக்கவும்

source: git submodule set-branch [-q|--quiet] (-d|--default) <path>
ta: git submodule set-branch [-q|--quiet] (-d|--default) <பாதை>

source: git submodule set-branch [-q|--quiet] (-b|--branch) <branch> <path>
ta: git submodule set-branch [-q|--quiet] (-b|--branch) <கிளை> <பாதை>

source: --branch or --default required
ta: --branch அல்லது --default தேவை

source: print only error messages
ta: பிழை செய்திகளை மட்டும் அச்சிடுக

source: force creation
ta: படை உருவாக்கம்

source: show whether the branch would be created
ta: கிளை உருவாக்கப்படுமா என்பதைக் காட்டுங்கள்

source: git submodule--helper create-branch [-f|--force] [--create-reflog] [-q|--quiet] [-t|--track] [-n|--dry-run] <name> <start-oid> <start-name>
ta: git submodule--helper create-branch [-f |--force] [--create-reflog] [-q|--quiet] [-t|--track] [-n|--dry-run] <பெயர்> <தொடக்க-பழைய> <தொடக்க-பெயர்>

source: creating branch '%s'
ta: கிளையை உருவாக்குதல் '%s'

source: Adding existing repo at '%s' to the index
ta: ஏற்கனவே உள்ள ரெப்போவை '%s' இல் குறியீட்டில் சேர்ப்பது

source: '%s' already exists and is not a valid git repo
ta: '%s' ஏற்கனவே உள்ளது மற்றும் இது செல்லுபடியாகும் அறிவிலி ரெப்போ அல்ல
