Repository: Nizhal/git-ta-po
Catalog: po/*.po
Languages: ta

source: git replace [-f] --graft <commit> [<parent>...]
ta: git replace [-f] --graft <உறுதி> [<பெற்றோர்>...]

source: git replace -d <object>...
ta: git replace -d <பொருள்>...

source: git replace [--format=<format>] [-l [<pattern>]]
ta: git replace [--format=<வடிவம்>] [-l [<முறை>]]

source: invalid replace format '%s' valid formats are 'short', 'medium' and 'long'
ta: தவறான மாற்ற வடிவமைப்பை '%s' செல்லுபடியாகும் வடிவங்கள் 'குறுகிய', 'நடுத்தர' மற்றும் 'நீண்ட'

source: replace ref '%s' not found
ta: ரெஃப் '%s' கண்டுபிடிக்கப்படவில்லை

source: Deleted replace ref '%s'
ta: மாற்றியமைத்த ரெஃப் '%s'

source: '%s' is not a valid ref name
ta: '%s' என்பது சரியான ref பெயர் அல்ல

source: replace ref '%s' already exists
ta: ref '%s' ஐ மாற்றவும் ஏற்கனவே உள்ளது

source: Objects must be of the same type. '%s' points to a replaced object of type '%s' while '%s' points to a replacement object of type '%s'.
ta: பொருள்கள் ஒரே வகையாக இருக்க வேண்டும். '%s' வகை '%s' வகையின் மாற்றப்பட்ட பொருளை சுட்டிக்காட்டுகின்றன '%s' '%s' வகையின் மாற்று பொருளை சுட்டிக்காட்டுகிறது.

source: unable to open %s for writing
ta: எழுதுவதற்கு %s ஐ திறக்க முடியவில்லை

source: cat-file reported failure
ta: பூனை-கோப்பு தோல்வி என்று அறிவித்தது

source: unable to open %s for reading
ta: வாசிப்புக்கு %s ஐ திறக்க முடியவில்லை

source: unable to spawn mktree
ta: mktree ஐ உருவாக்க முடியவில்லை

source: unable to read from mktree
ta: mktree இலிருந்து படிக்க முடியவில்லை

source: mktree reported failure
ta: எம்.கே.டி.ஆர்.இ தோல்வி என்று அறிவித்தது

source: mktree did not return an object name
ta: mktree ஒரு பொருள் பெயரை திருப்பித் தரவில்லை

source: unable to fstat %s
ta: fstat %s க்கு முடியவில்லை

source: unable to write object to database
ta: தரவுத்தளத்தில் பொருளை எழுத முடியவில்லை

source: unable to get object type for %s
ta: %s க்கு பொருள் வகையைப் பெற முடியவில்லை

source: editing object file failed
ta: பொருள் கோப்பைத் திருத்துதல் தோல்வியடைந்தது

source: new object is the same as the old one: '%s'
ta: புதிய பொருள் பழையதைப் போன்றது: '%s'

source: could not parse %s as a commit
ta: %s ஐ ஒரு உறுதிப்பாடாக அலச முடியவில்லை

source: bad mergetag in commit '%s'
ta: '%s' உறுதிடில் மோசமான இணைப்பு

source: malformed mergetag in commit '%s'
ta: '%s' என்ற கம்யூன்டாக் தவறாக மெர்செட்டாக்

source: original commit '%s' contains mergetag '%s' that is discarded; use --edit instead of --graft
ta: அசல் உறுதி '%s' நிராகரிக்கப்பட்ட மெர்கெட்டாக் '%s' ஐக் கொண்டுள்ளது; --graft என்பதற்கு பதிலாக --edit ஐப் பயன்படுத்தவும்

source: the original commit '%s' has a gpg signature
ta: அசல் உறுதி '%s' ஒரு சிபிசி கையொப்பத்தைக் கொண்டுள்ளது

source: the signature will be removed in the replacement commit!
ta: மாற்று உறுதிப்பாட்டில் கையொப்பம் அகற்றப்படும்!

source: could not write replacement commit for: '%s'
ta: இதற்காக மாற்றாக எழுத முடியவில்லை: '%s'

source: graft for '%s' unnecessary
ta: '%s' தேவையற்றது

source: new commit is the same as the old one: '%s'
ta: புதிய உறுதி பழையதைப் போன்றது: '%s'

source: could not convert the following graft(s): %s
ta: பின்வரும் ஒட்டு (களை) மாற்ற முடியவில்லை: %s

source: list replace refs
ta: பட்டியல் மாற்றங்களை மாற்றவும்

source: delete replace refs
ta: refs ஐ மாற்றவும்

source: edit existing object
ta: இருக்கும் பொருளைத் திருத்தவும்

source: change a commit's parents
ta: ஒரு உறுதி பெற்றோரை மாற்றவும்

source: convert existing graft file
ta: இருக்கும் ஒட்டு கோப்பை மாற்றவும்

source: replace the ref if it exists
ta: ரெஃப் இருந்தால் அதை மாற்றவும்

source: do not pretty-print contents for --edit
ta: --edit கான pretty-print உள்ளடக்கங்கள் வேண்டாம்

source: use this format
ta: இந்த வடிவமைப்பைப் பயன்படுத்தவும்

source: --format cannot be used when not listing
ta: பட்டியலிடாதபோது --format ஐ பயன்படுத்த முடியாது

source: -f only makes sense when writing a replacement
ta: மாற்றத்தை எழுதும்போது மட்டுமே பொருளுள்ளதாக இருக்கும்

source: --raw only makes sense with --edit
ta: --raw --edit உடன் மட்டுமே பொருளுள்ளதாக இருக்கிறது

source: -d needs at least one argument
ta: -டிக்கு குறைந்தது ஒரு உரையாடல் தேவை

source: bad number of arguments
ta: மோசமான எண்ணிக்கை

source: -e needs exactly one argument
ta: -இ சரியாக ஒரு உரையாடல் தேவை

source: -g needs at least one argument
ta: -g க்கு குறைந்தது ஒரு உரையாடல் தேவை

source: --convert-graft-file takes no argument
ta: --convert-graft-file எந்த வாதத்தையும் எடுக்கவில்லை

source: only one pattern can be given with -l
ta: -l உடன் ஒரு முறை மட்டுமே கொடுக்க முடியும்

source: need some commits to replay
ta: மீண்டும் இயக்க சில உறுதிடுகள் தேவை

source: all positive revisions given must be references
ta: கொடுக்கப்பட்ட அனைத்து நேர்மறையான திருத்தங்களும் குறிப்புகளாக இருக்க வேண்டும்

source: argument to --advance must be a reference
ta: --advance ஒரு குறிப்பாக இருக்க வேண்டும்

source: cannot advance target with multiple sources because ordering would be ill-defined
ta: பல ஆதாரங்களுடன் இலக்கை முன்னேற்ற முடியாது, ஏனெனில் வரிசைப்படுத்துவது மோசமாக வரையறுக்கப்படும்

source: cannot implicitly determine whether this is an --advance or --onto operation
ta: இது ஒரு --advance அல்லது --onto செயல்பாடா என்பதை மறைமுகமாக தீர்மானிக்க முடியாது

source: cannot advance target with multiple source branches because ordering would be ill-defined
ta: பல மூல கிளைகளுடன் இலக்கை முன்னேற்ற முடியாது, ஏனெனில் வரிசைப்படுத்துவது மோசமாக வரையறுக்கப்படும்

source: cannot implicitly determine correct base for --onto
ta: --onto க்கான சரியான தளத்தை மறைமுகமாக தீர்மானிக்க முடியாது

source: make replay advance given branch
ta: கொடுக்கப்பட்ட கிளையை மீண்டும் முன்கூட்டியே செய்யுங்கள்

source: replay onto given commit
ta: கொடுக்கப்பட்ட உறுதிப்பாட்டில் மீண்டும் இயக்கவும்

source: advance all branches contained in revision-range
ta: திருத்தம்-வரம்பில் உள்ள அனைத்து கிளைகளையும் அட்வான்

source: option --onto or --advance is mandatory
ta: விருப்பம் --onto அல்லது --advance கட்டாயமாகும்

source: some rev walking options will be overridden as '%s' bit in 'struct rev_info' will be forced
ta: 'struct rev_info' இல் '%s' இருமம் கட்டாயப்படுத்தப்படும் என்பதால் சில ரெவ் நடைபயிற்சி விருப்பங்கள் மீறப்படும்

source: error preparing revisions
ta: திருத்தங்களைத் தயாரிப்பதில் பிழை

source: replaying down to root commit is not supported yet!
ta: வேர் உறுதிடத்திற்கு மீண்டும் இயக்குவது இன்னும் ஆதரிக்கப்படவில்லை!

source: replaying merge commits is not supported yet!
ta: ஒன்றிணைப்பு உறுதிடுகளை மீண்டும் இயக்குவது இன்னும் ஆதரிக்கப்படவில்லை!

source: git rerere [clear | forget <pathspec>... | diff | status | remaining | gc]
ta: git reare [தெளிவான | <adadspec> ஐ மறந்து விடுங்கள் ... | வேறுபாடு | நிலை | மீதமுள்ள | சி.சி]

source: register clean resolutions in index
ta: குறியீட்டில் தூய்மையான தீர்மானங்களை பதிவு செய்யுங்கள்

source: 'git rerere forget' without paths is deprecated
ta: பாதைகள் இல்லாமல் 'அறிவிலி மீண்டும் மறந்துவிடுங்கள்' நீக்கப்பட்டது

source: unable to generate diff for '%s'
ta: '%s' க்கு வேறுபாட்டை உருவாக்க முடியவில்லை

source: git reset [--mixed | --soft | --hard | --merge | --keep] [-q] [<commit>]
ta: git reset [--mixed | --soft | --hard | --merge | --keep] [-q] [<உறுதி>]

source: git reset [-q] [<tree-ish>] [--] <pathspec>...
ta: git reset [-q] [<மரமாக>] [-] <பாதைகுறி>...

source: git reset [-q] [--pathspec-from-file [--pathspec-file-nul]] [<tree-ish>]
ta: git reset [-q] [--pathspec-from-file [--pathspec-file-nul]] [<மரமாக>]

source: git reset --patch [<tree-ish>] [--] [<pathspec>...]
ta: git reset --patch [<மரமாக>] [--] [<பாதைகுறி>...]

source: mixed
ta: கலப்பு

source: soft
ta: மென்மையான

source: hard
ta: கடினமானது

source: merge
ta: ஒன்றிணைக்கவும்

source: keep
ta: வை

source: You do not have a valid HEAD.
ta: உங்களிடம் சரியான தலை இல்லை.

source: Failed to find tree of HEAD.
ta: தலையின் மரத்தைக் கண்டுபிடிக்கத் தவறிவிட்டது.

source: Failed to find tree of %s.
ta: %s மரத்தைக் கண்டுபிடிக்கத் தவறிவிட்டது.

source: HEAD is now at %s
ta: தலை இப்போது %s இல் உள்ளது

source: Cannot do a %s reset in the middle of a merge.
ta: ஒன்றிணைப்பின் நடுவில் ஒரு %s மீட்டமைப்பை செய்ய முடியாது.

source: be quiet, only report errors
ta: அமைதியாக இருங்கள், பிழைகளை மட்டுமே புகாரளிக்கவும்

source: skip refreshing the index after reset
ta: மீட்டமைக்கப்பட்ட பிறகு குறியீட்டை புத்துணர்ச்சியைத் தவிர்க்கவும்

source: reset HEAD and index
ta: தலை மற்றும் குறியீட்டை மீட்டமைக்கவும்

source: reset only HEAD
ta: தலையை மட்டுமே மீட்டமைக்கவும்

source: reset HEAD, index and working tree
ta: தலை, குறியீட்டு மற்றும் பணி மரத்தை மீட்டமைக்கவும்

source: reset HEAD but keep local changes
ta: தலையை மீட்டமைக்கவும், ஆனால் உள்ளக மாற்றங்களை வைத்திருங்கள்

source: record only the fact that removed paths will be added later
ta: அகற்றப்பட்ட பாதைகள் பின்னர் சேர்க்கப்படும் என்ற உண்மையை மட்டுமே பதிவுசெய்க

source: Failed to resolve '%s' as a valid revision.
ta: சரியான திருத்தமாக '%s' தீர்க்கத் தவறிவிட்டது.

source: Failed to resolve '%s' as a valid tree.
ta: செல்லுபடியாகும் மரமாக '%s' தீர்க்கத் தவறிவிட்டது.

source: --mixed with paths is deprecated; use 'git reset -- <paths>' instead.
ta: பாதைகளுடன் --mixed அதரிக்கபடவில்லை; அதற்கு பதிலாக 'git reset - <பாதைகள்>' ஐப் பயன்படுத்தவும்.

source: Cannot do %s reset with paths.
ta: பாதைகளுடன் %s மீட்டமைப்பைச் செய்ய முடியாது.

source: %s reset is not allowed in a bare repository
ta: %s மீட்டமைப்பு வெற்று களஞ்சியத்தில் அனுமதிக்கப்படவில்லை

source: Unstaged changes after reset:
ta: மீட்டமைக்கப்பட்ட பிறகு நிலையற்ற மாற்றங்கள்:

source: It took %.2f seconds to refresh the index after reset. You can use '--no-refresh' to avoid this.
ta: மீட்டமைக்கப்பட்ட பிறகு குறியீட்டைப் புதுப்பிக்க %.2f வினாடிகள் ஆனது. நீங்கள் பயன்படுத்தலாம் இதைத் தவிர்க்க '--no-refresh'.

source: Could not reset index file to revision '%s'.
ta: குறியீட்டு கோப்பை '%s' திருத்துவதற்கு மீட்டமைக்க முடியவில்லை.

source: Could not write new index file.
ta: புதிய குறியீட்டு கோப்பை எழுத முடியவில்லை.

source: unable to get disk usage of %s
ta: %s வட்டு பயன்பாட்டைப் பெற முடியவில்லை

source: invalid value for '%s': '%s', the only allowed format is '%s'
ta: '%s': '%s' க்கான தவறான மதிப்பு, அனுமதிக்கப்பட்ட ஒரே வடிவம் '%s'

source: rev-list does not support display of notes
ta: ரெவ்-பட்டியல் குறிப்புகளின் காட்சியை ஆதரிக்கவில்லை

source: marked counting and '%s' cannot be used together
ta: குறிக்கப்பட்ட எண்ணிக்கை மற்றும் '%s' ஒன்றாகப் பயன்படுத்த முடியாது

source: git rev-parse --parseopt [<options>] -- [<args>...]
ta: git rev-parse --parseopt [<விருப்பங்கள்>]-[<args> ...]

source: keep the `--` passed as an arg
ta: `--` ஐ ஒரு ஆர்க் என கடந்து செல்லுங்கள்

source: stop parsing after the first non-option argument
ta: முதல் விருப்பமற்ற வாதத்திற்குப் பிறகு பாகுபடுத்துவதை நிறுத்துங்கள்

source: output in stuck long form
ta: சிக்கிய நீண்ட வடிவத்தில் வெளியீடு

source: premature end of input
ta: உள்ளீட்டின் முன்கூட்டிய முடிவு

source: no usage string given before the `--' separator
ta: `-'பிரிப்பதற்கு முன் பயன்பாட்டு சரம் எதுவும் கொடுக்கப்படவில்லை

source: missing opt-spec before option flags
ta: விருப்பக் கொடிகளுக்கு முன் opt-spec ஐக் காணவில்லை

source: Needed a single revision
ta: ஒரு திருத்தம் தேவை

source: git rev-parse --parseopt [<options>] -- [<args>...] or: git rev-parse --sq-quote [<arg>...] or: git rev-parse [<options>] [<arg>...] Run "git rev-parse --parseopt -h" for more information on the first usage.
ta: git rev-parse --parseopt [<விருப்பங்கள்>]-[<args> ...] அல்லது: git rev-parse--sq- மேற்கோள் [<arg> ...] அல்லது: git rev-parse [<விருப்பங்கள்>] [<arg> ...] முதல் பயன்பாடு குறித்த கூடுதல் தகவலுக்கு "git rev-parse --parseopt -h" ஐ இயக்கவும்.

source: --resolve-git-dir requires an argument
ta: --resolve-git-dir க்கு ஒரு உரையாடல் தேவை

source: not a gitdir '%s'
ta: ஒரு கிடிர் '%s' அல்ல

source: --git-path requires an argument
ta: --git-path க்கு ஒரு உரையாடல் தேவை

source: -n requires an argument
ta: -n ஒரு உரையாடல் தேவை

source: --path-format requires an argument
ta: --path-format இதற்கு ஒரு உரையாடல் தேவை

source: unknown argument to --path-format: %s
ta: அறியப்படாத வாதம் --path-format: %s

source: --default requires an argument
ta: --default க்கு ஒரு உரையாடல் தேவை

source: --prefix requires an argument
ta: --prefix ஒரு உரையாடல் தேவை

source: unknown mode for --abbrev-ref: %s
ta: --abbrev-ref க்கான அறியப்படாத பயன்முறை: %s

source: this operation must be run in a work tree
ta: இந்த செயல்பாடு ஒரு பணி மரத்தில் இயக்கப்பட வேண்டும்

source: Could not read the index
ta: குறியீட்டைப் படிக்க முடியவில்லை

source: unknown mode for --show-object-format: %s
ta: --show-object-format இதற்கான அறியப்படாத பயன்முறை: %s

source: git revert [--[no-]edit] [-n] [-m <parent-number>] [-s] [-S[<keyid>]] <commit>...
ta: git revert [-[இல்லை-] திருத்து] [-n] [-m <பெற்றோர்-எண்>] [-s] [-s [<keyid>]] < உறுதி> ...

source: git cherry-pick [--edit] [-n] [-m <parent-number>] [-s] [-x] [--ff] [-S[<keyid>]] <commit>...
ta: git cherry-pick [--edit] [-n] [-m <பெற்றோர்-எண்>] [-s] [-x] [--ff] [-S[<keyid>]] <உறுதி>...

source: option `%s' expects a number greater than zero
ta: விருப்பம் `%s 'பூச்சியத்தை விட அதிகமான எண்ணை எதிர்பார்க்கிறது

source: %s: %s cannot be used with %s
ta: %s: %s %s உடன் பயன்படுத்த முடியாது

source: end revert or cherry-pick sequence
ta: முடிவு மாற்றியமைத்தல் அல்லது செர்ரி-பிக் வரிசை

source: resume revert or cherry-pick sequence
ta: மறுவிற்பனை அல்லது செர்ரி-பிக் வரிசையை மீண்டும் தொடங்குங்கள்

source: cancel revert or cherry-pick sequence
ta: தலைகீழ் அல்லது செர்ரி-பிக் வரிசையை ரத்துசெய்

source: skip current commit and continue
ta: தற்போதைய உறுதிப்பாட்டைத் தவிர்த்து தொடரவும்

source: don't automatically commit
ta: தானாகவே செய்ய வேண்டாம்

source: edit the commit message
ta: உறுதி செய்தியைத் திருத்தவும்

source: parent-number
ta: பெற்றோர்-எண்

source: select mainline parent
ta: மெயின்லைன் பெற்றோரைத் தேர்ந்தெடுக்கவும்

source: merge strategy
ta: மூலோபாயத்தை ஒன்றிணைக்கவும்

source: option for merge strategy
ta: ஒன்றிணைக்கும் மூலோபாயத்திற்கான விருப்பம்

source: append commit name
ta: உறுதி பெயரைச் சேர்க்கவும்

source: preserve initially empty commits
ta: ஆரம்பத்தில் வெற்று உறுதிடுகளைப் பாதுகாக்கவும்

source: allow commits with empty messages
ta: வெற்று செய்திகளுடன் உறுதிடுகளை அனுமதிக்கவும்

source: use the 'reference' format to refer to commits
ta: உறுதிசைக் குறிக்க 'குறிப்பு' வடிவமைப்பைப் பயன்படுத்தவும்

source: revert failed
ta: மாற்றியமைத்தது தோல்வியடைந்தது

source: cherry-pick failed
ta: செர்ரி-பிக் தோல்வியுற்றது

source: git rm [-f | --force] [-n] [-r] [--cached] [--ignore-unmatch] [--quiet] [--pathspec-from-file=<file> [--pathspec-file-nul]] [--] [<pathspec>...]
ta: git rm [-f | --force] [-n] [-r] [--cached] [--ignore-unmatch] [--quiet] [--pathspec-from-file=<கோப்பு> [--pathspec-file-nul]] [--] [<பாதைகுறி>...]

source: the following file has staged content different from both the file and the HEAD:
ta: பின்வரும் கோப்பு இரண்டிலிருந்தும் வேறுபட்ட உள்ளடக்கத்தை அரங்கேற்றியுள்ளது கோப்பு மற்றும் தலை:

source: (use -f to force removal)
ta: (அகற்றுவதற்கு கட்டாயப்படுத்த -f ஐப் பயன்படுத்தவும்)

source: the following file has changes staged in the index:
ta: பின்வரும் கோப்பில் குறியீட்டில் மாற்றங்கள் உள்ளன:

source: (use --cached to keep the file, or -f to force removal)
ta: (use --cached பெறுநர் keep the file, or -f பெறுநர் force removal)

source: the following file has local modifications:
ta: பின்வரும் கோப்பில் உள்ளக மாற்றங்கள் உள்ளன:

source: do not list removed files
ta: அகற்றப்பட்ட கோப்புகளை பட்டியலிட வேண்டாம்

source: only remove from the index
ta: குறியீட்டிலிருந்து மட்டுமே அகற்று

source: override the up-to-date check
ta: புதுப்பித்த காசோலையை மேலெழுதவும்

source: allow recursive removal
ta: சுழல்நிலை அகற்ற அனுமதிக்கவும்

source: exit with a zero status even if nothing matched
ta: எதுவும் பொருந்தவில்லை என்றாலும் சுழிய நிலையுடன் வெளியேறவும்

source: No pathspec was given. Which files should I remove?
ta: பாதைகுறிப்பு எதுவும் வழங்கப்படவில்லை. நான் எந்த கோப்புகளை அகற்ற வேண்டும்?

source: please stage your changes to .gitmodules or stash them to proceed
ta: தயவுசெய்து உங்கள் மாற்றங்களை .gitmodules க்கு அரங்கேற்றவும் அல்லது தொடரவும்

source: not removing '%s' recursively without -r
ta: -r இல்லாமல் '%s' ஐ மீண்டும் மீண்டும் அகற்றவில்லை

source: git rm: unable to remove %s
ta: அறிவிலி ஆர்.எம்: %s ஐ அகற்ற முடியவில்லை

source: git send-pack [--mirror] [--dry-run] [--force] [--receive-pack=<git-receive-pack>] [--verbose] [--thin] [--atomic] [--[no-]signed | --signed=(true|false|if-asked)] [<host>:]<directory> (--all | <ref>...)
ta: git send-pack [--mirror] [--dry-run] [--force] [--receive-pack=<git-receive-pack>] [--verbose] [--thin] [--atomic] [--[no-]signed | --signed=(true|false|if-asked)] [<புரவலன்>:]<அடைவு> (--all | <குறி>...)

source: remote name
ta: தொலை பெயர்

source: push all refs
ta: அனைத்து குறிப்புகளையும் தள்ளுங்கள்

source: use stateless RPC protocol
ta: நிலையற்ற rpc நெறிமுறையைப் பயன்படுத்தவும்

source: read refs from stdin
ta: stdin இலிருந்து refs ஐப் படியுங்கள்

source: print status from remote helper
ta: தொலை உதவியாளரிடமிருந்து நிலையை அச்சிடுக

source: git shortlog [<options>] [<revision-range>] [[--] <path>...]
ta: git shortlog [<விருப்பங்கள்>] [<திருத்தம்-வரம்பு>] [[-] <பாதை>...]

source: git log --pretty=short | git shortlog [<options>]
ta: git log --pretty=short | git shortlog [<விருப்பங்கள்>]

source: using multiple --group options with stdin is not supported
ta: stdin உடன் பல --group விருப்பங்களைப் பயன்படுத்துவது ஆதரிக்கப்படவில்லை

source: using %s with stdin is not supported
ta: stdin உடன் %s ஐப் பயன்படுத்துவது ஆதரிக்கப்படவில்லை

source: unknown group type: %s
ta: தெரியாத குழு வகை: %s

source: group by committer rather than author
ta: ஆசிரியரைக் காட்டிலும் கமிசர் மூலம் குழு

source: sort output according to the number of commits per author
ta: ஒரு எழுத்தாளரின் உறுதிடுகளின் எண்ணிக்கைக்கு ஏற்ப வெளியீட்டை வரிசைப்படுத்தவும்

source: suppress commit descriptions, only provides commit count
ta: உறுதி விளக்கங்களை அடக்கவும், உறுதிப்பாட்டை மட்டுமே வழங்குகிறது

source: show the email address of each author
ta: ஒவ்வொரு எழுத்தாளரின் மின்னஞ்சல் முகவரியைக் காட்டு

source: linewrap output
ta: லைன் வேப் வெளியீடு

source: field
ta: புலம்

source: group by field
ta: புலம் மூலம் குழு

source: too many arguments given outside repository
ta: களஞ்சியத்திற்கு வெளியே பல வாதங்கள் கொடுக்கப்பட்டுள்ளன

source: git show-branch [-a | --all] [-r | --remotes] [--topo-order | --date-order] [--current] [--color[=<when>] | --no-color] [--sparse] [--more=<n> | --list | --independent | --merge-base] [--no-name | --sha1-name] [--topics] [(<rev> | <glob>)...]
ta: git show-branch [-a | --all] [-r | --remotes] [--topo-order | --date-order] [--current] [--color[=<when>] | --no-color] [--sparse] [--more=<n> | --list | --independent | --merge-base] [--no-name | --sha1-name] [--topics] [(<பதி> | <உலக>)...]

source: git show-branch (-g | --reflog)[=<n>[,<base>]] [--list] [<ref>]
ta: git show-branch (-g | --reflog) [= <எ> [, <அடி>]] [--list] [<குறி>]

source: ignoring %s; cannot handle more than %d ref
ta: %s புறக்கணித்தல்; %d ref ஐ விட அதிகமாக கையாள முடியாது

source: no matching refs with %s
ta: %s உடன் பொருந்தக்கூடிய குறிப்புகள் இல்லை

source: show remote-tracking and local branches
ta: தொலைநிலை கண்காணிப்பு மற்றும் உள்ளக கிளைகளைக் காட்டு

source: show remote-tracking branches
ta: தொலைநிலை கண்காணிப்பு கிளைகளைக் காட்டு

source: color '*!+-' corresponding to the branch
ta: வண்ணம் '*!+-' கிளைக்கு ஒத்திருக்கிறது

source: show <n> more commits after the common ancestor
ta: <n> பொதுவான மூதாதையருக்குப் பிறகு மேலும் உறுதிசைக் காட்டு

source: synonym to more=-1
ta: மேலும் = -1 க்கு ஒத்த பெயர்

source: suppress naming strings
ta: பெயரிடும் சரங்களை அடக்கவும்

source: include the current branch
ta: தற்போதைய கிளையைச் சேர்க்கவும்

source: name commits with their object names
ta: பெயர் அவர்களின் பொருள் பெயர்களுடன் ஈடுபடுகிறது

source: show possible merge bases
ta: சாத்தியமான ஒன்றிணைப்பு தளங்களைக் காட்டு

source: show refs unreachable from any other ref
ta: வேறு எந்த குறிப்பிலிருந்தும் அணுக முடியாத குறிப்புகளைக் காட்டு

source: show commits in topological order
ta: இடவியல் வரிசையில் உறுதிடைக் காட்டு

source: show only commits not on the first branch
ta: முதல் கிளையில் அல்ல

source: show merges reachable from only one tip
ta: ஒரே ஒரு உதவிக்குறிப்பிலிருந்து அடையக்கூடிய ஒன்றிணைவுகளைக் காட்டு

source: topologically sort, maintaining date order where possible
ta: இடவியல் ரீதியாக வரிசைப்படுத்துதல், முடிந்தவரை தேதி வரிசையை பராமரித்தல்

source: show <n> most recent ref-log entries starting at base
ta: <n> மிக அண்மைக் கால ref-பதிவு உள்ளீடுகளை அடிவாரத்தில் தொடங்குகிறது

source: no branches given, and HEAD is not valid
ta: எந்த கிளைகளும் கொடுக்கப்படவில்லை, மற்றும் தலை செல்லுபடியாகாது

source: --reflog option needs one branch name
ta: --reflog விருப்பத்திற்கு ஒரு கிளை பெயர் தேவை

source: only %d entry can be shown at one time.
ta: ஒரு நேரத்தில் %d நுழைவு மட்டுமே காட்ட முடியும்.

source: no such ref %s
ta: அத்தகைய ref %s இல்லை

source: cannot handle more than %d rev.
ta: %d rev ஐ விட அதிகமாக கையாள முடியாது.

source: '%s' is not a valid ref.
ta: '%s' சரியான குறிப்பு அல்ல.

source: cannot find commit %s (%s)
ta: உறுதி %s ( %s) கண்டுபிடிக்க முடியவில்லை

source: hash-algorithm
ta: ஆச்-அல்காரிதம்

source: Unknown hash algorithm
ta: தெரியாத ஆச் வழிமுறை

source: git show-ref --verify [-q | --quiet] [-d | --dereference] [-s | --hash[=<n>]] [--abbrev[=<n>]] [--] [<ref>...]
ta: git show-ref --verify [-q | --quiet] [-d | -குறிப்பு] [-s | --ஆச் [= <n>]] [--abbrev [= <n>]] [-] [<eff> ...]

source: git show-ref --exclude-existing[=<pattern>]
ta: git show-ref --exclude-existing[=<முறை>]

source: git show-ref --exists <ref>
ta: git show-ref --exists <குறி>

source: reference does not exist
ta: குறிப்பு இல்லை

source: failed to look up reference
ta: குறிப்பைப் பார்க்கத் தவறிவிட்டது

source: check for reference existence without resolving
ta: தீர்க்காமல் குறிப்பு இருப்பை சரிபார்

source: stricter reference checking, requires exact ref path
ta: கடுமையான குறிப்பு சோதனை, சரியான ref பாதை தேவை

source: show the HEAD reference, even if it would be filtered out
ta: தலை குறிப்பைக் காட்டுங்கள், அது வடிகட்டப்பட்டாலும் கூட

source: dereference tags into object IDs
ta: பொருள் ஐடிகளில் குறிச்சொற்கள்

source: only show SHA1 hash using <n> digits
ta: <n> இலக்கங்களைப் பயன்படுத்தி சா 1 ஆசை மட்டுமே காண்பி

source: do not print results to stdout (useful with --verify)
ta: முடிவுகளை stdout க்கு அச்சிட வேண்டாம் (--verify பயனுள்ளதாக இருக்கும்)

source: show refs from stdin that aren't in local repository
ta: உள்ளக களஞ்சியத்தில் இல்லாத stdin இலிருந்து குறிப்புகளைக் காட்டு

source: git sparse-checkout (init | list | set | add | reapply | disable | check-rules) [<options>]
ta: git sparse-checkout (init | பட்டியல் | கணம் | கூட்டு | repply | முடக்கு | செக்-விதிமுறைகள்) [<விருப்பங்கள்>]

source: this worktree is not sparse
ta: இந்த பணிப்பறை குறைவாக இல்லை

source: this worktree is not sparse (sparse-checkout file may not exist)
ta: இந்த பணியிடங்கள் அரிதானவை அல்ல (sparse-checkout கோப்பு இருக்காது)

source: directory '%s' contains untracked files, but is not in the sparse-checkout cone
ta: அடைவு '%s' கட்டுப்படுத்தப்படாத கோப்புகளைக் கொண்டுள்ளது, ஆனால் அது சிதறிய-சோதனை கூம்பில் இல்லை

source: failed to remove directory '%s'
ta: '%s' கோப்பகத்தை அகற்றுவதில் தோல்வி

source: failed to create directory for sparse-checkout file
ta: சிதறிய-சோதனை கோப்பிற்கான கோப்பகத்தை உருவாக்குவதில் தோல்வி

source: failed to initialize worktree config
ta: பணியிட கட்டமைப்பைத் தொடங்குவதில் தோல்வி

source: failed to modify sparse-index config
ta: சிதறிய-குறியீட்டு கட்டமைப்பை மாற்றத் தவறிவிட்டது

source: initialize the sparse-checkout in cone mode
ta: கூம்பு பயன்முறையில் சிதறிய-சரிபார்ப்பைத் தொடங்கவும்

source: toggle the use of a sparse index
ta: ஒரு சிதறிய குறியீட்டின் பயன்பாட்டை மாற்றவும்

source: unable to create leading directories of %s
ta: %s இன் முன்னணி கோப்பகங்களை உருவாக்க முடியவில்லை

source: failed to open '%s'
ta: '%s' திறக்கத் தவறிவிட்டது

source: could not normalize path %s
ta: பாதை %s ஐ இயல்பாக்க முடியவில்லை

source: unable to unquote C-style string '%s'
ta: சி-பாணி சரம் '%s' ஐ அறிய முடியவில்லை
