Repository: Nizhal/git-ta-po
Catalog: po/*.po
Languages: ta

source: failed to locate object %d in packfile
ta: பேக்ஃபைலில் பொருள் %d ஐக் கண்டுபிடிப்பதில் தோல்வி

source: cannot store reverse index file
ta: தலைகீழ் குறியீட்டு கோப்பை சேமிக்க முடியாது

source: could not parse line: %s
ta: வரியை அலச முடியவில்லை: %s

source: malformed line: %s
ta: தவறாக வரி: %s

source: could not load pack
ta: கட்டு ஏற்ற முடியவில்லை

source: could not open index for %s
ta: %s க்கு குறியீட்டை திறக்க முடியவில்லை

source: failed to clear multi-pack-index at %s
ta: %s இல் மல்டி-கட்டு-இன்டெக்சை அழிக்கத் தவறிவிட்டது

source: ignoring existing multi-pack-index; checksum mismatch
ta: தற்போதுள்ள மல்டி-கட்டு-இன்டெக்சை புறக்கணித்தல்; செக்சம் பொருந்தாத தன்மை

source: Adding packfiles to multi-pack-index
ta: மல்டி-கட்டு-இன்டெக்சில் பேக்ஃபைல்களைச் சேர்ப்பது

source: unknown preferred pack: '%s'
ta: அறியப்படாத விருப்பமான கட்டு: '%s'

source: cannot select preferred pack %s with no objects
ta: எந்தவொரு பொருளும் இல்லாத விருப்பமான கட்டு %s ஐத் தேர்ந்தெடுக்க முடியாது

source: did not see pack-file %s to drop
ta: கைவிட கட்டு-ஃபைல் %s பார்க்கவில்லை

source: preferred pack '%s' is expired
ta: விருப்பமான கட்டு '%s' காலாவதியாகிறது

source: no pack files to index.
ta: குறியீட்டுக்கு கட்டு கோப்புகள் இல்லை.

source: refusing to write multi-pack .bitmap without any objects
ta: எந்தவொரு பொருளும் இல்லாமல் மல்டி கட்டு .பிட்மேப் எழுத மறுக்கிறது

source: could not write multi-pack bitmap
ta: மல்டி கட்டு பிட்மேப் எழுத முடியவில்லை

source: could not write multi-pack-index
ta: மல்டி-கட்டு-இன்டெக்ச் எழுத முடியவில்லை

source: Counting referenced objects
ta: குறிப்பிடப்பட்ட பொருள்களை எண்ணுதல்

source: Finding and deleting unreferenced packfiles
ta: குறிப்பிடப்படாத பேக்ஃபைல்களைக் கண்டுபிடித்து நீக்குதல்

source: could not start pack-objects
ta: கட்டு-பொருள்களைத் தொடங்க முடியவில்லை

source: could not finish pack-objects
ta: கட்டு-பொருள்களை முடிக்க முடியவில்லை

source: multi-pack-index OID fanout is of the wrong size
ta: மல்டி-கட்டு-இன்டெக்ச் oid fanout தவறான அளவைக் கொண்டுள்ளது

source: oid fanout out of order: fanout[%d] = %<PRIx32> > %<PRIx32> = fanout[%d]
ta: ஒஅஎ விசிறிவெளி இயங்கவில்லை: விசிறிவெளி [%d] = %<PRIx32> > %<PRIx32> = விசிறிவெளி[%d]

source: multi-pack-index OID lookup chunk is the wrong size
ta: மல்டி-கட்டு-இன்டெக்ச் oid தேடல் துண்டானது தவறான அளவு

source: multi-pack-index object offset chunk is the wrong size
ta: மல்டி-கட்டு-இன்டெக்ச் பொருள் ஆஃப்செட் துண்டானது தவறான அளவு

source: multi-pack-index file %s is too small
ta: மல்டி-கட்டு-இன்டெக்ச் கோப்பு %s மிகவும் சிறியது

source: multi-pack-index signature 0x%08x does not match signature 0x%08x
ta: மல்டி-கட்டு-இன்டெக்ச் கையொப்பம் 0x%08x கையொப்பத்துடன் பொருந்தவில்லை 0x%08x

source: multi-pack-index version %d not recognized
ta: மல்டி-கட்டு-இன்டெக்ச் பதிப்பு %d அங்கீகரிக்கப்படவில்லை

source: multi-pack-index hash version %u does not match version %u
ta: மல்டி-கட்டு-இன்டெக்ச் ஆச் பதிப்பு %u பதிப்பு %u உடன் பொருந்தவில்லை

source: multi-pack-index required pack-name chunk missing or corrupted
ta: மல்டி-கட்டு-இன்டெக்ச் தேவை கட்டு-பெயர் துண்டுகள் காணவில்லை அல்லது சிதைந்தன

source: multi-pack-index required OID fanout chunk missing or corrupted
ta: மல்டி-கட்டு-இன்டெக்ச் தேவை oid fanout துண்டுக் காணவில்லை அல்லது சிதைந்தது

source: multi-pack-index required OID lookup chunk missing or corrupted
ta: மல்டி-கட்டு-இன்டெக்ச் தேவை oid தேடல் துண்டானது காணவில்லை அல்லது சிதைந்தது

source: multi-pack-index required object offsets chunk missing or corrupted
ta: மல்டி-கட்டு-இன்டெக்ச் தேவைப்படும் பொருள் ஆஃப்செட்டுகள் துண்டிக்கப்படவில்லை அல்லது சிதைந்தன

source: multi-pack-index pack-name chunk is too short
ta: மல்டி-கட்டு-இன்டெக்ச் கட்டு-பெயர் துண்டானது மிகவும் குறுகியது

source: multi-pack-index pack names out of order: '%s' before '%s'
ta: மல்டி-கட்டு-இன்டெக்ச் கட்டு பெயர்கள் வரிசையில் இல்லை: '%s' முன் '%s'

source: bad pack-int-id: %u (%u total packs)
ta: மோசமான கட்டு-ஐச்ட்-அடையாளம்: %u ( %u மொத்த பொதிகள்)

source: MIDX does not contain the BTMP chunk
ta: midx இல் btmp துண்டுகள் இல்லை

source: could not load bitmapped pack %<PRIu32>
ta: பிட்மாப் செய்யப்பட்ட கட்டு %<PRIu32> ஐ ஏற்ற முடியவில்லை

source: multi-pack-index stores a 64-bit offset, but off_t is too small
ta: மல்டி-கட்டு-இன்டெக்ச் 64-இருமம் ஆஃப்செட்டை சேமிக்கிறது, ஆனால் off_t மிகவும் சிறியது

source: multi-pack-index large offset out of bounds
ta: மல்டி-கட்டு-இன்டெக்ச் பெரிய ஆஃப்செட் எல்லைக்கு வெளியே

source: multi-pack-index file exists, but failed to parse
ta: மல்டி-கட்டு-இன்டெக்ச் கோப்பு உள்ளது, ஆனால் அலசத் தவறியது

source: incorrect checksum
ta: தவறான செக்சம்

source: Looking for referenced packfiles
ta: குறிப்பிடப்பட்ட பேக்ஃபைல்களைத் தேடுகிறது

source: the midx contains no oid
ta: midx இல் oid இல்லை

source: Verifying OID order in multi-pack-index
ta: மல்டி-கட்டு-இன்டெக்சில் oid வரிசையை சரிபார்க்கிறது

source: oid lookup out of order: oid[%d] = %s >= %s = oid[%d]
ta: oid தேடல் வரிசையில்: oid [ %d] = %s> = %s = oid [ %d]

source: Sorting objects by packfile
ta: பொருட்களை பேக்ஃபைல் மூலம் வரிசைப்படுத்துதல்

source: Verifying object offsets
ta: பொருள் ஆஃப்செட்களை சரிபார்க்கிறது

source: failed to load pack entry for oid[%d] = %s
ta: oid [ %d] = %s க்கான கட்டு உள்ளீட்டை ஏற்றுவதில் தோல்வி

source: failed to load pack-index for packfile %s
ta: பேக்ஃபைல் %s க்கு கட்டு-இன்டெக்சை ஏற்றுவதில் தோல்வி

source: incorrect object offset for oid[%d] = %s: %<PRIx64> != %<PRIx64>
ta: oid க்கான தவறான பொருள் ஆஃப்செட் [ %d] = %s: %<PRIx64>! = %<PRIx64>

source: unable to create lazy_dir thread: %s
ta: lazy_dir நூலை உருவாக்க முடியவில்லை: %s

source: unable to create lazy_name thread: %s
ta: lazy_name நூலை உருவாக்க முடியவில்லை: %s

source: unable to join lazy_name thread: %s
ta: lazy_name நூலில் சேர முடியவில்லை: %s

source: You have not concluded your previous notes merge (%s exists). Please, use 'git notes merge --commit' or 'git notes merge --abort' to commit/abort the previous merge before you start a new notes merge.
ta: உங்கள் முந்தைய குறிப்புகள் ஒன்றிணைக்க நீங்கள் முடிவு செய்யவில்லை (%s உள்ளன). தயவுசெய்து, 'git notes merge --commit' அல்லது 'git notes merge --abort' நீங்கள் ஒரு புதிய குறிப்புகள் ஒன்றிணைவதைத் தொடங்குவதற்கு முன் முந்தைய ஒன்றிணைப்பைச் செய்ய/நிறுத்துங்கள்.

source: You have not concluded your notes merge (%s exists).
ta: உங்கள் குறிப்புகள் ஒன்றிணைக்க நீங்கள் முடிவு செய்யவில்லை (%s உள்ளன).

source: Cannot commit uninitialized/unreferenced notes tree
ta: சீரற்ற/குறிப்பிடப்படாத குறிப்புகள் மரத்தை செய்ய முடியாது

source: Bad notes.rewriteMode value: '%s'
ta: மோசமான notes.rewriteMode மதிப்பு: '%s'

source: Refusing to rewrite notes in %s (outside of refs/notes/)
ta: %s இல் குறிப்புகளை மீண்டும் எழுத மறுக்கிறது (refs/notes/ க்கு வெளியே)

source: Bad %s value: '%s'
ta: மோசமான %s மதிப்பு: '%s'

source: object file %s is empty
ta: பொருள் கோப்பு %s காலியாக உள்ளன

source: corrupt loose object '%s'
ta: ஊழல் தளர்வான பொருள் '%s'

source: garbage at end of loose object '%s'
ta: தளர்வான பொருளின் முடிவில் குப்பை '%s'

source: unable to open loose object %s
ta: தளர்வான பொருளைத் திறக்க முடியவில்லை %s

source: unable to parse %s header
ta: %s தலைப்பை அலச முடியவில்லை

source: invalid object type
ta: தவறான பொருள் வகை

source: unable to unpack %s header
ta: %s தலைப்பைத் திறக்க முடியவில்லை

source: header for %s too long, exceeds %d bytes
ta: %s மிக நீளத்திற்கான தலைப்பு, %d பைட்டுகளை மீறுகிறது

source: loose object %s (stored in %s) is corrupt
ta: தளர்வான பொருள் %s ( %s இல் சேமிக்கப்படுகிறது) ஊழல் நிறைந்ததாகும்

source: unable to open %s
ta: %s ஐ திறக்க முடியவில்லை

source: unable to write file %s
ta: கோப்பு %s ஐ எழுத முடியவில்லை

source: unable to set permission to '%s'
ta: '%s' க்கு இசைவு அமைக்க முடியவில்லை

source: error when closing loose object file
ta: தளர்வான பொருள் கோப்பை மூடும்போது பிழை

source: insufficient permission for adding an object to repository database %s
ta: களஞ்சிய தரவுத்தளத்தில் ஒரு பொருளைச் சேர்ப்பதற்கு போதுமான இசைவு %s

source: unable to create temporary file
ta: தற்காலிக கோப்பை உருவாக்க முடியவில்லை

source: unable to write loose object file
ta: தளர்வான பொருள் கோப்பை எழுத முடியவில்லை

source: unable to deflate new object %s (%d)
ta: புதிய பொருளை நீக்க முடியவில்லை %s ( %d)

source: deflateEnd on object %s failed (%d)
ta: பொருள் %s தோல்வியுற்றது ( %d)

source: confused by unstable object source data for %s
ta: %s க்கான நிலையற்ற பொருள் மூல தரவுகளால் குழப்பமடைகிறது

source: write stream object %ld != %<PRIuMAX>
ta: ச்ட்ரீம் பொருளை எழுதுங்கள் %ld! = %<PRIuMAX>

source: unable to stream deflate new object (%d)
ta: ச்ட்ரீம் செய்ய முடியவில்லை புதிய பொருளை (%d)

source: deflateEnd on stream object failed (%d)
ta: ச்ட்ரீம் பொருளில் deflateend தோல்வியுற்றது (%d)

source: unable to create directory %s
ta: அடைவு %s ஐ உருவாக்க முடியவில்லை

source: cannot read object for %s
ta: %s க்கு பொருளைப் படிக்க முடியாது

source: object fails fsck: %s
ta: பொருள் தோல்வியுற்றது fsck: %s

source: refusing to create malformed object
ta: தவறான பொருளை உருவாக்க மறுக்கிறது

source: read error while indexing %s
ta: %s ஐ குறியிடும்போது பிழையைப் படியுங்கள்

source: short read while indexing %s
ta: %s குறியீட்டு போது குறுகிய வாசிப்பு

source: %s: failed to insert into database
ta: %s: தரவுத்தளத்தில் செருகுவதில் தோல்வி

source: %s: unsupported file type
ta: %s: ஆதரிக்கப்படாத கோப்பு வகை

source: hash mismatch for %s (expected %s)
ta: %s (எதிர்பார்க்கப்படும் %s) க்கான ஆச் பொருந்தவில்லை

source: unable to mmap %s
ta: mmap %s க்கு முடியவில்லை

source: unable to unpack header of %s
ta: %s இன் தலையைத் திறக்க முடியவில்லை

source: unable to parse header of %s
ta: %s தலைப்பைக் அலச முடியவில்லை

source: unable to unpack contents of %s
ta: %s இன் உள்ளடக்கங்களைத் திறக்க முடியவில்லை

source: %s [bad object]
ta: %s [மோசமான பொருள்]

source: %s commit %s - %s
ta: %s உறுதி %s - %s

source: %s tag %s - %s
ta: %s குறிச்சொல் %s - %s

source: %s [bad tag, could not parse it]
ta: %s [மோசமான குறிச்சொல், அதை அலச முடியவில்லை]

source: %s tree
ta: %s மரம்

source: %s blob
ta: %s

source: short object ID %s is ambiguous
ta: குறுகிய பொருள் அடையாளம் %s தெளிவற்றவை

source: The candidates are: %s
ta: வேட்பாளர்கள்: %s

source: log for '%.*s' only goes back to %s
ta: ' %.*s' க்கு உள்நுழைகிறார். %s க்கு மட்டுமே செல்கிறது

source: log for '%.*s' only has %d entries
ta: ' %.*s' க்கு உள்நுழைக %d உள்ளீடுகள் மட்டுமே உள்ளன

source: path '%s' exists on disk, but not in '%.*s'
ta: பாதை '%s' வட்டில் உள்ளது, ஆனால் '%.*s' இல் இல்லை.

source: path '%s' exists, but not '%s' hint: Did you mean '%.*s:%s' aka '%.*s:./%s'?
ta: பாதை '%s' உள்ளது, ஆனால் '%s' அல்ல குறிப்பு: நீங்கள் '%.*s:%s' அகா '%.*s: ./% s' என்று பொருளா?

source: path '%s' does not exist in '%.*s'
ta: பாதை '%s' '%.*s' இல் இல்லை

source: path '%s' is in the index, but not at stage %d hint: Did you mean ':%d:%s'?
ta: பாதை '%s' குறியீட்டில் உள்ளது, ஆனால் கட்டத்தில் %d அல்ல குறிப்பு: நீங்கள் ':%d:%s' என்று சொன்னீர்களா?

source: path '%s' is in the index, but not '%s' hint: Did you mean ':%d:%s' aka ':%d:./%s'?
ta: பாதை '%s' குறியீட்டில் உள்ளது, ஆனால் '%s' அல்ல குறிப்பு: நீங்கள் ':%d:%s' அகா ':%d: ./% s' என்று சொன்னீர்களா?

source: path '%s' exists on disk, but not in the index
ta: பாதை '%s' வட்டில் உள்ளது, ஆனால் குறியீட்டில் இல்லை

source: path '%s' does not exist (neither on disk nor in the index)
ta: பாதை '%s' இல்லை (வட்டில் அல்லது குறியீட்டில் இல்லை)

source: relative path syntax can't be used outside working tree
ta: உறவினர் பாதை தொடரியல் பணி மரத்திற்கு வெளியே பயன்படுத்த முடியாது

source: <object>:<path> required, only <object> '%s' given
ta: <பொருள்>: <பாதை> தேவை, <பொருள்> '%s' கொடுக்கப்பட்டுள்ளது

source: invalid object name '%.*s'.
ta: தவறான பொருள் பெயர் '%.*s'.

source: object directory %s does not exist; check .git/objects/info/alternates
ta: பொருள் அடைவு %s இல்லை; சரிபார் .git/பொருள்கள்/தகவல்/மாற்று

source: unable to normalize alternate object path: %s
ta: மாற்று பொருள் பாதையை இயல்பாக்க முடியவில்லை: %s

source: %s: ignoring alternate object stores, nesting too deep
ta: %s: மாற்று பொருள் கடைகளை புறக்கணித்தல், மிக ஆழமான கூடு கட்டும்

source: unable to fdopen alternates lockfile
ta: fdopen ஐ மாற்ற முடியாது

source: unable to read alternates file
ta: மாற்று கோப்பைப் படிக்க முடியவில்லை

source: unable to move new alternates file into place
ta: புதிய மாற்று கோப்பை இடத்திற்கு நகர்த்த முடியவில்லை

source: path '%s' does not exist
ta: பாதை '%s' இல்லை

source: reference repository '%s' as a linked checkout is not supported yet.
ta: இணைக்கப்பட்ட புதுப்பித்தலாக '%s' குறிப்பு களஞ்சியம் இன்னும் ஆதரிக்கப்படவில்லை.

source: reference repository '%s' is not a local repository.
ta: குறிப்பு களஞ்சியம் '%s' என்பது உள்ளக களஞ்சியம் அல்ல.

source: reference repository '%s' is shallow
ta: குறிப்பு களஞ்சியம் '%s' ஆழமற்றது

source: reference repository '%s' is grafted
ta: குறிப்பு களஞ்சியம் '%s' ஒட்டப்படுகிறது

source: could not find object directory matching %s
ta: %s பொருந்தக்கூடிய பொருள் அடைவு கண்டுபிடிக்க முடியவில்லை

source: invalid line while parsing alternate refs: %s
ta: மாற்று குறிப்புகளை பாகுபடுத்தும்போது தவறான வரி: %s

source: replacement %s not found for %s
ta: மாற்று %s %s க்கு காணப்படவில்லை

source: packed object %s (stored in %s) is corrupt
ta: நிரம்பிய பொருள் %s ( %s இல் சேமிக்கப்படுகிறது) ஊழல் நிறைந்ததாகும்

source: %s is not a valid '%s' object
ta: %s செல்லுபடியாகும் '%s' பொருள் அல்ல

source: invalid object type "%s"
ta: தவறான பொருள் வகை "%s"

source: object %s is a %s, not a %s
ta: பொருள் %s என்பது ஒரு %s, ஒரு %s அல்ல

source: object %s has unknown type id %d
ta: பொருள் %s அறியப்படாத வகை அடையாளம் %d

source: unable to parse object: %s
ta: பொருளை அலச முடியவில்லை: %s

source: hash mismatch %s
ta: ஆச் பொருந்தாத %s

source: trying to write commit not in index
ta: குறியீட்டில் இல்லை என்று எழுத முயற்சிக்கிறது

source: failed to load bitmap index (corrupted?)
ta: பிட்மேப் குறியீட்டை ஏற்றுவதில் தோல்வி (சிதைந்ததா?)

source: corrupted bitmap index (too small)
ta: சிதைந்த பிட்மேப் அட்டவணை (மிகச் சிறியது)

source: corrupted bitmap index file (wrong header)
ta: சிதைந்த பிட்மேப் குறியீட்டு கோப்பு (தவறான தலைப்பு)

source: unsupported version '%d' for bitmap index file
ta: பிட்மேப் குறியீட்டு கோப்பிற்கான ஆதரிக்கப்படாத பதிப்பு '%d'

source: corrupted bitmap index file (too short to fit hash cache)
ta: சிதைந்த பிட்மேப் குறியீட்டு கோப்பு (ஆச் கேச் பொருத்த மிகக் குறைவு)

source: corrupted bitmap index file (too short to fit lookup table)
ta: சிதைந்த பிட்மேப் குறியீட்டு கோப்பு (தேடல் அட்டவணைக்கு பொருந்த மிகவும் குறுகியது)

source: duplicate entry in bitmap index: '%s'
ta: பிட்மேப் குறியீட்டில் நகல் நுழைவு: '%s'

source: corrupt ewah bitmap: truncated header for entry %d
ta: ஊழல் ஈவா பிட்மேப்: நுழைவு %d க்கு துண்டிக்கப்பட்ட தலைப்பு

source: corrupt ewah bitmap: commit index %u out of range
ta: ஊழல் ஈவா பிட்மேப்: குறியீட்டு %u வரம்பிலிருந்து வெளியேறவும்

source: corrupted bitmap pack index
ta: சிதைந்த பிட்மேப் கட்டு அட்டவணை

source: invalid XOR offset in bitmap pack index
ta: பிட்மேப் கட்டு குறியீட்டில் தவறான xor ஆஃப்செட்

source: cannot fstat bitmap file
ta: பிட்மேப் கோப்பை fstat முடியாது

source: checksum doesn't match in MIDX and bitmap
ta: செக்சம் மிட்எக்ச் மற்றும் பிட்மாப்பில் பொருந்தவில்லை

source: multi-pack bitmap is missing required reverse index
ta: மல்டி கட்டு பிட்மேப் தேவையான தலைகீழ் குறியீட்டைக் காணவில்லை

source: could not open pack %s
ta: கட்டு %s திறக்க முடியவில்லை

source: corrupt bitmap lookup table: triplet position out of index
ta: ஊழல் பிட்மேப் தேடல் அட்டவணை: குறியீட்டுக்கு வெளியே மும்மடங்கு நிலை

source: corrupt bitmap lookup table: xor chain exceeds entry count
ta: ஊழல் பிட்மேப் தேடல் அட்டவணை: xor சங்கிலி நுழைவு எண்ணிக்கையை மீறுகிறது

source: corrupt bitmap lookup table: commit index %u out of range
ta: ஊழல் பிட்மேப் தேடல் அட்டவணை: குறியீட்டு %u வரம்பிலிருந்து வெளியேறவும்

source: corrupt ewah bitmap: truncated header for bitmap of commit "%s"
ta: ஊழல் ஈவா பிட்மேப்: உறுதி "%s" இன் பிட்மேப்பிற்கான துண்டிக்கப்பட்ட தலைப்பு

source: unable to load pack: '%s', disabling pack-reuse
ta: பேக்கை ஏற்ற முடியவில்லை: '%s', கட்டு-ரீசை முடக்குதல்

source: object '%s' not found in type bitmaps
ta: வகை பிட்மாப்சில் காணப்படவில்லை '%s'

source: object '%s' does not have a unique type
ta: பொருள் '%s' ஒரு தனித்துவமான வகை இல்லை

source: object '%s': real type '%s', expected: '%s'
ta: பொருள் '%s': உண்மையான வகை '%s', எதிர்பார்க்கப்படுகிறது: '%s'

source: object not in bitmap: '%s'
ta: பிட்மேப்பில் இல்லை: '%s'

source: failed to load bitmap indexes
ta: பிட்மேப் குறியீடுகளை ஏற்றுவதில் தோல்வி

source: you must specify exactly one commit to test
ta: சோதனைக்கு ஒருவர் சரியாகக் குறிப்பிட வேண்டும்

source: commit '%s' doesn't have an indexed bitmap
ta: உறுதி '%s' ஒரு குறியீட்டு பிட்மேப் இல்லை

source: mismatch in bitmap results
ta: பிட்மேப் முடிவுகளில் பொருந்தாதது

source: could not find '%s' in pack '%s' at offset %<PRIuMAX>
ta: '%s' இல் '%s' கண்டுபிடிக்க முடியவில்லை ஆஃப்செட் %<PRIuMAX> இல்

source: unable to get disk usage of '%s'
ta: '%s' வட்டு பயன்பாட்டைப் பெற முடியவில்லை

source: bitmap file '%s' has invalid checksum
ta: பிட்மேப் கோப்பு '%s' தவறான செக்சம் உள்ளது

source: mtimes file %s is too small
ta: mtimes கோப்பு %s மிகவும் சிறியது

source: mtimes file %s has unknown signature
ta: mtimes கோப்பு %s அறியப்படாத கையொப்பத்தைக் கொண்டுள்ளது

source: mtimes file %s has unsupported version %<PRIu32>
ta: mtimes கோப்பு %s ஆதரிக்கப்படாத பதிப்பு %<PRIu32>

source: mtimes file %s has unsupported hash id %<PRIu32>
ta: mtimes கோப்பு %s ஆதரிக்கப்படாத ஆச் அடையாளம் %<PRIu32>

source: mtimes file %s is corrupt
ta: mtimes கோப்பு %s ஊழல் நிறைந்ததாகும்

source: reverse-index file %s is too small
ta: தலைகீழ்-குறியீட்டு கோப்பு %s மிகவும் சிறியது

source: reverse-index file %s is corrupt
ta: தலைகீழ்-குறியீட்டு கோப்பு %s ஊழல் நிறைந்தவை

source: reverse-index file %s has unknown signature
ta: தலைகீழ்-குறியீட்டு கோப்பு %s அறியப்படாத கையொப்பத்தைக் கொண்டுள்ளன

source: reverse-index file %s has unsupported version %<PRIu32>
ta: தலைகீழ்-குறியீட்டு கோப்பு %s ஆதரிக்கப்படாத பதிப்பு %<PRIu32>

source: reverse-index file %s has unsupported hash id %<PRIu32>
ta: தலைகீழ்-குறியீட்டு கோப்பு %s ஆதரிக்கப்படாத ஆச் அடையாளம் %<PRIu32>

source: invalid checksum
ta: தவறான செக்சம்

source: invalid rev-index position at %<PRIu64>: %<PRIu32> != %<PRIu32>
ta: %<PRIu64> இல் தவறான ரெவ்-இன்டெக்ச் நிலை: %<PRIu32>! = %<PRIu32>

source: multi-pack-index reverse-index chunk is the wrong size
ta: மல்டி-கட்டு-இன்டெக்ச் தலைகீழ்-குறியீட்டு துண்டானது தவறான அளவு

source: could not determine preferred pack
ta: விருப்பமான பேக்கை தீர்மானிக்க முடியவில்லை

source: cannot both write and verify reverse index
ta: தலைகீழ் குறியீட்டை எழுதவும் சரிபார் முடியாது

source: could not stat: %s
ta: ச்டேட் முடியாது: %s

source: failed to make %s readable
ta: %s படிக்கக்கூடியதாக மாற்றுவதில் தோல்வி

source: could not write '%s' promisor file
ta: '%s' உறுதிமொழி கோப்பை எழுத முடியவில்லை

source: offset before end of packfile (broken .idx?)
ta: பேக்ஃபைல் முடிவதற்கு முன் ஆஃப்செட் (உடைந்தது .ஐடிஎக்ச்?)

source: packfile %s cannot be mapped%s
ta: பேக்ஃபைல் %s %s வரைபடமாக்க முடியாது

source: offset before start of pack index for %s (corrupt index?)
ta: %s (ஊழல் குறியீட்டு?) க்கான கட்டு குறியீட்டைத் தொடங்குவதற்கு முன் ஆஃப்செட்

source: offset beyond end of pack index for %s (truncated index?)
ta: %s (துண்டிக்கப்பட்ட குறியீட்டு?) க்கான கட்டு குறியீட்டின் முடிவுக்கு அப்பால் ஆஃப்செட்

source: malformed expiration date '%s'
ta: தவறான காலாவதி தேதி '%s'

source: option `%s' expects "always", "auto", or "never"
ta: விருப்பம் `%s '" எப்போதும் "," ஆட்டோ "அல்லது" ஒருபோதும் "எதிர்பார்க்கிறது

source: malformed object name '%s'
ta: தவறாக பொருள் பெயர் '%s'

source: option `%s' expects "%s" or "%s"
ta: விருப்பம் `%s '"%s "அல்லது"%s "என்று எதிர்பார்க்கிறது

source: %s requires a value
ta: %s ஒரு மதிப்பு தேவை

source: %s takes no value
ta: %s எந்த மதிப்பையும் எடுக்காது

source: %s isn't available
ta: %s கிடைக்கவில்லை

source: %s expects a non-negative integer value with an optional k/m/g suffix
ta: விருப்பமான k/m/g பின்னொட்டுடன் எதிர்மறை அல்லாத முழு மதிப்பை %s எதிர்பார்க்கிறது

source: ambiguous option: %s (could be --%s%s or --%s%s)
ta: தெளிவற்ற விருப்பம்: %s (இருக்கலாம் --%s%s அல்லது --%s%s)

source: did you mean `--%s` (with two dashes)?
ta: நீங்கள் `-%s` (இரண்டு கோடுகளுடன்) என்று சொன்னீர்களா?

source: alias of --%s
ta: மாற்றுப்பெயர் -%s

source: need a subcommand
ta: ஒரு துணைக் கட்டளை தேவை

source: unknown option `%s'
ta: அறியப்படாத விருப்பம் `%s '

source: unknown switch `%c'
ta: தெரியாத சுவிட்ச் `%c '

source: unknown non-ascii option in string: `%s'
ta: சரம் அறியப்படாத ascii அல்லாத விருப்பம்: `%s '

source: usage: %s
ta: பயன்பாடு: %s

source: or: %s
ta: அல்லது: %s

source: opposite of --no-%s
ta: --no-%s க்கு எதிரானது

source: expiry-date
ta: காலாவதி-தேதி

source: no-op (backward compatibility)
ta: no-op (பின்தங்கிய பொருந்தக்கூடிய தன்மை)

source: be more verbose
ta: மேலும் வாய்மொழியாக இருங்கள்

source: be more quiet
ta: மேலும் அமைதியாக இருங்கள்

source: use <n> digits to display object names
ta: பொருள் பெயர்களைக் காட்ட <n> இலக்கங்களைப் பயன்படுத்தவும்

source: prefixed path to initial superproject
ta: ஆரம்ப சூப்பர் புரோசெக்டிற்கான முன்னொட்டு பாதை

source: how to strip spaces and #comments from message
ta: செய்தியிலிருந்து இடைவெளிகளையும் #தகவல்களையும் எவ்வாறு அகற்றுவது

source: read pathspec from file
ta: கோப்பிலிருந்து pathspec ஐப் படியுங்கள்

source: with --pathspec-from-file, pathspec elements are separated with NUL character
ta: --pathspec-from-file லில் இருந்து, பாதைகுறிப்பு கூறுகள் nul எழுத்துடன் பிரிக்கப்படுகின்றன

source: bad boolean environment value '%s' for '%s'
ta: மோசமான பூலியன் சுற்றுச்சூழல் மதிப்பு '%s' '%s'

source: Could not make %s writable by group
ta: குழுவால் %s எழுத முடியாது

source: Escape character '\' not allowed as last character in attr value
ta: எச்கேப் எழுத்து '\' அட்ரி மதிப்பில் கடைசி கதாபாத்திரமாக அனுமதிக்கப்படவில்லை

source: Only one 'attr:' specification is allowed.
ta: ஒரே ஒரு 'அட்ரி:' விவரக்குறிப்பு அனுமதிக்கப்படுகிறது.

source: attr spec must not be empty
ta: அட்ரி ச்பெக் காலியாக இருக்கக்கூடாது

source: invalid attribute name %s
ta: தவறான பண்புக்கூறு பெயர் %s

source: global 'glob' and 'noglob' pathspec settings are incompatible
ta: உலகளாவிய 'குளோப்' மற்றும் 'நோக்லோப்' பாதைகுறிப்பு அமைப்புகள் பொருந்தாது

source: global 'literal' pathspec setting is incompatible with all other global pathspec settings
ta: உலகளாவிய 'லிட்டரல்' பாதைகுறிப்பு அமைப்பு மற்ற அனைத்து உலகளாவிய பாதைகுறிப்பு அமைப்புகளுடனும் பொருந்தாது

source: invalid parameter for pathspec magic 'prefix'
ta: பாதைகுறிப்பு மேசிக் 'முன்னொட்டு' க்கு தவறான அளவுரு

source: Invalid pathspec magic '%.*s' in '%s'
ta: தவறான பாதைகுறிப்பு மேசிக் '%.*s' இன் '%s'

source: Missing ')' at the end of pathspec magic in '%s'
ta: '%s' இல் பாதைகுறிப்பு மந்திரத்தின் முடிவில் காணவில்லை ')'

source: Unimplemented pathspec magic '%c' in '%s'
ta: செயல்படுத்தப்படாத பாதைகுறிப்பு மேசிக் '%c' '%s' இல்

source: %s: 'literal' and 'glob' are incompatible
ta: %s: 'லிட்டரல்' மற்றும் 'குளோப்' ஆகியவை பொருந்தாது

source: '%s' is outside the directory tree
ta: '%s' அடைவு மரத்திற்கு வெளியே உள்ளது

source: %s: '%s' is outside repository at '%s'
ta: %s: '%s' என்பது '%s' இல் களஞ்சியத்திற்கு வெளியே உள்ளது

source: '%s' (mnemonic: '%c')
ta: '%s' (நினைவூட்டல்: '%c')

source: %s: pathspec magic not supported by this command: %s
ta: %s: பாதைகுறிப்பு மேசிக் இந்த கட்டளையால் ஆதரிக்கப்படவில்லை: %s

source: pathspec '%s' is beyond a symbolic link
ta: pathspec '%s' என்பது ஒரு குறியீட்டு இணைப்பிற்கு அப்பாற்பட்டது

source: line is badly quoted: %s
ta: வரி மோசமாக மேற்கோள் காட்டப்பட்டுள்ளது: %s

source: unable to write flush packet
ta: ஃப்ளச் பாக்கெட் எழுத முடியவில்லை

source: unable to write delim packet
ta: டிலிம் பாக்கெட்டை எழுத முடியவில்லை

source: unable to write response end packet
ta: மறுமொழி முடிவு பாக்கெட்டை எழுத முடியவில்லை

source: flush packet write failed
ta: ஃப்ளச் பாக்கெட் எழுத்து தோல்வியடைந்தது

source: protocol error: impossibly long line
ta: நெறிமுறை பிழை: சாத்தியமற்ற நீண்ட வரி

source: packet write with format failed
ta: வடிவத்துடன் பாக்கெட் எழுதுதல் தோல்வியடைந்தது
