Repository: Nizhal/git-ta-po
Catalog: po/*.po
Languages: ta

source: perform a 3-way merge with the new branch
ta: புதிய கிளையுடன் 3 வழி ஒன்றிணைக்கவும்

source: style
ta: சூல் தண்டு

source: conflict style (merge, diff3, or zdiff3)
ta: மோதல் நடை (ஒன்றிணைத்தல், வேறுபாடு 3, அல்லது zdiff3)

source: detach HEAD at named commit
ta: பெயரிடப்பட்ட உறுதிடில் தலையைப் பிரிக்கவும்

source: force checkout (throw away local modifications)
ta: படை புதுப்பித்தலை (உள்ளூர் மாற்றங்களை தூக்கி எறியுங்கள்)

source: new-branch
ta: புதிய கிளை

source: new unborn branch
ta: புதிய பிறக்காத கிளை

source: update ignored files (default)
ta: புறக்கணிக்கப்பட்ட கோப்புகளைப் புதுப்பிக்கவும் (இயல்புநிலை)

source: checkout our version for unmerged files
ta: அமைக்கப்படாத கோப்புகளுக்கு எங்கள் பதிப்பை சரிபார்

source: checkout their version for unmerged files
ta: ஒருங்கிணைக்கப்படாத கோப்புகளுக்கு அவற்றின் பதிப்பை சரிபார்

source: do not limit pathspecs to sparse entries only
ta: பாதைகள் ச்பெக்குகளை சிதறிய உள்ளீடுகளுக்கு மட்டுமே கட்டுப்படுத்த வேண்டாம்

source: options '-%c', '-%c', and '%s' cannot be used together
ta: விருப்பங்கள் '-%c', '-%c', மற்றும் '%s' ஆகியவை ஒன்றாகப் பயன்படுத்த முடியாது

source: --track needs a branch name
ta: --track இதற்கு ஒரு கிளை பெயர் தேவை

source: missing branch name; try -%c
ta: கிளை பெயர் காணவில்லை; முயற்சிக்கவும் -%c

source: could not resolve %s
ta: %s ஐ தீர்க்க முடியவில்லை

source: invalid path specification
ta: தவறான பாதை விவரக்குறிப்பு

source: '%s' is not a commit and a branch '%s' cannot be created from it
ta: '%s' என்பது ஒரு உறுதிடி அல்ல, அதிலிருந்து ஒரு கிளை '%s' உருவாக்க முடியாது

source: git checkout: --detach does not take a path argument '%s'
ta: git checkout: --detach ஒரு பாதை வாதத்தை '%s' எடுக்கவில்லை

source: git checkout: --ours/--theirs, --force and --merge are incompatible when checking out of the index.
ta: git checkout: --ours/--theirs, --force மற்றும் --merge எப்போது பொருந்தாது குறியீட்டிலிருந்து வெளியேறுகிறது.

source: you must specify path(s) to restore
ta: மீட்டமைக்க நீங்கள் பாதை (களை) குறிப்பிட வேண்டும்

source: branch
ta: கிளை

source: create and checkout a new branch
ta: ஒரு புதிய கிளையை உருவாக்கி சரிபார்

source: create/reset and checkout a branch
ta: ஒரு கிளையை உருவாக்கவும்/மீட்டமைக்கவும் புதுப்பிக்கவும்

source: create reflog for new branch
ta: புதிய கிளைக்கு பிரதிபலிப்பை உருவாக்கவும்

source: second guess 'git checkout <no-such-branch>' (default)
ta: இரண்டாவது யூக 'அறிவிலி செக்அவுட் <நோ-சிச்-பிராஞ்ச்>' (இயல்புநிலை)

source: use overlay mode (default)
ta: மேலடுக்கு பயன்முறையைப் பயன்படுத்தவும் (இயல்புநிலை)

source: create and switch to a new branch
ta: ஒரு புதிய கிளைக்கு உருவாக்கி மாறவும்

source: create/reset and switch to a branch
ta: உருவாக்க/மீட்டமை மற்றும் ஒரு கிளைக்கு மாறவும்

source: second guess 'git switch <no-such-branch>'
ta: இரண்டாவது யூக 'அறிவிலி சுவிட்ச் <இல்லை-புல்வெளி>'

source: throw away local modifications
ta: உள்ளக மாற்றங்களை தூக்கி எறியுங்கள்

source: which tree-ish to checkout from
ta: எந்த மரம்-இச் புதுப்பிக்க

source: restore the index
ta: குறியீட்டை மீட்டெடுக்கவும்

source: restore the working tree (default)
ta: பணி மரத்தை மீட்டெடுக்கவும் (இயல்புநிலை)

source: ignore unmerged entries
ta: அவிழ்க்கப்படாத உள்ளீடுகளை புறக்கணி

source: use overlay mode
ta: மேலடுக்கு பயன்முறையைப் பயன்படுத்தவும்

source: git clean [-d] [-f] [-i] [-n] [-q] [-e <pattern>] [-x | -X] [--] [<pathspec>...]
ta: git seal [-d] [-f] [-i] [-n] [-q] [-e <tatentry>] [-x | -x] [-] [<adagspec> ...]

source: Removing %s
ta: %s நீக்குதல்

source: Would remove %s
ta: %s ஐ அகற்றும்

source: Skipping repository %s
ta: களஞ்சியத்தைத் தவிர்ப்பது %s

source: Would skip repository %s
ta: களஞ்சியத்தை %s தவிர்க்கும்

source: failed to remove %s
ta: %s ஐ அகற்றுவதில் தோல்வி

source: could not lstat %s
ta: lstat %s இல் முடியவில்லை

source: Refusing to remove current working directory
ta: தற்போதைய பணி கோப்பகத்தை அகற்ற மறுக்கிறது

source: Would refuse to remove current working directory
ta: தற்போதைய பணி கோப்பகத்தை அகற்ற மறுக்கும்

source: Prompt help: 1 - select a numbered item foo - select item based on unique prefix - (empty) select nothing
ta: உடனடி உதவி: 1 - எண்ணப்பட்ட உருப்படியைத் தேர்ந்தெடுக்கவும் foo - தனித்துவமான முன்னொட்டின் அடிப்படையில் உருப்படியைத் தேர்ந்தெடுக்கவும் - (வெற்று) எதையும் தேர்ந்தெடுக்கவும்

source: Prompt help: 1 - select a single item 3-5 - select a range of items 2-3,6-9 - select multiple ranges foo - select item based on unique prefix -... - unselect specified items * - choose all items - (empty) finish selecting
ta: உடனடி உதவி: 1 - ஒரு உருப்படியைத் தேர்ந்தெடுக்கவும் 3-5 - உருப்படிகளின் வரம்பைத் தேர்ந்தெடுக்கவும் 2-3,6-9-பல வரம்புகளைத் தேர்ந்தெடுக்கவும் foo - தனித்துவமான முன்னொட்டின் அடிப்படையில் உருப்படியைத் தேர்ந்தெடுக்கவும் -... - குறிப்பிட்ட உருப்படிகளைத் தேர்ந்தெடுக்கவும் * - எல்லா பொருட்களையும் தேர்வு செய்யவும் - (வெற்று) தேர்ந்தெடுப்பதை முடிக்கவும்

source: Huh (%s)?
ta: ஊ (%s)?

source: Input ignore patterns>>
ta: உள்ளீடு புறக்கணிப்பு வடிவங்களை >>

source: WARNING: Cannot find items matched by: %s
ta: முன்னறிவிப்பு: பொருந்தக்கூடிய பொருட்களைக் கண்டுபிடிக்க முடியவில்லை: %s

source: Select items to delete
ta: நீக்க உருப்படிகளைத் தேர்ந்தெடுக்கவும்

source: Remove %s [y/N]?
ta: %s ஐ அகற்றவா [y/N]?

source: clean - start cleaning filter by pattern - exclude items from deletion select by numbers - select items to be deleted by numbers ask each - confirm each deletion (like "rm -i") quit - stop cleaning help - this screen ? - help for prompt selection
ta: சுத்தமாக - தூய்மை செய்யத் தொடங்குங்கள் வடிவத்தால் வடிகட்டவும் - நீக்குதலில் இருந்து உருப்படிகளை விலக்கவும் எண்களால் தேர்ந்தெடுக்கவும் - எண்களால் நீக்க வேண்டிய உருப்படிகளைத் தேர்ந்தெடுக்கவும் ஒவ்வொன்றையும் கேளுங்கள் - ஒவ்வொரு நீக்குதலையும் உறுதிப்படுத்தவும் ("rm -i" போன்றவை) வெளியேறு - தூய்மை செய்வதை நிறுத்துங்கள் உதவி - இந்த திரை ? - உடனடி தேர்வுக்கு உதவி

source: Would remove the following item:
ta: பின்வரும் உருப்படியை அகற்றும்:

source: No more files to clean, exiting.
ta: தூய்மை செய்ய இனி கோப்புகள் இல்லை.

source: do not print names of files removed
ta: அகற்றப்பட்ட கோப்புகளின் பெயர்களை அச்சிட வேண்டாம்

source: force
ta: ஆற்றல்

source: interactive cleaning
ta: ஊடாடும் தூய்மை

source: remove whole directories
ta: முழு கோப்பகங்களையும் அகற்று

source: pattern
ta: முறை

source: add <pattern> to ignore rules
ta: விதிகளை புறக்கணிக்க <முறை> சேர்க்கவும்

source: remove ignored files, too
ta: புறக்கணிக்கப்பட்ட கோப்புகளையும் அகற்று

source: remove only ignored files
ta: புறக்கணிக்கப்பட்ட கோப்புகளை மட்டும் அகற்று

source: info: Could not add alternate for '%s': %s
ta: தகவல்: '%s' க்கு மாற்று சேர்க்க முடியவில்லை: %s

source: failed to stat '%s'
ta: '%s' என்ற புள்ளியில் தோல்வியுற்றது

source: %s exists and is not a directory
ta: %s உள்ளன மற்றும் ஒரு அடைவு அல்ல

source: '%s' is a symlink, refusing to clone with --local
ta: '%s' என்பது ஒரு சிம்லிங்க் ஆகும், இது --local நகலி செய்ய மறுக்கிறது

source: failed to start iterator over '%s'
ta: '%s' க்கு மேல் மறு செய்கை தொடங்குவதில் தோல்வி

source: symlink '%s' exists, refusing to clone with --local
ta: சிம்லிங்க் '%s' உள்ளன, இது --local உடன் நகலி செய்ய மறுக்கிறது

source: failed to unlink '%s'
ta: '%s' ஐ இணைக்கத் தவறிவிட்டது

source: failed to create link '%s'
ta: '%s' இணைப்பை உருவாக்குவதில் தோல்வி

source: failed to copy file to '%s'
ta: கோப்பை '%s' க்கு நகலெடுப்பதில் தோல்வி

source: failed to iterate over '%s'
ta: '%s' ஐ விட மீண்டும் செய்யத் தவறிவிட்டது

source: done.
ta: முடிந்தது.

source: Clone succeeded, but checkout failed. You can inspect what was checked out with 'git status' and retry with 'git restore --source=HEAD :/'
ta: நகலி செய் பெற்றது, ஆனால் புதுப்பித்து தோல்வியடைந்தது. 'அறிவிலி நிலை' மூலம் சரிபார்க்கப்பட்டதை நீங்கள் ஆய்வு செய்யலாம் மற்றும் 'git restore --source=HEAD :/' உடன் மீண்டும் முயற்சிக்கவும்

source: remote did not send all necessary objects
ta: தொலை தேவையான அனைத்து பொருட்களையும் அனுப்பவில்லை

source: unable to update %s
ta: %s ஐ புதுப்பிக்க முடியவில்லை

source: failed to initialize sparse-checkout
ta: சிதறிய-சரிபார்ப்பைத் தொடங்குவதில் தோல்வி

source: remote HEAD refers to nonexistent ref, unable to checkout
ta: தொலை எட் என்பது இல்லாத குறிப்பைக் குறிக்கிறது, புதுப்பிக்க முடியவில்லை

source: unable to checkout working tree
ta: பணி மரத்தைப் புதுப்பிக்க முடியவில்லை

source: unable to write parameters to config file
ta: கோப்பை கட்டமைக்க அளவுருக்களை எழுத முடியவில்லை

source: cannot repack to clean up
ta: தூய்மை செய்ய மறுபிரவேசம் செய்ய முடியாது

source: cannot unlink temporary alternates file
ta: தற்காலிக மாற்று கோப்பை அவிழ்க்க முடியாது

source: don't clone shallow repository
ta: ஆழமற்ற களஞ்சியத்தை நகலி செய்ய வேண்டாம்

source: don't create a checkout
ta: புதுப்பித்தலை உருவாக்க வேண்டாம்

source: create a bare repository
ta: வெற்று களஞ்சியத்தை உருவாக்கவும்

source: to clone from a local repository
ta: உள்ளக களஞ்சியத்திலிருந்து நகலி செய்ய

source: don't use local hardlinks, always copy
ta: உள்ளக ஆர்ட்லிங்க்களைப் பயன்படுத்த வேண்டாம், எப்போதும் நகலெடுக்கவும்

source: setup as shared repository
ta: பகிரப்பட்ட களஞ்சியமாக அமைக்கவும்

source: pathspec
ta: பாதைகுறிப்பு

source: initialize submodules in the clone
ta: குளோனில் துணைதொகுதிகளைத் தொடங்கவும்

source: number of submodules cloned in parallel
ta: இணையாக நகலி செய்யப்பட்ட துணைதொகுதிகளின் எண்ணிக்கை

source: template-directory
ta: வார்ப்புரு-நேரடி

source: directory from which templates will be used
ta: எந்த வார்ப்புருக்கள் பயன்படுத்தப்படும்

source: reference repository
ta: குறிப்பு களஞ்சியம்

source: use --reference only while cloning
ta: நகலி செய்யும் போது மட்டுமே --reference பயன்படுத்தவும்

source: name
ta: பெயர்

source: use <name> instead of 'origin' to track upstream
ta: அப்ச்ட்ரீமைக் கண்காணிக்க 'தோற்றம்' என்பதற்கு பதிலாக <பெயர்> ஐப் பயன்படுத்தவும்

source: checkout <branch> instead of the remote's HEAD
ta: தொலைடின் தலைக்கு பதிலாக புதுப்பித்து <கிளை>

source: path to git-upload-pack on the remote
ta: தொலைதூரத்தில் git-upload-pack க்கான பாதை

source: depth
ta: ஆழம்

source: create a shallow clone of that depth
ta: அந்த ஆழத்தின் ஆழமற்ற நகலியை உருவாக்கவும்

source: create a shallow clone since a specific time
ta: ஒரு குறிப்பிட்ட நேரத்திலிருந்து ஆழமற்ற நகலியை உருவாக்கவும்

source: clone only one branch, HEAD or --branch
ta: ஒரு கிளை மட்டுமே நகலி, தலை அல்லது --branch

source: any cloned submodules will be shallow
ta: எந்த நகலி துணைதொகுதிகளும் ஆழமற்றதாக இருக்கும்

source: gitdir
ta: கிடிர்

source: separate git dir from working tree
ta: பணி மரத்திலிருந்து பிரிக்கவும்

source: specify the reference format to use
ta: பயன்படுத்த குறிப்பு வடிவமைப்பைக் குறிப்பிடவும்

source: key=value
ta: விசை = மதிப்பு

source: set config inside the new repository
ta: புதிய களஞ்சியத்திற்குள் கட்டமைப்பை அமைக்கவும்

source: server-specific
ta: சேவையக-குறிப்பிட்ட

source: option to transmit
ta: கடத்த விருப்பம்

source: apply partial clone filters to submodules
ta: துணை நகலி வடிப்பான்களை துணைதொகுதிகளுக்கு பயன்படுத்துங்கள்

source: any cloned submodules will use their remote-tracking branch
ta: எந்த நகலி துணைதொகுதிகளும் அவற்றின் தொலை-கண்காணிப்பு கிளையைப் பயன்படுத்தும்

source: initialize sparse-checkout file to include only files at root
ta: ரூட்டில் கோப்புகளை மட்டுமே சேர்க்க சிதறிய-சோதனை கோப்பைத் தொடங்கவும்

source: uri
ta: யூரி

source: a URI for downloading bundles before fetching from origin remote
ta: ஆரிசின் தொலைடிலிருந்து பெறுவதற்கு முன் மூட்டைகளை பதிவிறக்குவதற்கான யுஆர்ஐ

source: git clone [<options>] [--] <repo> [<dir>]
ta: git clone [<விருப்பங்கள்>] [--] <களஞ்சியம்> [<அடைவு>]

source: Too many arguments.
ta: பல வாதங்கள்.

source: You must specify a repository to clone.
ta: குளோனுக்கு ஒரு களஞ்சியத்தை நீங்கள் குறிப்பிட வேண்டும்.

source: unknown ref storage format '%s'
ta: அறியப்படாத ref சேமிப்பக வடிவம் '%s'

source: repository '%s' does not exist
ta: களஞ்சியம் '%s' இல்லை

source: depth %s is not a positive number
ta: ஆழம் %s நேர்மறை எண் அல்ல

source: destination path '%s' already exists and is not an empty directory.
ta: இலக்கு பாதை '%s' ஏற்கனவே உள்ளது மற்றும் இது வெற்று அடைவு அல்ல.

source: repository path '%s' already exists and is not an empty directory.
ta: களஞ்சிய பாதை '%s' ஏற்கனவே உள்ளது மற்றும் இது வெற்று அடைவு அல்ல.

source: working tree '%s' already exists.
ta: பணி மரம் '%s' ஏற்கனவே உள்ளது.

source: could not create leading directories of '%s'
ta: '%s' இன் முன்னணி கோப்பகங்களை உருவாக்க முடியவில்லை

source: could not create work tree dir '%s'
ta: பணி மரம் அடைவு '%s' ஐ உருவாக்க முடியவில்லை

source: Cloning into bare repository '%s'...
ta: வெற்று களஞ்சியத்தில் '%s' என நகலி...

source: Cloning into '%s'...
ta: '%s' ஆக நகலி...

source: clone --recursive is not compatible with both --reference and --reference-if-able
ta: --reference மற்றும் --reference-if-able இரண்டிற்கும் clone --recursive பொருந்தாது

source: '%s' is not a valid remote name
ta: '%s' சரியான தொலைநிலை பெயர் அல்ல

source: --depth is ignored in local clones; use file:// instead.
ta: உள்ளூர் குளோன்களில் --depth புறக்கணிக்கப்படுகிறது; அதற்கு பதிலாக கோப்பு:// ஐப் பயன்படுத்தவும்.

source: --shallow-since is ignored in local clones; use file:// instead.
ta: --shallow-since உள்ளக குளோன்களில் புறக்கணிக்கப்படுகிறது; அதற்கு பதிலாக கோப்பு: // ஐப் பயன்படுத்தவும்.

source: --shallow-exclude is ignored in local clones; use file:// instead.
ta: உள்ளூர் குளோன்களில் --shallow-exclude புறக்கணிக்கப்படுகிறது; அதற்கு பதிலாக கோப்பு: // ஐப் பயன்படுத்தவும்.

source: --filter is ignored in local clones; use file:// instead.
ta: உள்ளூர் குளோன்களில் --filter புறக்கணிக்கப்படுகிறது; அதற்கு பதிலாக கோப்பு:// ஐப் பயன்படுத்தவும்.

source: source repository is shallow, reject to clone.
ta: மூல களஞ்சியம் ஆழமற்றது, நகலிக்கு நிராகரிக்கவும்.

source: source repository is shallow, ignoring --local
ta: மூல களஞ்சியம் ஆழமற்றது, புறக்கணிக்கிறது --local

source: --local is ignored
ta: --local புறக்கணிக்கப்படுகிறது

source: cannot clone from filtered bundle
ta: வடிகட்டப்பட்ட மூட்டையிலிருந்து நகலி செய்ய முடியாது

source: failed to initialize the repo, skipping bundle URI
ta: ரெப்போவைத் தொடங்குவதில் தோல்வி, மூட்டை யூரியைத் தவிர்த்தது

source: failed to fetch objects from bundle URI '%s'
ta: மூட்டை யூரி '%s' இலிருந்து பொருட்களைப் பெறுவதில் தோல்வி

source: failed to fetch advertised bundles
ta: விளம்பரப்படுத்தப்பட்ட மூட்டைகளை பெறத் தவறிவிட்டது

source: remote transport reported error
ta: தொலை போக்குவரத்து பிழை என்று அறிவித்தது

source: Remote branch %s not found in upstream %s
ta: தொலைநிலை கிளை %s மேலோடை %s இல் காணப்படவில்லை

source: You appear to have cloned an empty repository.
ta: நீங்கள் ஒரு வெற்று களஞ்சியத்தை நகலி செய்ததாகத் தெரிகிறது.

source: git column [<options>]
ta: அறிவிலி நெடுவரிசை [<விருப்பங்கள்>]

source: lookup config vars
ta: தேடல் கட்டமைப்பு vars

source: layout to use
ta: பயன்படுத்த தளவமைப்பு

source: maximum width
ta: அதிகபட்ச அகலம்

source: padding space on left border
ta: இடது எல்லையில் திணிப்பு இடம்

source: padding space on right border
ta: வலது எல்லையில் திணிப்பு இடம்

source: padding space between columns
ta: நெடுவரிசைகளுக்கு இடையில் திணிப்பு இடம்

source: --command must be the first argument
ta: --command முதல் வாதமாக இருக்க வேண்டும்

source: git commit-graph verify [--object-dir <dir>] [--shallow] [--[no-]progress]
ta: git commit-graph verify [--object-dir <அடைவு>] [--shallow] [--[no-]progress]

source: git commit-graph write [--object-dir <dir>] [--append] [--split[=<strategy>]] [--reachable | --stdin-packs | --stdin-commits] [--changed-paths] [--[no-]max-new-filters <n>] [--[no-]progress] <split-options>
ta: git commit-graph write [--object-dir <அடைவு>] [--append] [--split[=<மூலோபாயம்>]] [--reachable | --stdin-packs | --stdin-commits] [--changed-paths] [--[no-]max-new-filters <n>] [--[no-]progress] <பிளவு-விருப்பங்கள்>

source: dir
ta: அடைவு

source: the object directory to store the graph
ta: வரைபடத்தை சேமிக்க பொருள் அடைவு

source: if the commit-graph is split, only verify the tip file
ta: உறுதி-வரைபடம் பிரிக்கப்பட்டால், முனை கோப்பை மட்டுமே சரிபார்

source: Could not open commit-graph '%s'
ta: உறுதி-வரைபடம் '%s' ஐ திறக்க முடியவில்லை

source: could not open commit-graph chain '%s'
ta: உறுதி-வரைபடம் சங்கிலி '%s' ஐ திறக்க முடியவில்லை

source: unrecognized --split argument, %s
ta: அங்கீகரிக்கப்படாத --split உரையாடல், %s

source: unexpected non-hex object ID: %s
ta: எதிர்பாராத ஃச் அல்லாத பொருள் அடையாளம்: %s

source: invalid object: %s
ta: தவறான பொருள்: %s

source: option `%s' expects a numerical value
ta: விருப்பம் `%s 'ஒரு எண் மதிப்பை எதிர்பார்க்கிறது

source: start walk at all refs
ta: எல்லா குறிப்புகளிலும் நடக்கத் தொடங்குங்கள்

source: scan pack-indexes listed by stdin for commits
ta: உறுதிசிற்காக stdin ஆல் பட்டியலிடப்பட்ட ச்கேன் கட்டு-குறியீடுகள்

source: start walk at commits listed by stdin
ta: stdin ஆல் பட்டியலிடப்பட்ட உறுதிடுகளில் நடக்கத் தொடங்குங்கள்

source: include all commits already in the commit-graph file
ta: உறுதி-வரைபடம் கோப்பில் ஏற்கனவே அனைத்து உறுதிடுகளையும் சேர்க்கவும்

source: enable computation for changed paths
ta: மாற்றப்பட்ட பாதைகளுக்கான கணக்கீட்டை இயக்கவும்

source: allow writing an incremental commit-graph file
ta: அதிகரிக்கும் உறுதி-வரைபடம் கோப்பை எழுத அனுமதிக்கவும்

source: maximum number of commits in a non-base split commit-graph
ta: அடிப்படை அல்லாத பிளவு உறுதி-வரைபடத்தில் அதிகபட்ச உறுதிச்

source: maximum ratio between two levels of a split commit-graph
ta: ஒரு பிளவு உறுதி-வரைபடத்தின் இரண்டு நிலைகளுக்கு இடையில் அதிகபட்ச விகிதம்

source: only expire files older than a given date-time
ta: கொடுக்கப்பட்ட தேதி நேரத்தை விட பழைய கோப்புகளை மட்டுமே காலாவதியாகிறது

source: maximum number of changed-path Bloom filters to compute
ta: கணக்கிட மாற்றப்பட்ட-பாதை பூக்கும் வடிப்பான்களின் அதிகபட்ச எண்ணிக்கை

source: use at most one of --reachable, --stdin-commits, or --stdin-packs
ta: --reachable, --stdin-commits, அல்லது --stdin-packs இல் ஒன்றைப் பயன்படுத்தவும்

source: Collecting commits from input
ta: உள்ளீட்டிலிருந்து உறுதிடுகளை சேகரித்தல்

source: git commit-tree <tree> [(-p <parent>)...]
ta: git commit-tree <மரம்> [(-p <பெற்றோர்>)...]

source: git commit-tree [(-p <parent>)...] [-S[<keyid>]] [(-m <message>)...] [(-F <file>)...] <tree>
ta: git commit-tree [(-p <பெற்றோர்>) ...] [-s [<keyid>]]] [(-f <கோப்பு>) ...] <மரம்>

source: duplicate parent %s ignored
ta: நகல் பெற்றோர் %s புறக்கணிக்கப்பட்டன

source: not a valid object name %s
ta: செல்லுபடியாகும் பொருள் பெயர் %s அல்ல

source: git commit-tree: failed to read '%s'
ta: அறிவிலி உறுதி-மரம்: '%s' படிக்கத் தவறிவிட்டது

source: git commit-tree: failed to close '%s'
ta: அறிவிலி உறுதி-ட்ரீ: '%s' ஐ மூடுவதில் தோல்வி

source: parent
ta: பெற்றோர்

source: id of a parent commit object
ta: பெற்றோரின் அடையாளம் பொருள்

source: message
ta: செய்தி

source: commit message
ta: செய்தியைச் செய்யுங்கள்

source: read commit log message from file
ta: கோப்பிலிருந்து உறுதி பதிவு செய்தியைப் படியுங்கள்

source: GPG sign commit
ta: சிபிசி அடையாளம் உறுதி

source: must give exactly one tree
ta: சரியாக ஒரு மரத்தை கொடுக்க வேண்டும்

source: git commit-tree: failed to read
ta: அறிவிலி உறுதி-மரம்: படிக்கத் தவறிவிட்டது

source: git status [<options>] [--] [<pathspec>...]
ta: git status [<விருப்பங்கள்>] [--] [<பாதைகுறிப்பு>...]

source: You asked to amend the most recent commit, but doing so would make it empty. You can repeat your command with --allow-empty, or you can remove the commit entirely with "git reset HEAD^".
ta: மிக அண்மைக் கால உறுதிப்பாட்டை திருத்த நீங்கள் கேட்டீர்கள், ஆனால் அவ்வாறு செய்வது செய்யும் அது காலியாக உள்ளது. உங்கள் கட்டளையை --allow-empty, அல்லது உங்களால் மீண்டும் செய்யலாம் "git reset HEAD^" உடன் உறுதிப்பாட்டை முழுவதுமாக அகற்றவும்.

source: The previous cherry-pick is now empty, possibly due to conflict resolution. If you wish to commit it anyway, use: git commit --allow-empty
ta: முந்தைய செர்ரி-பிக் இப்போது காலியாக உள்ளது, இது மோதல் தீர்மானம் காரணமாக இருக்கலாம். நீங்கள் எப்படியும் அதைச் செய்ய விரும்பினால், பயன்படுத்தவும்: git commit --allow-empty

source: Otherwise, please use 'git rebase --skip'
ta: இல்லையெனில், தயவுசெய்து 'git rebase --skip' ஐப் பயன்படுத்தவும்

source: Otherwise, please use 'git cherry-pick --skip'
ta: இல்லையெனில், தயவுசெய்து 'git cherry-pick --skip' ஐப் பயன்படுத்தவும்

source: and then use: git cherry-pick --continue to resume cherry-picking the remaining commits. If you wish to skip this commit, use: git cherry-pick --skip
ta: பின்னர் பயன்படுத்தவும்: git cherry-pick --continue மீதமுள்ள உறுதிடுகளை மீண்டும் தேர்வு செய்ய. இந்த உறுதிப்பாட்டை நீங்கள் தவிர்க்க விரும்பினால், பயன்படுத்தவும்: git cherry-pick --skip

source: updating files failed
ta: கோப்புகளைப் புதுப்பிப்பது தோல்வியடைந்தது

source: failed to unpack HEAD tree object
ta: தலை மர பொருளைத் திறக்கத் தவறிவிட்டது

source: No paths with --include/--only does not make sense.
ta: --include/--only உடன் பாதைகள் இல்லை.

source: unable to create temporary index
ta: தற்காலிக குறியீட்டை உருவாக்க முடியவில்லை

source: interactive add failed
ta: ஊடாடும் சேர்க்கை தோல்வியடைந்தது

source: unable to update temporary index
ta: தற்காலிக குறியீட்டைப் புதுப்பிக்க முடியவில்லை

source: Failed to update main cache tree
ta: முதன்மையான கேச் மரத்தை புதுப்பிக்கத் தவறிவிட்டது

source: cannot do a partial commit during a merge.
ta: ஒன்றிணைக்கும் போது ஒரு பகுதியளவு உறுதிப்பாட்டை செய்ய முடியாது.

source: cannot do a partial commit during a cherry-pick.
ta: செர்ரி-பிக் போது ஒரு பகுதி உறுதிடியை செய்ய முடியாது.

source: cannot do a partial commit during a rebase.
ta: மறுதொடக்கத்தின் போது ஒரு பகுதி உறுதிடியை செய்ய முடியாது.

source: cannot read the index
ta: குறியீட்டைப் படிக்க முடியாது

source: unable to write temporary index file
ta: தற்காலிக குறியீட்டு கோப்பை எழுத முடியவில்லை

source: commit '%s' lacks author header
ta: உறுதி '%s' எழுத்தாளர் தலைப்பு இல்லை

source: commit '%s' has malformed author line
ta: உறுதி '%s' எழுத்தாளர் வரியை தவறாக கொண்டுள்ளது

source: malformed --author parameter
ta: தவறாக --author அளவுரு

source: invalid date format: %s
ta: தவறான தேதி வடிவம்: %s

source: unable to select a comment character that is not used in the current commit message
ta: பயன்படுத்தப்படாத ஒரு கருத்து எழுத்தைத் தேர்ந்தெடுக்க முடியவில்லை தற்போதைய உறுதி செய்தியில்

source: could not lookup commit '%s'
ta: '%s' செய்ய முடியவில்லை

source: (reading log message from standard input)
ta: (நிலையான உள்ளீட்டிலிருந்து பதிவு செய்தியைப் படித்தல்)

source: could not read log from standard input
ta: நிலையான உள்ளீட்டிலிருந்து பதிவைப் படிக்க முடியவில்லை

source: could not read log file '%s'
ta: பதிவு கோப்பை '%s' படிக்க முடியவில்லை

source: options '%s' and '%s:%s' cannot be used together
ta: விருப்பங்கள் '%s' மற்றும் '%s:%s' ஒன்றைப் பயன்படுத்த முடியாது

source: could not read SQUASH_MSG
ta: SQUASH_MSG படிக்க முடியவில்லை

source: could not read MERGE_MSG
ta: MERGE_MSG ஐப் படிக்க முடியவில்லை

source: could not open '%s'
ta: '%s' திறக்க முடியவில்லை

source: could not write commit template
ta: உறுதி வார்ப்புருவை எழுத முடியவில்லை

source: It looks like you may be committing a merge. If this is not correct, please run git update-ref -d MERGE_HEAD and try again.
ta: நீங்கள் ஒரு ஒன்றிணைப்பைச் செய்வது போல் தெரிகிறது. இது சரியாக இல்லாவிட்டால், தயவுசெய்து இயக்கவும் git update-ref -d MERGE_HEAD மீண்டும் முயற்சிக்கவும்.

source: It looks like you may be committing a cherry-pick. If this is not correct, please run git update-ref -d CHERRY_PICK_HEAD and try again.
ta: நீங்கள் ஒரு செர்ரி-பிக் செய்யக்கூடும் என்று தெரிகிறது. இது சரியாக இல்லாவிட்டால், தயவுசெய்து இயக்கவும் git update-ref -d CHERRY_PICK_HEAD மீண்டும் முயற்சிக்கவும்.

source: %sAuthor: %.*s <%.*s>
ta: %sஆசிரியர்: %.*s <%.*s>

source: %sDate: %s
ta: %sதேதி: %s

source: %sCommitter: %.*s <%.*s>
ta: %sஉறுதிமொழியாளர்: %.*s <%.*s>

source: Cannot read index
ta: குறியீட்டைப் படிக்க முடியாது

source: unable to pass trailers to --trailers
ta: டிரெய்லர்களை --trailers க்கு அனுப்ப முடியவில்லை

source: Error building trees
ta: மரங்களை கட்டும் பிழை

source: Please supply the message using either -m or -F option.
ta: -m அல்லது -f விருப்பத்தைப் பயன்படுத்தி செய்தியை வழங்கவும்.

source: --author '%s' is not 'Name <email>' and matches no existing author
ta: --author '%s' என்பது 'Name <email>' இல்லை and உள்ள நூலாசிரியர்ளின் பொருத்தம் இல்லை
