Repository: Nizhal/git-ta-po
Catalog: po/*.po
Languages: ta

source: move commits that begin with squash!/fixup! under -i
ta: ச்குவாச்!/fixup உடன் தொடங்கும் நகர்வு! -i இன் கீழ்

source: update branches that point to commits that are being rebased
ta: மறுகட்டமைக்கப்படுவதை சுட்டிக்காட்டும் கிளைகளைப் புதுப்பிக்கவும்

source: add exec lines after each commit of the editable list
ta: திருத்தக்கூடிய பட்டியலின் ஒவ்வொரு உறுதிப்பாட்டிற்கும் பிறகு எக்செக் வரிகளைச் சேர்க்கவும்

source: allow rebasing commits with empty messages
ta: வெற்று செய்திகளுடன் உறுதிடுகளை மறுசீரமைக்க அனுமதிக்கவும்

source: try to rebase merges instead of skipping them
ta: இணைப்புகளைத் தவிர்ப்பதற்குப் பதிலாக அவற்றை மறுபரிசீலனை செய்ய முயற்சிக்கவும்

source: use 'merge-base --fork-point' to refine upstream
ta: மேலோடை செம்மைப்படுத்த 'merge-base --fork-point' ஐப் பயன்படுத்தவும்

source: use the given merge strategy
ta: கொடுக்கப்பட்ட ஒன்றிணைக்கும் மூலோபாயத்தைப் பயன்படுத்தவும்

source: option
ta: சூதம்

source: pass the argument through to the merge strategy
ta: ஒன்றிணைக்கும் மூலோபாயத்திற்கு வாதத்தை அனுப்பவும்

source: rebase all reachable commits up to the root(s)
ta: மறு

source: automatically re-schedule any `exec` that fails
ta: தோல்வியுற்ற எந்த `எக்செக்` தானாகவே மீண்டும் திட்டமிடுங்கள்

source: apply all changes, even those already present upstream
ta: எல்லா மாற்றங்களையும் பயன்படுத்துங்கள், ஏற்கனவே அப்ச்ட்ரீமில் உள்ளவை கூட

source: It looks like 'git am' is in progress. Cannot rebase.
ta: 'அறிவிலி ஆம்' நடந்து கொண்டிருப்பதாகத் தெரிகிறது. திரும்பப் பெற முடியாது.

source: `rebase --preserve-merges` (-p) is no longer supported. Use `git rebase --abort` to terminate current rebase. Or downgrade to v2.33, or earlier, to complete the rebase.
ta: `rebase --preserve-merges (-p) இனி ஆதரிக்கப்படாது. தற்போதைய மறுசீரமைப்பை நிறுத்த `git rebase --abort` ஐப் பயன்படுத்தவும். அல்லது மறுசீரமைப்பை முடிக்க v2.33 அல்லது அதற்கு முன்னர் தரமிறக்கவும்.

source: --preserve-merges was replaced by --rebase-merges Note: Your `pull.rebase` configuration may also be set to 'preserve', which is no longer supported; use 'merges' instead
ta: --preserve-merges என்பது --rebase-merges ஆல் மாற்றப்பட்டது குறிப்பு: உங்கள் `pull.rebase` உள்ளமைவும் 'preserve' அமைக்கப்படலாம், இது இனி ஆதரிக்கப்படாது; அதற்கு பதிலாக 'merges' பயன்படுத்தவும்

source: The --edit-todo action can only be used during interactive rebase.
ta: ஊடாடும் மறுசீரமைப்பின் போது மட்டுமே --edit-todo செயலைப் பயன்படுத்த முடியும்.

source: Cannot read HEAD
ta: தலையைப் படிக்க முடியாது

source: You must edit all merge conflicts and then mark them as resolved using git add
ta: அனைத்து ஒன்றிணைக்கும் மோதல்களையும் நீங்கள் திருத்த வேண்டும் அறிவிலி சேர் பயன்படுத்தி தீர்க்கப்பட்டபடி அவற்றைக் குறிக்கவும்

source: could not discard worktree changes
ta: பணியாளர் மாற்றங்களை நிராகரிக்க முடியவில்லை

source: could not move back to %s
ta: %s க்கு திரும்பிச் செல்ல முடியவில்லை

source: It seems that there is already a %s directory, and I wonder if you are in the middle of another rebase. If that is the case, please try %s If that is not the case, please %s and run me again. I am stopping in case you still have something valuable there.
ta: ஏற்கனவே ஒரு %s கோப்பரம் இருப்பதாகத் தெரிகிறது, மற்றும் நீங்கள் மற்றொரு மறுசீரமைப்பின் நடுவில் இருக்கிறீர்களா என்று எனக்கு ஆச்சரியமாக இருக்கிறது. அது என்றால் வழக்கு, தயவுசெய்து முயற்சிக்கவும் %s அப்படி இல்லையென்றால், தயவுசெய்து %s என்னை மீண்டும் ஓடு. உங்களிடம் இன்னும் ஏதேனும் இருந்தால் நான் நிறுத்துகிறேன் அங்கு மதிப்புமிக்கது.

source: switch `C' expects a numerical value
ta: `சி 'ஒரு எண் மதிப்பை எதிர்பார்க்கிறது

source: apply options are incompatible with rebase.rebaseMerges. Consider adding --no-rebase-merges
ta: விண்ணப்பிக்கும் விருப்பங்கள் rebase.rebaseMerges உடன் பொருந்தாது. --no-rebase-merges ஐச் சேர்ப்பதைக் கவனியுங்கள்

source: apply options are incompatible with rebase.updateRefs. Consider adding --no-update-refs
ta: விண்ணப்பிக்கும் விருப்பங்கள் rebase.updateRefs உடன் பொருந்தாது. --no-update-refs ஐச் சேர்ப்பதைக் கவனியுங்கள்

source: Unknown rebase backend: %s
ta: அறியப்படாத மறுதொடக்கம் பின்தளத்தில்: %s

source: --reschedule-failed-exec requires --exec or --interactive
ta: --reschedule-failed-exec க்கு தேவைப்படுகிறது --exec அல்லது --interactive

source: invalid upstream '%s'
ta: தவறான மேலோடை '%s'

source: Could not create new root commit
ta: புதிய வேர் உறுதிடத்தை உருவாக்க முடியவில்லை

source: no such branch/commit '%s'
ta: அத்தகைய கிளை/ உறுதி '%s' இல்லை

source: No such ref: %s
ta: அத்தகைய குறிப்பு இல்லை: %s

source: Could not resolve HEAD to a commit
ta: ஒரு உறுதிப்பாட்டிற்கு தலையைத் தீர்க்க முடியவில்லை

source: '%s': need exactly one merge base with branch
ta: '%s': கிளையுடன் ஒரு ஒன்றிணைக்கும் தளம் தேவை

source: '%s': need exactly one merge base
ta: '%s': சரியாக ஒரு ஒன்றிணைக்கும் தளம் தேவை

source: Does not point to a valid commit '%s'
ta: செல்லுபடியாகும் உறுதிப்பாட்டை '%s' சுட்டிக்காட்டவில்லை

source: HEAD is up to date.
ta: தலை புதுப்பித்த நிலையில் உள்ளது.

source: Current branch %s is up to date.
ta: தற்போதைய கிளை %s புதுப்பித்த நிலையில் உள்ளன.

source: HEAD is up to date, rebase forced.
ta: தலை புதுப்பித்த நிலையில் உள்ளது, மறுசீரமைப்பு கட்டாயப்படுத்தப்பட்டது.

source: Current branch %s is up to date, rebase forced.
ta: தற்போதைய கிளை %s புதுப்பித்த நிலையில் உள்ளன, மறுசீரமைப்பு கட்டாயப்படுத்தப்படுகிறது.

source: The pre-rebase hook refused to rebase.
ta: முன் மறுதொடக்கம் ஊக் மீண்டும் மறுக்க மறுத்துவிட்டது.

source: Changes to %s:
ta: %s க்கு மாற்றங்கள்:

source: Changes from %s to %s:
ta: %s முதல் %s வரை மாற்றங்கள்:

source: First, rewinding head to replay your work on top of it...
ta: முதலில், உங்கள் பணியை அதன் மேல் மீண்டும் இயக்க தலையை முன்னாடி வைக்கவும் ...

source: Could not detach HEAD
ta: தலையைப் பிரிக்க முடியவில்லை

source: Fast-forwarded %s to %s.
ta: வேகமாக முன்னோக்கி %s முதல் %s.

source: git receive-pack <git-dir>
ta: git receive-pack <அறிவிலி-அடைவு>

source: By default, updating the current branch in a non-bare repository is denied, because it will make the index and work tree inconsistent with what you pushed, and will require 'git reset --hard' to match the work tree to HEAD. You can set the 'receive.denyCurrentBranch' configuration variable to 'ignore' or 'warn' in the remote repository to allow pushing into its current branch; however, this is not recommended unless you arranged to update its work tree to match what you pushed in some other way. To squelch this message and still keep the default behaviour, set 'receive.denyCurrentBranch' configuration variable to 'refuse'.
ta: இயல்பாக, தற்போதைய கிளையை ஒரு குழந்தை அல்லாத களஞ்சியத்தில் புதுப்பித்தல் மறுக்கப்படுகிறது, ஏனெனில் இது குறியீட்டு மற்றும் பணி மரத்தை சீரற்றதாக மாற்றும் நீங்கள் தள்ளியவற்றுடன், பொருந்த 'git reset --hard' தேவைப்படும் பணி மரம் தலைக்கு. நீங்கள் 'receive.denyCurrentBranch' உள்ளமைவு மாறியை அமைக்கலாம் தொலை களஞ்சியத்தில் 'புறக்கணிக்க' அல்லது 'முன்னறிவிப்பு' அதன் தற்போதைய கிளை; இருப்பினும், நீங்கள் இல்லாவிட்டால் இது பரிந்துரைக்கப்படவில்லை சிலவற்றில் நீங்கள் தள்ளியதை பொருத்த அதன் பணி மரத்தை புதுப்பிக்க ஏற்பாடு செய்யப்பட்டுள்ளது மாற்று வழி. இந்த செய்தியைக் கசக்கி, இயல்புநிலை நடத்தையை இன்னும் வைத்திருக்க, அமைக்கவும் 'மறுக்க' 'receive.denyCurrentBranch' உள்ளமைவு மாறி.

source: By default, deleting the current branch is denied, because the next 'git clone' won't result in any file checked out, causing confusion. You can set 'receive.denyDeleteCurrent' configuration variable to 'warn' or 'ignore' in the remote repository to allow deleting the current branch, with or without a warning message. To squelch this message, you can set it to 'refuse'.
ta: இயல்பாக, தற்போதைய கிளையை நீக்குவது மறுக்கப்படுகிறது, ஏனெனில் அடுத்தது 'அறிவிலி நகலி' எந்தவொரு கோப்பையும் சரிபார்க்காது, இதனால் குழப்பம் ஏற்படாது. நீங்கள் 'receive.denyDeleteCurrent' உள்ளமைவு மாறியை அமைக்கலாம் தொலை களஞ்சியத்தில் 'முன்னறிவிப்பு' அல்லது 'புறக்கணி' தற்போதைய கிளை, முன்னறிவிப்பு செய்தியுடன் அல்லது இல்லாமல். இந்த செய்தியைக் கசக்க, நீங்கள் அதை 'மறுக்க' அமைக்கலாம்.

source: quiet
ta: அமைதியாக

source: you must specify a directory
ta: நீங்கள் ஒரு கோப்பகத்தைக் குறிப்பிட வேண்டும்

source: git reflog [show] [<log-options>] [<ref>]
ta: git reflog [show] [<log-options>] [<eff>]

source: git reflog expire [--expire=<time>] [--expire-unreachable=<time>] [--rewrite] [--updateref] [--stale-fix] [--dry-run | -n] [--verbose] [--all [--single-worktree] | <refs>...]
ta: git reflog expire [--expire=<நேரம்>] [--expire-unreachable=<நேரம்>] [--rewrite] [--updateref] [--stale-fix] [--dry-run | -n] [--verbose] [--all [--single-worktree] | <குறிப்புகள்>...]

source: git reflog delete [--rewrite] [--updateref] [--dry-run | -n] [--verbose] <ref>@{<specifier>}...
ta: git reflog அழி [-rewrite] [--updateref] [-உலர்ந்த-இயங்கும் | -n] [--verbose] <fef>@{<விவரக்குறிப்பு>} ...

source: git reflog exists <ref>
ta: அறிவிலி பிரதிபலிப்பு <ref> உள்ளது

source: invalid timestamp '%s' given to '--%s'
ta: தவறான நேர முத்திரை '%s' கொடுக்கப்பட்ட '-%s'

source: %s does not accept arguments: '%s'
ta: %s வாதங்களை ஏற்காது: '%s'

source: do not actually prune any entries
ta: உண்மையில் எந்த உள்ளீடுகளையும் கத்தரிக்க வேண்டாம்

source: rewrite the old SHA1 with the new SHA1 of the entry that now precedes it
ta: பழைய sha1 ஐ இப்போது நுழைந்த நுழைவின் புதிய sha1 உடன் மீண்டும் எழுதவும்

source: update the reference to the value of the top reflog entry
ta: சிறந்த பிரதிபலிப்பு உள்ளீட்டின் மதிப்புக்கான குறிப்பைப் புதுப்பிக்கவும்

source: print extra information on screen
ta: திரையில் கூடுதல் தகவல்களை அச்சிடுக

source: timestamp
ta: நேர முத்திரை

source: prune entries older than the specified time
ta: குறிப்பிட்ட நேரத்தை விட பழைய உள்ளீடுகளை கத்தரிக்காய்

source: prune entries older than <time> that are not reachable from the current tip of the branch
ta: கிளையின் தற்போதைய முனையிலிருந்து அடைய முடியாத <time> ஐ விட பழைய உள்ளீடுகளை கத்தரிக்காய்

source: prune any reflog entries that point to broken commits
ta: உடைந்த உறுதிடுகளை சுட்டிக்காட்டும் எந்த பிரதிபலிப்பு உள்ளீடுகளையும் கத்தரிக்கவும்

source: process the reflogs of all references
ta: அனைத்து குறிப்புகளின் பிரதிபலிப்புகளையும் செயலாக்கவும்

source: limits processing to reflogs from the current worktree only
ta: தற்போதைய பணியிடத்திலிருந்து மட்டுமே பிரதிபலிப்புகளுக்கு செயலாக்கத்தை கட்டுப்படுத்துகிறது

source: Marking reachable objects...
ta: அடையக்கூடிய பொருள்களைக் குறிக்கும் ...

source: no reflog specified to delete
ta: நீக்க எந்த பிரதிபலிப்பும் குறிப்பிடப்படவில்லை

source: invalid ref format: %s
ta: தவறான ref வடிவம்: %s

source: git remote add [-t <branch>] [-m <master>] [-f] [--tags | --no-tags] [--mirror=<fetch|push>] <name> <url>
ta: git remote add [-t <கிளை>] [-m <தலைவர்>] [-f] [--tags | --no-tags][--mirror=<fetch|push>] <பெயர்> <முகவரி>

source: git remote rename [--[no-]progress] <old> <new>
ta: git தொலை மறுபெயரிடு [-[இல்லை-] முன்னேற்றம்] <பழைய> <புதிய>

source: git remote remove <name>
ta: git தொலை அகற்று <பெயர்>

source: git remote set-head <name> (-a | --auto | -d | --delete | <branch>)
ta: git remote set-head <பெயர்> (-a | --auto | -d |--delete | <sblagn>)

source: git remote [-v | --verbose] show [-n] <name>
ta: git தொலை [-v | --verbose] காட்டு [-n] <name>

source: git remote prune [-n | --dry-run] <name>
ta: git தொலை ப்ரூன் [-n | -உலர்ந்த-இயங்கும்] <பெயர்>

source: git remote [-v | --verbose] update [-p | --prune] [(<group> | <remote>)...]
ta: git தொலை [-v | --verbose] புதுப்பிப்பு [-p | -பிரூன்] [(<குழு> | <தொலை>) ...]

source: git remote set-branches [--add] <name> <branch>...
ta: git தொலை செட்-கிளைகள் [--add] <பெயர்> <dank> ...

source: git remote get-url [--push] [--all] <name>
ta: git தொலை get-url [--push] [--all] <பெயர்>

source: git remote set-url [--push] <name> <newurl> [<oldurl>]
ta: git தொலை செட்-உர்எல் [--புச்] <amane> <newurl> [<ildurl>]

source: git remote set-url --add <name> <newurl>
ta: git தொலை செட்-உல் --add <பெயர்> <newurl>

source: git remote set-url --delete <name> <url>
ta: git remote set-url --delete <பெயர்> <முகவரி>

source: git remote add [<options>] <name> <url>
ta: git remote add [<விருப்பங்கள்>] <பெயர்> <முகவரி>

source: git remote set-branches <name> <branch>...
ta: git remote set-branches <பெயர்> <கிளை>...

source: git remote set-branches --add <name> <branch>...
ta: git remote set-branches --add <பெயர்> <கிளை>...

source: git remote show [<options>] <name>
ta: git தொலை சோ [<விருப்பங்கள்>] <பெயர்>

source: git remote prune [<options>] <name>
ta: git தொலை ப்ரூன் [<விருப்பங்கள்>] <பெயர்>

source: git remote update [<options>] [<group> | <remote>]...
ta: git தொலை புதுப்பிப்பு [<விருப்பங்கள்>] [<குழு> | <தொலை>] ...

source: Updating %s
ta: %s புதுப்பித்தல்

source: Could not fetch %s
ta: %s பெற முடியவில்லை

source: --mirror is dangerous and deprecated; please use --mirror=fetch or --mirror=push instead
ta: --mirror ஆபத்தானது மற்றும் நீக்கப்பட்டது; தயவு செய்து --mirror=fetch அல்லது அதற்கு பதிலாக --mirror=push பயன்படுத்தவும்

source: fetch the remote branches
ta: தொலைநிலை கிளைகளைப் பெறுங்கள்

source: import all tags and associated objects when fetching or do not fetch any tag at all (--no-tags)
ta: பெறும்போது அனைத்து குறிச்சொற்களையும் அதனுடன் தொடர்புடைய பொருட்களையும் இறக்குமதி செய்க அல்லது எந்த குறிச்சொல்லையும் பெற வேண்டாம் (--no-tags)

source: branch(es) to track
ta: கண்காணிக்க கிளை (கள்)

source: master branch
ta: முதன்மை கிளை

source: set up remote as a mirror to push to or fetch from
ta: ஒரு கண்ணாடியாக தொலைதூரத்தை அமைக்கவும் அல்லது பெற அல்லது பெற

source: specifying a master branch makes no sense with --mirror
ta: ஒரு முதல் கிளையைக் குறிப்பிடுவது --mirror உடன் எந்த பொருளும் இல்லை

source: specifying branches to track makes sense only with fetch mirrors
ta: கண்காணிக்க கிளைகளைக் குறிப்பிடுவது கண்ணாடியுடன் மட்டுமே பொருளுள்ளதாக இருக்கிறது

source: remote %s already exists.
ta: தொலை %s ஏற்கனவே உள்ளன.

source: Could not setup master '%s'
ta: மாச்டர் '%s' ஐ அமைக்க முடியவில்லை

source: more than one %s
ta: ஒரு %s

source: unhandled branch.%s.rebase=%s; assuming 'true'
ta: தடையற்ற கிளை.%s.rebase =%s; 'உண்மை' என்று கருதி

source: Could not get fetch map for refspec %s
ta: refspec %s க்கு வரைபடத்தைப் பெற முடியவில்லை

source: (matching)
ta: (பொருத்தம்)

source: (delete)
ta: (அழி)

source: could not set '%s'
ta: '%s' அமைக்க முடியவில்லை

source: could not unset '%s'
ta: '%s' அமைக்க முடியவில்லை

source: The %s configuration remote.pushDefault in: %s:%d now names the non-existent remote '%s'
ta: %s உள்ளமைவு remote.pushDefault: %s:%d இப்போது இல்லாத தொலை '%s' என்று பெயரிடுகிறது

source: No such remote: '%s'
ta: அத்தகைய தொலைநிலை இல்லை: '%s'

source: Could not rename config section '%s' to '%s'
ta: கட்டமைப்பு பிரிவை '%s' என மறுபெயரிட முடியவில்லை '%s'

source: Not updating non-default fetch refspec %s Please update the configuration manually if necessary.
ta: வீழ்ச்சி அல்லாதவற்றை புதுப்பிக்கவில்லை refspec %s தேவைப்பட்டால் உள்ளமைவை கைமுறையாக புதுப்பிக்கவும்.

source: Renaming remote references
ta: தொலைநிலை குறிப்புகளை மறுபெயரிடுதல்

source: deleting '%s' failed
ta: '%s' நீக்குவது தோல்வியடைந்தது

source: creating '%s' failed
ta: '%s' உருவாக்குவது தோல்வியடைந்தது

source: Note: A branch outside the refs/remotes/ hierarchy was not removed; to delete it, use:
ta: குறிப்பு: refs/remotes/ படிநிலைக்கு வெளியே ஒரு கிளை அகற்றப்படவில்லை; அதை நீக்க, பயன்படுத்தவும்:

source: Could not remove config section '%s'
ta: '%s' கட்டமைப்பு பிரிவை அகற்ற முடியவில்லை

source: new (next fetch will store in remotes/%s)
ta: புதியது (அடுத்த விருப்பு தொலைடுகளில்/%s இல் சேமிக்கப்படும்)

source: tracked
ta: கண்காணிக்கப்பட்டது

source: skipped
ta: தவிர்க்கப்பட்டது

source: stale (use 'git remote prune' to remove)
ta: பழைய (அகற்ற 'அறிவிலி தொலை ப்ரூன்' ஐப் பயன்படுத்தவும்)

source: invalid branch.%s.merge; cannot rebase onto > 1 branch
ta: தவறான கிளை.%s.merge; > 1 கிளையில் திரும்பப் பெற முடியாது

source: rebases interactively onto remote %s
ta: தொலை %s மீது ஊடாடும் வகையில் மறுதலிப்புகள்

source: rebases interactively (with merges) onto remote %s
ta: ஊடாடும் வகையில் (ஒன்றிணைப்புடன்) தொலையுடன் %s மறுதளமாக்கும்

source: rebases onto remote %s
ta: தொலை %s மீது மறுதளமாக்கும்

source: merges with remote %s
ta: தொலை %s உடன் ஒன்றிணைகிறது

source: merges with remote %s
ta: தொலை %s உடன் ஒன்றிணைகிறது

source: %-*s and with remote %s
ta: %-*s மற்றும் தொலை %s

source: create
ta: உருவாக்கு

source: delete
ta: அழி

source: up to date
ta: புதுப்பித்த நிலையில்

source: fast-forwardable
ta: வேகமாக முன்னோக்கி

source: local out of date
ta: உள்ளக காலத்திற்கு வெளியே

source: %-*s forces to %-*s (%s)
ta: %-*s படைகள் %-*s ( %s)

source: %-*s pushes to %-*s (%s)
ta: %-*s %-*s ( %s) க்கு தள்ளப்படுகின்றன

source: %-*s forces to %s
ta: %-*s படைகள் %s

source: %-*s pushes to %s
ta: %-*s %s க்கு தள்ளப்படுகின்றன

source: do not query remotes
ta: தொலைடுகளை வினவ வேண்டாம்

source: * remote %s
ta: * தொலை %s

source: Fetch URL: %s
ta: பெறு முகவரி: %s

source: Push URL: %s
ta: தள்ளு முகவரி: %s

source: (no URL)
ta: (url இல்லை)

source: HEAD branch: %s
ta: தலை கிளை: %s

source: (not queried)
ta: (வினவப்படவில்லை)

source: (unknown)
ta: (தெரியவில்லை)

source: HEAD branch (remote HEAD is ambiguous, may be one of the following):
ta: தலை கிளை (தொலைத் தலை தெளிவற்றது, பின்வருவனவற்றில் ஒன்றாக இருக்கலாம்):

source: Remote branch:%s
ta: தொலை கிளை:%s

source: (status not queried)
ta: (நிலை வினவவில்லை)

source: Local branch configured for 'git pull':
ta: 'அறிவிலி புல்' க்காக கட்டமைக்கப்பட்ட உள்ளக கிளை:

source: Local refs will be mirrored by 'git push'
ta: உள்ளக குறிப்புகள் 'அறிவிலி புச்' ஆல் பிரதிபலிக்கும்

source: Local ref configured for 'git push'%s:
ta: 'அறிவிலி புச்'%s க்காக கட்டமைக்கப்பட்ட உள்ளக ref:

source: set refs/remotes/<name>/HEAD according to remote
ta: தொலைவின் படி refs/remotes/<பெயர்>/HEAD ஐ அமை

source: delete refs/remotes/<name>/HEAD
ta: refs/remotes/<பெயர்>/HEAD நீக்கு

source: Cannot determine remote HEAD
ta: தொலை தலையை தீர்மானிக்க முடியாது

source: Multiple remote HEAD branches. Please choose one explicitly with:
ta: பல தொலைநிலை தலை கிளைகள். இதனுடன் வெளிப்படையாக ஒன்றைத் தேர்வுசெய்க:

source: Could not delete %s
ta: %s ஐ நீக்க முடியவில்லை

source: Not a valid ref: %s
ta: செல்லுபடியாகும் குறிப்பு அல்ல: %s

source: %s will become dangling!
ta: %s தொங்கிக்கொண்டிருக்கும்!

source: %s has become dangling!
ta: %s தொங்கிக்கொண்டுள்ளன!

source: Pruning %s
ta: கத்தரிக்காய் %s

source: * [would prune] %s
ta: * [கத்தரிக்காய்] %s

source: * [pruned] %s
ta: * [கத்தரிக்காய்] %s

source: prune remotes after fetching
ta: பெறப்பட்ட பிறகு தொலைடுகளை கத்தரிக்கவும்

source: No such remote '%s'
ta: அத்தகைய தொலை '%s' இல்லை

source: add branch
ta: கிளை சேர்க்கவும்

source: no remote specified
ta: தொலை குறிப்பிடப்படவில்லை

source: query push URLs rather than fetch URLs
ta: முகவரி களைப் பெறுவதை விட முகவரி களை வினவல் தள்ளுங்கள்

source: return all URLs
ta: எல்லா முகவரி களையும் திருப்பி விடுங்கள்

source: manipulate push URLs
ta: புச் முகவரி களைக் கையாளவும்

source: add URL
ta: முகவரி ஐச் சேர்க்கவும்

source: delete URLs
ta: முகவரி களை நீக்கு

source: --add --delete doesn't make sense
ta: --add --delete அர்த்துவதில்லை

source: Invalid old URL pattern: %s
ta: தவறான பழைய முகவரி முறை: %s

source: No such URL found: %s
ta: அத்தகைய முகவரி எதுவும் கிடைக்கவில்லை: %s

source: Will not delete all non-push URLs
ta: புச் அல்லாத அனைத்து முகவரி களையும் நீக்காது

source: be verbose; must be placed before a subcommand
ta: வாய்மொழியாக இருங்கள்; ஒரு துணைக்குழுவுக்கு முன் வைக்கப்பட வேண்டும்

source: Incremental repacks are incompatible with bitmap indexes. Use --no-write-bitmap-index or disable the pack.writeBitmaps configuration.
ta: bitmap குறியீடுகளுடன் அதிகரிக்கும் மறுபிரவேசங்கள் பொருந்தாது. --no-write-bitmap-index பயன்படுத்தவும் அல்லது pack.writeBitmaps கட்டமைப்பை அணை.

source: could not start pack-objects to repack promisor objects
ta: உறுதிமொழி பொருட்களை மறுபரிசீலனை செய்ய கட்டு-பொருள்களைத் தொடங்க முடியவில்லை

source: repack: Expecting full hex object ID lines only from pack-objects.
ta: மறுபிரவேசம்: கட்டு-பொருள்களிலிருந்து மட்டுமே முழு ஃச் பொருள் அடையாளம் கோடுகளை எதிர்பார்க்கிறது.

source: could not finish pack-objects to repack promisor objects
ta: உறுதிமொழி பொருட்களை மறுபரிசீலனை செய்ய கட்டு-பொருள்களை முடிக்க முடியவில்லை

source: cannot open index for %s
ta: %s க்கு குறியீட்டை திறக்க முடியாது

source: pack %s too large to consider in geometric progression
ta: வடிவியல் முன்னேற்றத்தில் கருத்தில் கொள்ள முடியாத %s மிகப் பெரியவை

source: pack %s too large to roll up
ta: பொதி %s உருட்ட மிகவும் பெரியவை

source: could not open tempfile %s for writing
ta: எழுதுவதற்கு டெம்பைஃபில் %s திறக்க முடியவில்லை

source: could not close refs snapshot tempfile
ta: ச்னாப்சாட் டெம்பைலை மூட முடியவில்லை

source: could not remove stale bitmap: %s
ta: பழமையான பிட்மேப்பை அகற்ற முடியவில்லை: %s

source: pack prefix %s does not begin with objdir %s
ta: கட்டு முன்னொட்டு %s objdir %s உடன் தொடங்காது

source: pack everything in a single pack
ta: எல்லாவற்றையும் ஒரே தொகுப்பில் கட்டு செய்யுங்கள்

source: same as -a, and turn unreachable objects loose
ta: -a ஐப் போலவே, அணுக முடியாத பொருள்களை தளர்வாக மாற்றவும்

source: same as -a, pack unreachable cruft objects separately
ta: -a ஐப் போலவே, அணுக முடியாத க்ரூஃப்ட் பொருள்களை தனித்தனியாக கட்டு செய்யுங்கள்

source: approxidate
ta: ஊடுருவும்

source: with --cruft, expire objects older than this
ta: --cruft உடன், இதை விட பழைய பொருட்களை காலாவதியாகுங்கள்

source: remove redundant packs, and run git-prune-packed
ta: தேவையற்ற பொதிகளை அகற்றி, git-prune-packed இயக்கவும்

source: pass --no-reuse-delta to git-pack-objects
ta: git-pack-objects க்கு --no-reuse-delta அனுப்பு

source: pass --no-reuse-object to git-pack-objects
ta: git-pack-objects க்கு --no-reuse-object அனுப்பு

source: do not run git-update-server-info
ta: git-update-server-info ஐ இயக்க வேண்டாம்

source: pass --local to git-pack-objects
ta: git-pack-objects க்கு --local அனுப்பு

source: write bitmap index
ta: பிட்மேப் குறியீட்டை எழுதுங்கள்

source: pass --delta-islands to git-pack-objects
ta: git-pack-objects க்கு --delta-islands அனுப்பு

source: with -A, do not loosen objects older than this
ta: -a உடன், இதை விட பழைய பொருட்களை தளர்த்த வேண்டாம்

source: with -a, repack unreachable objects
ta: -a உடன், அணுக முடியாத பொருள்களை மீண்டும் மாற்றவும்

source: size of the window used for delta compression
ta: டெல்டா சுருக்கத்திற்கு பயன்படுத்தப்படும் சாளரத்தின் அளவு

source: bytes
ta: பைட்டுகள்

source: same as the above, but limit memory size instead of entries count
ta: மேலே உள்ளவற்றைப் போலவே, ஆனால் உள்ளீடுகள் எண்ணிக்கைக்கு பதிலாக நினைவக அளவைக் கட்டுப்படுத்துங்கள்

source: limits the maximum delta depth
ta: அதிகபட்ச டெல்டா ஆழத்தை கட்டுப்படுத்துகிறது

source: limits the maximum number of threads
ta: அதிகபட்ச நூல்களைக் கட்டுப்படுத்துகிறது

source: maximum size of each packfile
ta: ஒவ்வொரு பேக்ஃபைலின் அதிகபட்ச அளவு

source: repack objects in packs marked with .keep
ta: .keep உடன் குறிக்கப்பட்ட பொதிகளில் பொருட்களை மீண்டும் மாற்றவும்

source: do not repack this pack
ta: இந்த பேக்கை மீண்டும் செய்ய வேண்டாம்

source: find a geometric progression with factor <N>
ta: காரணி <n> உடன் வடிவியல் முன்னேற்றத்தைக் கண்டறியவும்

source: write a multi-pack index of the resulting packs
ta: இதன் விளைவாக வரும் பொதிகளின் மல்டி கட்டு குறியீட்டை எழுதுங்கள்

source: pack prefix to store a pack containing filtered out objects
ta: வடிகட்டப்பட்ட பொருள்களைக் கொண்ட ஒரு பேக்கை சேமிக்க முன்னொட்டு

source: cannot delete packs in a precious-objects repo
ta: ஒரு விலைமதிப்பற்ற-பொருள் ரெப்போவில் பொதிகளை நீக்க முடியாது

source: option '%s' can only be used along with '%s'
ta: '%s' உடன் '%s' உடன் மட்டுமே பயன்படுத்த முடியும்

source: Nothing new to pack.
ta: கட்டு செய்ய புதிதாக எதுவும் இல்லை.

source: renaming pack to '%s' failed
ta: பேக்கை '%s' என மறுபெயரிடுவது தோல்வியடைந்தது

source: pack-objects did not write a '%s' file for pack %s-%s
ta: கட்டு-ஆப்செக்ட்ச் கட்டு%s-%s க்கு '%s' கோப்பை எழுதவில்லை

source: could not unlink: %s
ta: இணைக்க முடியவில்லை: %s

source: git replace [-f] <object> <replacement>
ta: git replace [-f] <oberce> <மாற்று>

source: git replace [-f] --edit <object>
ta: git replace [-f] --edit <பொருள்>
