Repository: Nizhal/git-ta-po
Catalog: po/*.po
Languages: ta

source: support for protocol v2 not implemented yet
ta: நெறிமுறை v2 க்கான உதவி இன்னும் செயல்படுத்தப்படவில்லை

source: transport '%s' not allowed
ta: போக்குவரத்து '%s' அனுமதிக்கப்படவில்லை

source: git-over-rsync is no longer supported
ta: git-over-rsync இனி ஆதரிக்கப்படாது

source: The following submodule paths contain changes that can not be found on any remote:
ta: பின்வரும் துணைதொகுதி பாதைகளில் மாற்றங்கள் உள்ளன எந்த தொலைதூரத்திலும் காணப்படவில்லை:

source: Please try git push --recurse-submodules=on-demand or cd to the path and use git push to push them to a remote.
ta: தயவுசெய்து முயற்சிக்கவும் git push --recurse-submodules=on-demand அல்லது பாதை மற்றும் பயன்பாட்டிற்கு குறுவட்டு git push அவற்றை தொலைதூரத்திற்கு தள்ள.

source: Aborting.
ta: கருக்கலைப்பு.

source: failed to push all needed submodules
ta: தேவையான அனைத்து துணைதொகுதிகளையும் தள்ளத் தவறிவிட்டது

source: bundle-uri operation not supported by protocol
ta: மூட்டை-யூரி செயல்பாடு நெறிமுறையால் ஆதரிக்கப்படவில்லை

source: could not retrieve server-advertised bundle-uri list
ta: சேவையக-விளம்பரப்படுத்தப்பட்ட மூட்டை-யுஆர்ஐ பட்டியலை மீட்டெடுக்க முடியவில்லை

source: operation not supported by protocol
ta: செயல்பாடு நெறிமுறையால் ஆதரிக்கப்படவில்லை

source: too-short tree object
ta: மிகக் குறுகிய மர பொருள்

source: malformed mode in tree entry
ta: மர நுழைவில் தவறாக பயன்முறை

source: empty filename in tree entry
ta: மர நுழைவாயிலில் வெற்று கோப்பு பெயர்

source: too-short tree file
ta: மிகக் குறுகிய மரக் கோப்பு

source: Your local changes to the following files would be overwritten by checkout: %%sPlease commit your changes or stash them before you switch branches.
ta: பின்வரும் கோப்புகளில் உங்கள் உள்ளக மாற்றங்கள் புதுப்பித்தால் மேலெழுதப்படும்: %% பிளவு உங்கள் மாற்றங்களைச் செய்யுங்கள் அல்லது நீங்கள் கிளைகளை மாற்றுவதற்கு முன்பு அவற்றைத் தட்டவும்.

source: Your local changes to the following files would be overwritten by checkout: %%s
ta: பின்வரும் கோப்புகளில் உங்கள் உள்ளக மாற்றங்கள் புதுப்பித்தால் மேலெழுதப்படும்: %% s

source: Your local changes to the following files would be overwritten by merge: %%sPlease commit your changes or stash them before you merge.
ta: பின்வரும் கோப்புகளில் உங்கள் உள்ளக மாற்றங்கள் ஒன்றிணைப்பதன் மூலம் மேலெழுதப்படும்: %% பிளவு உங்கள் மாற்றங்களைச் செய்யுங்கள் அல்லது நீங்கள் ஒன்றிணைவதற்கு முன் அவற்றை நிறுத்துங்கள்.

source: Your local changes to the following files would be overwritten by merge: %%s
ta: பின்வரும் கோப்புகளில் உங்கள் உள்ளக மாற்றங்கள் ஒன்றிணைப்பதன் மூலம் மேலெழுதப்படும்: %% s

source: Your local changes to the following files would be overwritten by %s: %%sPlease commit your changes or stash them before you %s.
ta: பின்வரும் கோப்புகளில் உங்கள் உள்ளக மாற்றங்கள் %s ஆல் மேலெழுதப்படும்: %% தயவுசெய்து உங்கள் மாற்றங்களைச் செய்யுங்கள் அல்லது நீங்கள் %s க்கு முன் அவற்றை நிறுத்துங்கள்.

source: Your local changes to the following files would be overwritten by %s: %%s
ta: பின்வரும் கோப்புகளில் உங்கள் உள்ளக மாற்றங்கள் %s ஆல் மேலெழுதப்படும்: %% s

source: Updating the following directories would lose untracked files in them: %s
ta: பின்வரும் கோப்பகங்களைப் புதுப்பிப்பது அவற்றில் கட்டுப்படுத்தப்படாத கோப்புகளை இழக்கும்: %s

source: Refusing to remove the current working directory: %s
ta: தற்போதைய பணி கோப்பகத்தை அகற்ற மறுக்கிறது: %s

source: The following untracked working tree files would be removed by checkout: %%sPlease move or remove them before you switch branches.
ta: பின்வரும் கட்டுப்படுத்தப்படாத பணி மரக் கோப்புகள் புதுப்பித்து மூலம் அகற்றப்படும்: %% நீங்கள் கிளைகளை மாற்றுவதற்கு முன் அவற்றை நகர்த்தவும் அல்லது அகற்றவும்.

source: The following untracked working tree files would be removed by checkout: %%s
ta: பின்வரும் கட்டுப்படுத்தப்படாத பணி மரக் கோப்புகள் புதுப்பித்து மூலம் அகற்றப்படும்: %% s

source: The following untracked working tree files would be removed by merge: %%sPlease move or remove them before you merge.
ta: ஒன்றிணைப்பதன் மூலம் பின்வரும் கட்டுப்படுத்தப்படாத பணி மரக் கோப்புகள் அகற்றப்படும்: நீங்கள் ஒன்றிணைவதற்கு முன் %% பிளவு நகர்த்தவும் அல்லது அகற்றவும்.

source: The following untracked working tree files would be removed by merge: %%s
ta: ஒன்றிணைப்பதன் மூலம் பின்வரும் கட்டுப்படுத்தப்படாத பணி மரக் கோப்புகள் அகற்றப்படும்: %% s

source: The following untracked working tree files would be removed by %s: %%sPlease move or remove them before you %s.
ta: பின்வரும் கட்டுப்படுத்தப்படாத பணி மரக் கோப்புகள் %s ஆல் அகற்றப்படும்: %% நீங்கள் %s க்கு முன் அவற்றை நகர்த்தவும் அல்லது அகற்றவும்.

source: The following untracked working tree files would be removed by %s: %%s
ta: பின்வரும் கட்டுப்படுத்தப்படாத பணி மரக் கோப்புகள் %s ஆல் அகற்றப்படும்: %% s

source: The following untracked working tree files would be overwritten by checkout: %%sPlease move or remove them before you switch branches.
ta: பின்வரும் கட்டுப்படுத்தப்படாத பணி மரக் கோப்புகள் புதுப்பித்தால் மேலெழுதப்படும்: %% நீங்கள் கிளைகளை மாற்றுவதற்கு முன் அவற்றை நகர்த்தவும் அல்லது அகற்றவும்.

source: The following untracked working tree files would be overwritten by checkout: %%s
ta: பின்வரும் கட்டுப்படுத்தப்படாத பணி மரக் கோப்புகள் புதுப்பித்தால் மேலெழுதப்படும்: %% s

source: The following untracked working tree files would be overwritten by merge: %%sPlease move or remove them before you merge.
ta: ஒன்றிணைப்பால் பின்வரும் கட்டுப்படுத்தப்படாத பணி மரக் கோப்புகள் மேலெழுதப்படும்: நீங்கள் ஒன்றிணைவதற்கு முன் %% பிளவு நகர்த்தவும் அல்லது அகற்றவும்.

source: The following untracked working tree files would be overwritten by merge: %%s
ta: ஒன்றிணைப்பால் பின்வரும் கட்டுப்படுத்தப்படாத பணி மரக் கோப்புகள் மேலெழுதப்படும்: %% s

source: The following untracked working tree files would be overwritten by %s: %%sPlease move or remove them before you %s.
ta: பின்வரும் கட்டுப்படுத்தப்படாத பணி மரக் கோப்புகள் %s ஆல் மேலெழுதப்படும்: %% நீங்கள் %s க்கு முன் அவற்றை நகர்த்தவும் அல்லது அகற்றவும்.

source: The following untracked working tree files would be overwritten by %s: %%s
ta: பின்வரும் கட்டுப்படுத்தப்படாத பணி மரக் கோப்புகள் %s ஆல் மேலெழுதப்படும்: %% s

source: Entry '%s' overlaps with '%s'. Cannot bind.
ta: நுழைவு '%s' '%s' உடன் ஒன்றுடன் ஒன்று. பிணைக்க முடியாது.

source: Cannot update submodule: %s
ta: துணைதொகுதியை புதுப்பிக்க முடியாது: %s

source: The following paths are not up to date and were left despite sparse patterns: %s
ta: பின்வரும் பாதைகள் புதுப்பித்தவை அல்ல, அவை சிதறிய வடிவங்கள் இருந்தபோதிலும் இருந்தன: %s

source: The following paths are unmerged and were left despite sparse patterns: %s
ta: பின்வரும் பாதைகள் அவிழ்க்கப்பட்டவை மற்றும் சிதறிய வடிவங்கள் இருந்தபோதிலும் எஞ்சியிருந்தன: %s

source: The following paths were already present and thus not updated despite sparse patterns: %s
ta: பின்வரும் பாதைகள் ஏற்கனவே இருந்தன, இதனால் சிதறிய வடிவங்கள் இருந்தபோதிலும் புதுப்பிக்கப்படவில்லை: %s

source: Aborting
ta: கருக்கலைப்பு

source: After fixing the above paths, you may want to run `git sparse-checkout reapply`.
ta: மேலே உள்ள பாதைகளை சரிசெய்த பிறகு, நீங்கள் `git sparse-checkout reapply` இயக்குங்கள்.

source: Updating files
ta: கோப்புகளைப் புதுப்பித்தல்

source: the following paths have collided (e.g. case-sensitive paths on a case-insensitive filesystem) and only one from the same colliding group is in the working tree:
ta: பின்வரும் பாதைகள் மோதியுள்ளன (எ.கா. வழக்கு-உணர்திறன் பாதைகள் ஒரு வழக்கு-உணர்திறன் கோப்பு முறைமையில்) மற்றும் ஒன்றிலிருந்து ஒன்று மட்டுமே மோதல் குழு பணி மரத்தில் உள்ளது:

source: Updating index flags
ta: குறியீட்டு கொடிகளைப் புதுப்பித்தல்

source: worktree and untracked commit have duplicate entries: %s
ta: பணியிடமும், கட்டுப்படுத்தப்படாத உறுதிப்பாடும் நகல் உள்ளீடுகளைக் கொண்டுள்ளன: %s

source: expected flush after fetch arguments
ta: வாதங்களைப் பெற்ற பிறகு எதிர்பார்க்கப்படும் பறிப்பு

source: invalid URL scheme name or missing '://' suffix
ta: தவறான முகவரி திட்டத்தின் பெயர் அல்லது காணவில்லை ': //' பின்னொட்டு

source: invalid %XX escape sequence
ta: தவறான %xx தப்பிக்கும் வரிசை

source: missing host and scheme is not 'file:'
ta: புரவலன் மற்றும் திட்டம் காணாமல் போனது 'கோப்பு:'

source: a 'file:' URL may not have a port number
ta: ஒரு 'கோப்பு:' முகவரி க்கு துறைமுகம் எண் இருக்காது

source: invalid characters in host name
ta: புரவலன் பெயரில் தவறான எழுத்துக்கள்

source: invalid port number
ta: தவறான துறைமுகம் எண்

source: invalid '..' path segment
ta: தவறான '..' பாதை பிரிவு

source: usage:
ta: பயன்பாடு:

source: fatal:
ta: அபாயகரமான:

source: error:
ta: பிழை:

source: warning:
ta: முன்னறிவிப்பு:

source: uname() failed with error '%s' (%d)
ta: '%s' (%d) பிழையுடன் uname () தோல்வியுற்றது

source: Fetching objects
ta: பொருட்களைப் பெறுதல்

source: '%s' at main working tree is not the repository directory
ta: முதன்மையான பணி மரத்தில் '%s' களஞ்சிய அடைவு அல்ல

source: '%s' file does not contain absolute path to the working tree location
ta: '%s' கோப்பில் பணி மரத்தின் இருப்பிடத்திற்கு முழுமையான பாதை இல்லை

source: '%s' is not a .git file, error code %d
ta: '%s' என்பது ஒரு .git கோப்பு அல்ல, பிழைக் குறியீடு %d

source: '%s' does not point back to '%s'
ta: '%s' '%s' க்கு சுட்டிக்காட்டாது

source: not a directory
ta: ஒரு அடைவு அல்ல

source: .git is not a file
ta: .git என்பது ஒரு கோப்பு அல்ல

source: .git file broken
ta: .சிட் கோப்பு உடைந்தது

source: .git file incorrect
ta: .சிட் கோப்பு தவறானது

source: not a valid path
ta: சரியான பாதை அல்ல

source: unable to locate repository; .git is not a file
ta: களஞ்சியத்தை கண்டுபிடிக்க முடியவில்லை; .git என்பது ஒரு கோப்பு அல்ல

source: unable to locate repository; .git file does not reference a repository
ta: களஞ்சியத்தை கண்டுபிடிக்க முடியவில்லை; .git கோப்பு ஒரு களஞ்சியத்தைக் குறிக்கவில்லை

source: unable to locate repository; .git file broken
ta: களஞ்சியத்தை கண்டுபிடிக்க முடியவில்லை; .சிட் கோப்பு உடைந்தது

source: gitdir unreadable
ta: கிடிர் படிக்க முடியாதது

source: gitdir incorrect
ta: கிடிர் தவறானது

source: not a valid directory
ta: செல்லுபடியாகும் அடைவு அல்ல

source: gitdir file does not exist
ta: கிடிர் கோப்பு இல்லை

source: unable to read gitdir file (%s)
ta: கிடிர் கோப்பைப் படிக்க முடியவில்லை (%s)

source: short read (expected %<PRIuMAX> bytes, read %<PRIuMAX>)
ta: குறுகிய வாசிப்பு (எதிர்பார்க்கப்படும் %<PRIuMAX> பைட்டுகள், படிக்க %<PRIuMAX>)

source: invalid gitdir file
ta: தவறான கிடிர் கோப்பு

source: gitdir file points to non-existent location
ta: கிடிர் கோப்பு இல்லாத இடத்தை சுட்டிக்காட்டுகிறது

source: unable to set %s in '%s'
ta: '%s' இல் %s ஐ அமைக்க முடியவில்லை

source: unable to unset %s in '%s'
ta: '%s' இல் %s இணைக்க முடியவில்லை

source: failed to set extensions.worktreeConfig setting
ta: extensions.worktreeConfig அமைப்பதில் தோல்வி

source: could not setenv '%s'
ta: '%s' செட்டென்வ் செய்ய முடியவில்லை

source: unable to create '%s'
ta: '%s' உருவாக்க முடியவில்லை

source: could not open '%s' for reading and writing
ta: வாசிப்பதற்கும் எழுதுவதற்கும் '%s' திறக்க முடியவில்லை

source: unable to access '%s'
ta: '%s' ஐ அணுக முடியவில்லை

source: unable to get current working directory
ta: தற்போதைய பணி கோப்பகத்தைப் பெற முடியவில்லை

source: unable to get random bytes
ta: சீரற்ற பைட்டுகளைப் பெற முடியவில்லை

source: attempting to mmap %<PRIuMAX> over limit %<PRIuMAX>
ta: mmap %<PRIuMAX> க்கு மேல் வரம்பு %<PRIuMAX> க்கு முயற்சிக்கிறது

source: mmap failed%s
ta: mmap தோல்வியுற்றது%s

source: Unmerged paths:
ta: அவிழ்க்கப்படாத பாதைகள்:

source: (use "git restore --staged <file>..." to unstage)
ta: ("git restore --staged <கோப்பு> ..." ஐப் பயன்படுத்துங்கள்

source: (use "git restore --source=%s --staged <file>..." to unstage)
ta: ("git restore --source=%s --staged <கோப்பு>..." ஐப் பயன்படுத்தவும்)

source: (use "git rm --cached <file>..." to unstage)
ta: ("git rm --cached <கோப்பு> ..." ஐப் பயன்படுத்தவும்)

source: (use "git add <file>..." to mark resolution)
ta: (தெளிவுத்திறனைக் குறிக்க "git add <கோப்பு> ..." ஐப் பயன்படுத்தவும்)

source: (use "git add/rm <file>..." as appropriate to mark resolution)
ta: (தெளிவுத்திறனைக் குறிக்க பொருத்தமான "அறிவிலி சேர்/ஆர்.எம் <கோப்பு> ..." ஐப் பயன்படுத்தவும்)

source: (use "git rm <file>..." to mark resolution)
ta: (தெளிவுத்திறனைக் குறிக்க "அறிவிலி ஆர்.எம் <கோப்பு> ..." ஐப் பயன்படுத்தவும்)

source: Changes to be committed:
ta: செய்ய வேண்டிய மாற்றங்கள்:

source: Changes not staged for commit:
ta: உறுதிடத்திற்காக நடத்தப்படாத மாற்றங்கள்:

source: (use "git add <file>..." to update what will be committed)
ta: (உறுதியானதைப் புதுப்பிக்க "அறிவிலி சேர் <file> ..." ஐப் பயன்படுத்தவும்)

source: (use "git add/rm <file>..." to update what will be committed)
ta: ("கிட் சேர்/ஆர்.எம் <கோப்பு> ..." ஐப் பயன்படுத்தவும்)

source: (use "git restore <file>..." to discard changes in working directory)
ta: (பணிபுரியும் கோப்பகத்தில் மாற்றங்களை நிராகரிக்க "அறிவிலி மீட்டமை <கோப்பு> ..." ஐப் பயன்படுத்தவும்)

source: (commit or discard the untracked or modified content in submodules)
ta: (commit or discard the untracked or மாற்றியமைக்கப்பட்ட content in submodules)

source: (use "git %s <file>..." to include in what will be committed)
ta: (use "git %s <file>..." பெறுநர் include in what will be committed)

source: both modified:
ta: both மாற்றியமைக்கப்பட்ட:

source: new file:
ta: புதிய file:

source: modified:
ta: மாற்றியமைக்கப்பட்ட:

source: new commits,
ta: புதிய commits,

source: modified content,
ta: மாற்றியமைக்கப்பட்ட content,

source: Your stash currently has %d entry
ta: your stash currently has %d நுழைவு

source: Submodule changes to be committed:
ta: submodule changes பெறுநர் be committed:

source: Do not modify or remove the line above. Everything below it will be ignored.
ta: do not modify or அகற்று the வரி above. everything below it will be ignored.

source: It took %.2f seconds to compute the branch ahead/behind values. You can use '--no-ahead-behind' to avoid this.
ta: it took %.2f நொடிகள் பெறுநர் compute the branch ahead/behind values. you can use '--no-ahead-behind' பெறுநர் avoid this.

source: You have unmerged paths.
ta: உங்களிடம் இணைக்காத பாதைகள் உள்ளன

source: (fix conflicts and run "git commit")
ta: (மோதல்களை சரிசெய்து மற்றும் ஓடு "git commit")

source: (use "git merge --abort" to abort the merge)
ta: ("git merge --abort" பயன்படுத்து abort the merge)

source: All conflicts fixed but you are still merging.
ta: அனைத்தும் conflicts fixed but you அரே still merging.

source: (use "git commit" to conclude merge)
ta: ("git commit" பெறுநர் conclude merge பயன்படுத்து)

source: You are in the middle of an am session.
ta: you அரே in the middle of an am session.

source: The current patch is empty.
ta: the மின்னோட்ட்ம், ஓட்டம் patch is empty.

source: (fix conflicts and then run "git am --continue")
ta: (fix conflicts and then ஓடு "git am --continue")

source: (use "git am --skip" to skip this patch)
ta: ("git am --skip" இதற்கு தவிர் this patch பயன்படுத்து)

source: (use "git am --allow-empty" to record this patch as an empty commit)
ta: ("git am --allow-empty" பெறுநர் record this patch அச் an வெறுமை commit பயன்படுத்து)

source: (use "git am --abort" to restore the original branch)
ta: ("git am --abort" பெறுநர் restore the original branch பயன்படுத்து)

source: No commands done.
ta: கட்டளைகள் எதுவும் செய்யப்படவில்லை.

source: Last command done (%<PRIuMAX> command done):
ta: கடைசியாக கட்டளை முடிந்தது (%<PRIuMAX> கட்டளை முடிந்தது):

source: (see more in file %s)
ta: (கோப்பு %s இல் மேலும் காண்க)

source: No commands remaining.
ta: கட்டளைகள் இல்லை.

source: Next command to do (%<PRIuMAX> remaining command):
ta: செய்ய அடுத்த கட்டளை (%<PRIuMAX> மீதமுள்ள கட்டளை):

source: (use "git rebase --edit-todo" to view and edit)
ta: (பார் திருத்தவும் "git rebase --edit-todo" ஐப் பயன்படுத்தவும்)

source: You are currently rebasing branch '%s' on '%s'.
ta: நீங்கள் தற்போது '%s' இல் கிளையை '%s' மீண்டும் செய்கிறீர்கள்.

source: You are currently rebasing.
ta: நீங்கள் தற்போது மீண்டும் வருகிறீர்கள்.

source: (fix conflicts and then run "git rebase --continue")
ta: (மோதல்களை சரிசெய்து, பின்னர் "git rebase --continue" ஐ இயக்கவும்)

source: (use "git rebase --skip" to skip this patch)
ta: (இந்த இணைப்பைத் தவிர்க்க "git rebase --skip" ஐப் பயன்படுத்தவும்)

source: (use "git rebase --abort" to check out the original branch)
ta: (அசல் கிளையைப் பார்க்க "git rebase --abort" ஐப் பயன்படுத்தவும்)

source: (all conflicts fixed: run "git rebase --continue")
ta: (அனைத்து மோதல்களும் சரி செய்யப்பட்டவை: "git rebase --continue" ஐ இயக்கவும்)

source: You are currently splitting a commit while rebasing branch '%s' on '%s'.
ta: '%s' இல் கிளையை '%s' மறுவடிவமைக்கும்போது நீங்கள் தற்போது ஒரு உறுதிப்பாட்டைப் பிரிக்கிறீர்கள்.

source: You are currently splitting a commit during a rebase.
ta: நீங்கள் தற்போது ஒரு மறுசீரமைப்பின் போது ஒரு உறுதிப்பாட்டைப் பிரிக்கிறீர்கள்.

source: (Once your working directory is clean, run "git rebase --continue")
ta: (உங்கள் பணி அடைவு சுத்தமாகிவிட்டால், "git rebase --continue" ஐ இயக்கவும்)

source: You are currently editing a commit while rebasing branch '%s' on '%s'.
ta: '%s' இல் கிளையை '%s' மீண்டும் மாற்றும்போது நீங்கள் தற்போது ஒரு உறுதிப்பாட்டைத் திருத்துகிறீர்கள்.

source: You are currently editing a commit during a rebase.
ta: நீங்கள் தற்போது ஒரு மறுசீரமைப்பின் போது ஒரு உறுதிப்பாட்டைத் திருத்துகிறீர்கள்.

source: (use "git commit --amend" to amend the current commit)
ta: (தற்போதைய உறுதிப்பாட்டை திருத்த "git commit --amend" ஐப் பயன்படுத்தவும்)

source: (use "git rebase --continue" once you are satisfied with your changes)
ta: (உங்கள் மாற்றங்களில் நீங்கள் நிறைவு அடைந்தவுடன் "git rebase --continue" ஐப் பயன்படுத்தவும்)

source: Cherry-pick currently in progress.
ta: செர்ரி-பிக் தற்போது முன்னேற்றத்தில் உள்ளது.

source: You are currently cherry-picking commit %s.
ta: நீங்கள் தற்போது செர்ரி-பிக்கிங் உறுதி %s.

source: (fix conflicts and run "git cherry-pick --continue")
ta: (மோதல்களை சரிசெய்து "git cherry-pick --continue" ஐ இயக்கவும்)

source: (run "git cherry-pick --continue" to continue)
ta: (தொடர "git cherry-pick --continue" ஐ இயக்கவும்)

source: (all conflicts fixed: run "git cherry-pick --continue")
ta: (அனைத்து மோதல்களும் சரி செய்யப்பட்டவை: "git cherry-pick --continue" ஐ இயக்கவும்)

source: (use "git cherry-pick --skip" to skip this patch)
ta: (இந்த பேட்சைத் தவிர்க்க "git cherry-pick --skip" ஐப் பயன்படுத்தவும்)

source: (use "git cherry-pick --abort" to cancel the cherry-pick operation)
ta: (செர்ரி-பிக் செயல்பாட்டை ரத்து செய்ய "git cherry-pick --abort" ஐப் பயன்படுத்தவும்)

source: Revert currently in progress.
ta: தற்போது முன்னேற்றத்தில் உள்ளது.

source: You are currently reverting commit %s.
ta: நீங்கள் தற்போது உறுதி %s.

source: (fix conflicts and run "git revert --continue")
ta: (மோதல்களை சரிசெய்து "git revert --continue" ஐ இயக்கவும்)

source: (run "git revert --continue" to continue)
ta: (தொடர "git revert --continue" ஐ இயக்கவும்)

source: (all conflicts fixed: run "git revert --continue")
ta: (அனைத்து மோதல்களும் சரி செய்யப்பட்டவை: "git revert --continue" ஐ இயக்கவும்)

source: (use "git revert --skip" to skip this patch)
ta: (இந்த இணைப்பைத் தவிர்க்க "git revert --skip" ஐப் பயன்படுத்தவும்)

source: (use "git revert --abort" to cancel the revert operation)
ta: (தலைகீழ் செயல்பாட்டை ரத்து செய்ய "git revert --abort" ஐப் பயன்படுத்தவும்)

source: You are currently bisecting, started from branch '%s'.
ta: நீங்கள் தற்போது பிரிந்து, கிளையிலிருந்து '%s' இலிருந்து தொடங்குகிறீர்கள்.

source: You are currently bisecting.
ta: நீங்கள் தற்போது பிரிந்து செல்கிறீர்கள்.

source: (use "git bisect reset" to get back to the original branch)
ta: (அசல் கிளைக்கு திரும்ப "git bisect reset" ஐ பயன்படுத்தவும்)

source: You are in a sparse checkout.
ta: நீங்கள் ஒரு சிதறிய புதுப்பித்தலில் இருக்கிறீர்கள்.

source: You are in a sparse checkout with %d%% of tracked files present.
ta: கண்காணிக்கப்பட்ட கோப்புகளின்%d %% உடன் நீங்கள் ஒரு சிதறிய புதுப்பித்தலில் இருக்கிறீர்கள்.

source: On branch
ta: கிளையில்

source: interactive rebase in progress; onto
ta: ஊடாடும் மறுசீரமைப்பு செயலில் உள்ளது; மீது

source: rebase in progress; onto
ta: செயலிழப்பு மீளுருவாக்கம்; மீது

source: HEAD detached at
ta: தலை பிரிக்கப்பட்டுள்ளது

source: HEAD detached from
ta: தலை பிரிக்கப்பட்டுள்ளது

source: Not currently on any branch.
ta: தற்போது எந்த கிளையிலும் இல்லை.

source: Initial commit
ta: தொடக்க உறுதிப்பாடு

source: No commits yet
ta: இன்னும் உறுதிடுகள் இல்லை

source: Untracked files
ta: கட்டுப்படுத்தப்படாத கோப்புகள்

source: Ignored files
ta: புறக்கணிக்கப்பட்ட கோப்புகள்

source: It took %.2f seconds to enumerate untracked files, but the results were cached, and subsequent runs may be faster.
ta: கட்டுப்படுத்தப்படாத கோப்புகளை கணக்கிட %.2f வினாடிகள் எடுத்தது, ஆனால் முடிவுகள் தற்காலிக சேமிக்கப்பட்டன, அடுத்தடுத்த ரன்கள் வேகமாக இருக்கலாம்.

source: It took %.2f seconds to enumerate untracked files.
ta: கட்டுப்படுத்தப்படாத கோப்புகளை கணக்கிட %.2f வினாடிகள் ஆனது.

source: See 'git help status' for information on how to improve this.
ta: இதை எவ்வாறு மேம்படுத்துவது என்பது குறித்த தகவலுக்கு 'அறிவிலி உதவி நிலை' ஐப் பார்.

source: Untracked files not listed%s
ta: கட்டுப்படுத்தப்படாத கோப்புகள்%s பட்டியலிடப்படவில்லை

source: (use -u option to show untracked files)
ta: (கட்டுப்படுத்தப்படாத கோப்புகளைக் காட்ட -u விருப்பத்தைப் பயன்படுத்தவும்)

source: No changes
ta: எந்த மாற்றங்களும் இல்லை

source: no changes added to commit (use "git add" and/or "git commit -a")
ta: உறுதிப்பாட்டில் எந்த மாற்றங்களும் சேர்க்கப்படவில்லை ("கிட் சேர்" மற்றும்/அல்லது "அறிவிலி உறுதி -ஏ" ஐப் பயன்படுத்தவும்)

source: no changes added to commit
ta: உறுதிப்பாட்டில் எந்த மாற்றங்களும் சேர்க்கப்படவில்லை

source: nothing added to commit but untracked files present (use "git add" to track)
ta: கட்டமைக்கப்படாத கோப்புகள் எதுவும் சேர்க்கப்படவில்லை (கண்காணிக்க "அறிவிலி சேர்" ஐப் பயன்படுத்தவும்)

source: nothing added to commit but untracked files present
ta: கட்டமைப்பிற்கு எதுவும் சேர்க்கப்படவில்லை, ஆனால் தடையற்ற கோப்புகள் உள்ளன

source: nothing to commit (create/copy files and use "git add" to track)
ta: செய்ய எதுவும் இல்லை (கோப்புகளை உருவாக்க/நகலெடுத்து, கண்காணிக்க "அறிவிலி சேர்" ஐப் பயன்படுத்தவும்)

source: nothing to commit
ta: செய்ய எதுவும் இல்லை

source: nothing to commit (use -u to show untracked files)
ta: செய்ய எதுவும் இல்லை (கட்டுப்படுத்தப்படாத கோப்புகளைக் காட்ட -u ஐப் பயன்படுத்தவும்)

source: nothing to commit, working tree clean
ta: செய்ய எதுவும் இல்லை, பணி மரம் சுத்தமாக

source: No commits yet on
ta: இன்னும் உறுதிடுகள் இல்லை

source: HEAD (no branch)
ta: தலை (கிளை இல்லை)

source: different
ta: வெவ்வேறு

source: behind
ta: பின்னால்

source: ahead
ta: முன்னால்

source: cannot %s: You have unstaged changes.
ta: %s: உங்களிடம் நிலையற்ற மாற்றங்கள் உள்ளன.

source: additionally, your index contains uncommitted changes.
ta: கூடுதலாக, உங்கள் குறியீட்டில் சேர்க்கப்படாத மாற்றங்கள் உள்ளன.

source: cannot %s: Your index contains uncommitted changes.
ta: %s முடியாது: உங்கள் குறியீட்டில் சேர்க்கப்படாத மாற்றங்கள் உள்ளன.

source: unknown style '%s' given for '%s'
ta: அறியப்படாத பாணி '%s' '%s' க்கு கொடுக்கப்பட்டுள்ளது

source: Error: Your local changes to the following files would be overwritten by merge
ta: பிழை: பின்வரும் கோப்புகளில் உங்கள் உள்ளக மாற்றங்கள் ஒன்றிணைப்பதன் மூலம் மேலெழுதப்படும்

source: Automated merge did not work.
ta: தானியங்கு ஒன்றிணைப்பு பணி செய்யவில்லை.

source: Should not be doing an octopus.
ta: ஆக்டோபச் செய்யக்கூடாது.

source: Unable to find common commit with $pretty_name
ta: $pretty_name உடன் பொதுவான உறுதிப்பாட்டைக் கண்டுபிடிக்க முடியவில்லை

source: Already up to date with $pretty_name
ta: ஏற்கனவே $pretty_name உடன் புதுப்பித்த நிலையில் உள்ளது

source: Fast-forwarding to: $pretty_name
ta: வேகமாக முன்னோக்கி: $pretty_name

source: Trying simple merge with $pretty_name
ta: $pretty_name உடன் எளிய ஒன்றிணைக்க முயற்சிக்கிறது

source: Simple merge did not work, trying automatic merge.
ta: எளிய ஒன்றிணைப்பு பணி செய்யவில்லை, தானியங்கி ஒன்றிணைக்க முயற்சிக்கிறது.

source: usage: $dashless $USAGE
ta: பயன்பாடு: $dashless $USAGE

source: Cannot chdir to $cdup, the toplevel of the working tree
ta: $cdup பாதைக்கு மாற்று முடியாது, பணி மரத்தின் மேல்மட்டம்

source: fatal: $program_name cannot be used without a working tree.
ta: அபாயகரமான: $program_name பணி மரம் இல்லாமல் பயன்படுத்த முடியாது.
