Repository: Nizhal/git-ta-po
Catalog: po/*.po
Languages: ta

source: Server does not support --shallow-since
ta: சேவையகம் --shallow-since ஆதரிக்கவில்லை

source: Server does not support --shallow-exclude
ta: சேவையகம் ஆதரிக்காது --shallow-exclude

source: Server does not support --deepen
ta: சேவையகம் ஆதரிக்காது --deepen

source: Server does not support this repository's object format
ta: இந்த களஞ்சியத்தின் பொருள் வடிவமைப்பை சேவையகம் ஆதரிக்காது

source: no common commits
ta: பொதுவான உறுதிடுகள் இல்லை

source: git fetch-pack: fetch failed.
ta: git fetch-pack: ஃபெட்ச் தோல்வியுற்றது.

source: mismatched algorithms: client %s; server %s
ta: பொருந்தாத வழிமுறைகள்: கிளையன்ட் %s; சேவையகம் %s

source: the server does not support algorithm '%s'
ta: சேவையகம் '%s' வழிமுறையை ஆதரிக்கவில்லை

source: Server does not support shallow requests
ta: சேவையகம் ஆழமற்ற கோரிக்கைகளை ஆதரிக்காது

source: unable to write request to remote
ta: தொலைதூரத்திற்கான கோரிக்கையை எழுத முடியவில்லை

source: expected '%s', received '%s'
ta: '%s' என்று எதிர்பார்க்கப்படுகிறது, '%s' பெறப்பட்டது

source: expected '%s'
ta: எதிர்பார்க்கப்படும் '%s'

source: unexpected acknowledgment line: '%s'
ta: எதிர்பாராத ஒப்புதல் வரி: '%s'

source: error processing acks: %d
ta: பிழை செயலாக்கம் acks: %d

source: expected packfile to be sent after '%s'
ta: '%s' க்குப் பிறகு அனுப்பப்படும் என்று எதிர்பார்க்கப்படுகிறது

source: expected no other sections to be sent after no '%s'
ta: '%s' இல்லாத பிறகு வேறு எந்த பிரிவுகளும் அனுப்பப்படாது என்று எதிர்பார்க்கப்படுகிறது

source: error processing shallow info: %d
ta: பிழை செயலாக்கம் ஆழமற்ற தகவல்: %d

source: expected wanted-ref, got '%s'
ta: எதிர்பார்க்கப்பட்ட வாண்டட்-ரெஃப், '%s' கிடைத்தது

source: unexpected wanted-ref: '%s'
ta: எதிர்பாராத வாண்டட்-ரெஃப்: '%s'

source: error processing wanted refs: %d
ta: பிழை செயலாக்கம் தேவை குறிப்புகள்: %d

source: git fetch-pack: expected response end packet
ta: git fetch-pack: எதிர்பார்க்கப்படும் மறுமொழி இறுதி பாக்கெட்

source: no matching remote head
ta: பொருந்தக்கூடிய தொலை எட் இல்லை

source: unexpected 'ready' from remote
ta: தொலைதூரத்திலிருந்து எதிர்பாராத 'ஆயத்தம்'

source: no such remote ref %s
ta: அத்தகைய தொலை ரெஃப் %s இல்லை

source: Server does not allow request for unadvertised object %s
ta: சேர்க்கப்படாத பொருள் %s க்கான கோரிக்கையை சேவையகம் அனுமதிக்காது

source: fsmonitor_ipc__send_query: invalid path '%s'
ta: fsmonitor_ipc__send_query: தவறான பாதை '%s'

source: fsmonitor_ipc__send_query: unspecified error on '%s'
ta: fsmonitor_ipc__send_query: '%s' இல் குறிப்பிடப்படாத பிழை

source: fsmonitor--daemon is not running
ta: fsmonitor--daemon இயங்கவில்லை

source: could not send '%s' command to fsmonitor--daemon
ta: '%s' கட்டளையை fsmonitor--daemon க்கு அனுப்ப முடியவில்லை

source: bare repository '%s' is incompatible with fsmonitor
ta: வெற்று களஞ்சியம் '%s' fsmoniter உடன் பொருந்தாது

source: repository '%s' is incompatible with fsmonitor due to errors
ta: பிழைகள் காரணமாக களஞ்சியம் '%s' fsmonitor உடன் பொருந்தாது

source: remote repository '%s' is incompatible with fsmonitor
ta: தொலை களஞ்சியத்தை '%s' fsmonitor உடன் பொருந்தாது

source: virtual repository '%s' is incompatible with fsmonitor
ta: மெய்நிகர் களஞ்சியம் '%s' fsmonitor உடன் பொருந்தாது

source: socket directory '%s' is incompatible with fsmonitor due to lack of Unix sockets support
ta: யுனிக்ச் சாக்கெட்டுகள் உதவி இல்லாததால் சாக்கெட் அடைவு '%s' fsmonitor உடன் பொருந்தாது

source: 'git help -a' and 'git help -g' list available subcommands and some concept guides. See 'git help <command>' or 'git help <concept>' to read about a specific subcommand or concept. See 'git help git' for an overview of the system.
ta: 'git உதவி -a' மற்றும் 'git உதவி -g' பட்டியல் கிடைக்கக்கூடிய துணைக் கட்டளைகள் மற்றும் சில கருத்து வழிகாட்டிகள். 'அறிவிலி உதவி <கட்டளை>' அல்லது 'அறிவிலி உதவி <concet>' ஐப் பார் ஒரு குறிப்பிட்ட துணைக் கட்டளை அல்லது கருத்தைப் பற்றி படிக்க. கணினியின் கண்ணோட்டத்திற்கு 'அறிவிலி உதவி அறிவிலி' ஐப் பார்.

source: unsupported command listing type '%s'
ta: ஆதரிக்கப்படாத கட்டளை பட்டியல் வகை '%s'

source: no directory given for '%s' option
ta: '%s' விருப்பத்திற்கு எந்த கோப்பகமும் கொடுக்கப்படவில்லை

source: no namespace given for --namespace
ta: --namespace க்கு பெயர்வெளி வழங்கப்படவில்லை

source: -c expects a configuration string
ta: -c ஒரு உள்ளமைவு சரத்தை எதிர்பார்க்கிறது

source: no config key given for --config-env
ta: --config-env க்கு கட்டமைப்பு விசை எதுவும் கொடுக்கப்படவில்லை

source: no attribute source given for --attr-source
ta: --attr-source க்கு பண்புக்கூறு மூலமும் வழங்கப்படவில்லை

source: unknown option: %s
ta: தெரியாத விருப்பம்: %s

source: while expanding alias '%s': '%s'
ta: '%s' என்ற மாற்றுப்பெயரை விரிவுபடுத்தும் போது: '%s'

source: alias '%s' changes environment variables. You can use '!git' in the alias to do this
ta: மாற்றுப்பெயர் '%s' சுற்றுச்சூழல் மாறிகளை மாற்றுகின்றன. இதைச் செய்ய நீங்கள் மாற்றுப்பெயரில் '! அறிவிலி' பயன்படுத்தலாம்

source: empty alias for %s
ta: %s க்கு வெற்று மாற்றுப்பெயர்

source: recursive alias: %s
ta: சுழல்நிலை மாற்றுப்பெயர்: %s

source: write failure on standard output
ta: நிலையான வெளியீட்டில் தோல்வி எழுதுங்கள்

source: unknown write failure on standard output
ta: நிலையான வெளியீட்டில் தெரியாத எழுதும் தோல்வி

source: close failed on standard output
ta: நிலையான வெளியீட்டில் மூடு தோல்வியடைந்தது

source: alias loop detected: expansion of '%s' does not terminate:%s
ta: மாற்றுப்பெயர் லூப் கண்டறியப்பட்டது: '%s' இன் விரிவாக்கம் நிறுத்தப்படாது:%s

source: cannot handle %s as a builtin
ta: %s ஐ ஒரு பில்டினாக கையாள முடியாது

source: usage: %s
ta: பயன்பாடு: %s

source: expansion of alias '%s' failed; '%s' is not a git command
ta: மாற்றுப்பெயரின் விரிவாக்கம் '%s' தோல்வியுற்றது; '%s' என்பது ஒரு அறிவிலி கட்டளை அல்ல

source: failed to run command '%s': %s
ta: '%s' கட்டளையை இயக்குவதில் தோல்வி: %s

source: could not create temporary file
ta: தற்காலிக கோப்பை உருவாக்க முடியவில்லை

source: failed writing detached signature to '%s'
ta: '%s' க்கு பிரிக்கப்பட்ட கையொப்பத்தை எழுதுவது தோல்வியுற்றது

source: gpg.ssh.allowedSignersFile needs to be configured and exist for ssh signature verification
ta: gpg.ssh.allowedSignersFile கட்டமைக்கப்பட வேண்டும் மற்றும் பாஓடு கையொப்ப சரிபார்ப்புக்கு இருக்க வேண்டும்

source: ssh-keygen -Y find-principals/verify is needed for ssh signature verification (available in openssh version 8.2p1+)
ta: ssh-keygen -y find-principals/சரிபார்ப்பு பாஓடு கையொப்ப சரிபார்ப்புக்கு தேவை (openssh பதிப்பு 8.2p1+இல் கிடைக்கிறது)

source: ssh signing revocation file configured but not found: %s
ta: பாஓடு கையொப்பமிடுதல் திரும்பப்பெறுதல் கோப்பு கட்டமைக்கப்பட்ட ஆனால் காணப்படவில்லை: %s

source: bad/incompatible signature '%s'
ta: மோசமான/பொருந்தாத கையொப்பம் '%s'

source: failed to get the ssh fingerprint for key '%s'
ta: முக்கிய '%s' க்கான பாஓடு கைரேகையைப் பெறுவதில் தோல்வி

source: either user.signingkey or gpg.ssh.defaultKeyCommand needs to be configured
ta: user.signingkey அல்லது gpg.ssh.defaultKeyCommand கட்டமைக்கப்பட வேண்டும்

source: gpg.ssh.defaultKeyCommand succeeded but returned no keys: %s %s
ta: gpg.ssh.defaultKeyCommand செய் பெற்றது, ஆனால் விசைகள் இல்லை: %s %s

source: gpg.ssh.defaultKeyCommand failed: %s %s
ta: gpg.ssh.defaultKeyCommand தோல்வியுற்றது: %s %s

source: user.signingKey needs to be set for ssh signing
ta: பாஓடு கையொப்பமிடுவதற்கு user.signingKey அமைக்கப்பட வேண்டும்

source: failed writing ssh signing key to '%s'
ta: '%s' க்கு பாஓடு கையொப்பமிடும் விசையை எழுதுவது தோல்வியுற்றது

source: failed writing ssh signing key buffer to '%s'
ta: '%s' க்கு பாஓடு கையொப்பமிடும் முக்கிய இடையகத்தை எழுதுவதில் தோல்வி

source: ssh-keygen -Y sign is needed for ssh signing (available in openssh version 8.2p1+)
ta: பாஓடு கையொப்பத்திற்கு பாஓடு -keygen -y அடையாளம் தேவை (openssh பதிப்பு 8.2p1+இல் கிடைக்கிறது)

source: failed reading ssh signing data buffer from '%s'
ta: '%s' இலிருந்து தரவு இடையகத்தை பாஓடு கையொப்பமிடுவது தோல்வியுற்றது

source: ignored invalid color '%.*s' in log.graphColors
ta: புறக்கணிக்கப்பட்ட தவறான வண்ணம் '%.*s' log.graphColors

source: given pattern contains NULL byte (via -f <file>). This is only supported with -P under PCRE v2
ta: கொடுக்கப்பட்ட வடிவத்தில் null byte (via -f <file>) உள்ளது. இது pcre v2 இன் கீழ் -p உடன் மட்டுமே ஆதரிக்கப்படுகிறது

source: '%s': unable to read %s
ta: '%s': %s படிக்க முடியவில்லை

source: '%s': short read
ta: '%s': குறுகிய வாசிப்பு

source: start a working area (see also: git help tutorial)
ta: பணி பகுதியைத் தொடங்கவும் (மேலும் காண்க: அறிவிலி உதவி டுடோரியல்)

source: work on the current change (see also: git help everyday)
ta: தற்போதைய மாற்றத்தில் பணி செய்யுங்கள் (மேலும் காண்க: அறிவிலி அன்றாடம்)

source: examine the history and state (see also: git help revisions)
ta: வரலாறு மற்றும் மாநிலத்தை ஆராயுங்கள் (மேலும் காண்க: அறிவிலி உதவி திருத்தங்கள்)

source: grow, mark and tweak your common history
ta: உங்கள் பொதுவான வரலாற்றை வளர்க்கவும், குறிக்கவும், மாற்றவும்

source: collaborate (see also: git help workflows)
ta: ஒத்துழைக்கவும் (மேலும் காண்க: git உதவி பணிப்பாய்வு)

source: Main Porcelain Commands
ta: முதன்மையான பீங்கான் கட்டளைகள்

source: Ancillary Commands / Manipulators
ta: துணை கட்டளைகள் / கையாளுபவர்கள்

source: Ancillary Commands / Interrogators
ta: துணை கட்டளைகள் / விசாரணையாளர்கள்

source: Interacting with Others
ta: மற்றவர்களுடன் தொடர்புகொள்வது

source: Low-level Commands / Manipulators
ta: குறைந்த அளவிலான கட்டளைகள் / கையாளுபவர்கள்

source: Low-level Commands / Interrogators
ta: குறைந்த அளவிலான கட்டளைகள் / விசாரணையாளர்கள்

source: Low-level Commands / Syncing Repositories
ta: குறைந்த அளவிலான கட்டளைகள் / களஞ்சியங்களை ஒத்திசைத்தல்

source: Low-level Commands / Internal Helpers
ta: குறைந்த அளவிலான கட்டளைகள் / உள் உதவியாளர்கள்

source: User-facing repository, command and file interfaces
ta: பயனர் எதிர்கொள்ளும் களஞ்சியம், கட்டளை மற்றும் கோப்பு இடைமுகங்கள்

source: Developer-facing file formats, protocols and other interfaces
ta: உருவாக்குபவர் எதிர்கொள்ளும் கோப்பு வடிவங்கள், நெறிமுறைகள் மற்றும் பிற இடைமுகங்கள்

source: available git commands in '%s'
ta: கிடைக்கக்கூடிய அறிவிலி கட்டளைகள் '%s'

source: git commands available from elsewhere on your $PATH
ta: உங்கள் $PATH இல் வேறு இடங்களிலிருந்து அறிவிலி கட்டளைகள் கிடைக்கின்றன

source: These are common Git commands used in various situations:
ta: இவை பல்வேறு சூழ்நிலைகளில் பயன்படுத்தப்படும் பொதுவான அறிவிலி கட்டளைகள்:

source: The Git concept guides are:
ta: அறிவிலி கருத்து வழிகாட்டிகள்:

source: User-facing repository, command and file interfaces:
ta: பயனர் எதிர்கொள்ளும் களஞ்சியம், கட்டளை மற்றும் கோப்பு இடைமுகங்கள்:

source: File formats, protocols and other developer interfaces:
ta: கோப்பு வடிவங்கள், நெறிமுறைகள் மற்றும் பிற உருவாக்குபவர் இடைமுகங்கள்:

source: External commands
ta: வெளிப்புற கட்டளைகள்

source: Command aliases
ta: கட்டளை மாற்றுப்பெயர்கள்

source: See 'git help <command>' to read about a specific subcommand
ta: ஒரு குறிப்பிட்ட துணைக் கட்டளை பற்றி படிக்க 'அறிவிலி உதவி <கட்டளை>' ஐப் பார்

source: '%s' appears to be a git command, but we were not able to execute it. Maybe git-%s is broken?
ta: '%s' ஒரு அறிவிலி கட்டளையாகத் தோன்றுகிறது, ஆனால் நாங்கள் இல்லை அதை இயக்க முடியும். ஒருவேளை அறிவிலி-%s உடைந்துவிட்டனவா?

source: git: '%s' is not a git command. See 'git --help'.
ta: அறிவிலி: '%s' ஒரு அறிவிலி கட்டளை அல்ல. 'git --help' ஐப் பார்.

source: Uh oh. Your system reports no Git commands at all.
ta: அட டா. உங்கள் கணினி எந்த அறிவிலி கட்டளைகளையும் தெரிவிக்கிறது.

source: WARNING: You called a Git command named '%s', which does not exist.
ta: முன்னறிவிப்பு: நீங்கள் '%s' என்ற அறிவிலி கட்டளையை அழைத்தீர்கள், அது இல்லை.

source: Continuing under the assumption that you meant '%s'.
ta: நீங்கள் '%s' என்று பொருள் என்ற அனுமானத்தின் கீழ் தொடர்கிறீர்கள்.

source: Run '%s' instead [y/N]?
ta: அதற்கு பதிலாக '%s' ஐ இயக்கவா?

source: Continuing in %0.1f seconds, assuming that you meant '%s'.
ta: %0.1f வினாடிகளில் தொடர்கிறது, நீங்கள் '%s' என்று பொருள் என்று கருதி.

source: The most similar command is
ta: மிகவும் ஒத்த கட்டளை

source: git version [--build-options]
ta: அறிவிலி பதிப்பு [--கட்டளை-விருப்பங்கள்]

source: Did you mean this?
ta: இதை நீங்கள் சொன்னீர்களா?

source: not a git repository
ta: ஒரு அறிவிலி களஞ்சியம் அல்ல

source: argument to --packfile must be a valid hash (got '%s')
ta: --packfile க்கு உரையாடல் செல்லுபடியாகும் ஆச் ஆக இருக்க வேண்டும் (கிடைத்தது '%s')

source: negative value for http.postBuffer; defaulting to %d
ta: http.postBuffer க்கான எதிர்மறை மதிப்பு; %d க்கு இயல்புநிலை

source: Delegation control is not supported with cURL < 7.22.0
ta: தூதுக்கு கட்டுப்பாடு சுருட்டை <7.22.0 உடன் ஆதரிக்கப்படவில்லை

source: failed to parse %s
ta: %s அலசத் தவறிவிட்டது

source: Unsupported SSL backend '%s'. Supported SSL backends:
ta: ஆதரிக்கப்படாத எச்எச்எல் பின்தளத்தில் '%s'. ஆதரிக்கப்பட்ட ssl பின்தளத்தில்:

source: Could not set SSL backend to '%s': cURL was built without SSL backends
ta: ssl பின்தளத்தில் '%s' க்கு அமைக்க முடியவில்லை: ssl பின்தளத்தில் இல்லாமல் சுருட்டை கட்டப்பட்டது

source: Could not set SSL backend to '%s': already set
ta: எச்எச்எல் பின்தளத்தில் '%s' என அமைக்க முடியவில்லை: ஏற்கனவே அமைக்கப்பட்டுள்ளது

source: unable to update url base from redirection: asked for: %s redirect: %s
ta: திசைதிருப்பலில் இருந்து முகவரி தளத்தைப் புதுப்பிக்க முடியவில்லை: கேட்டார்: %s திருப்பி விடுங்கள்: %s

source: Author identity unknown
ta: ஆசிரியர் அடையாளம் தெரியவில்லை

source: Committer identity unknown
ta: கமிசர் அடையாளம் தெரியவில்லை

source: *** Please tell me who you are. Run git config --global user.email "you@example.com" git config --global user.name "Your Name" to set your account's default identity. Omit --global to set the identity only in this repository.
ta: *** தயவுசெய்து நீங்கள் யார் என்று சொல்லுங்கள். ஓடு git config --global user.email "பெயர்@தளம்.வணிக" git config --global user.name "உங்கள் பெயர்" உங்கள் கணக்கின் இயல்புநிலை அடையாளத்தை அமைக்க. இந்த களஞ்சியத்தில் மட்டுமே அடையாளத்தை அமைக்க --global ஐ தவிர்.

source: no email was given and auto-detection is disabled
ta: மின்னஞ்சல் எதுவும் வழங்கப்படவில்லை மற்றும் தானாக கண்டறிதல் முடக்கப்பட்டுள்ளது

source: unable to auto-detect email address (got '%s')
ta: மின்னஞ்சல் முகவரியை தானாக கண்டறிய முடியவில்லை (கிடைத்தது '%s')

source: no name was given and auto-detection is disabled
ta: பெயர் வழங்கப்படவில்லை மற்றும் தானாக கண்டறிதல் முடக்கப்பட்டுள்ளது

source: unable to auto-detect name (got '%s')
ta: தானாக கண்டறிய முடியாத பெயரை ('%s' கிடைத்தன)

source: empty ident name (for <%s>) not allowed
ta: வெற்று அடையாள பெயர் (<%s> க்கு) அனுமதிக்கப்படவில்லை

source: name consists only of disallowed characters: %s
ta: பெயர் அனுமதிக்கப்படாத எழுத்துக்களை மட்டுமே கொண்டுள்ளது: %s

source: expected 'tree:<depth>'
ta: எதிர்பார்க்கப்படும் 'மரம்: <ஆழம்>'

source: sparse:path filters support has been dropped
ta: சிதறல்: பாதை வடிப்பான்களின் உதவி கைவிடப்பட்டது

source: '%s' for 'object:type=<type>' is not a valid object type
ta: 'பொருளுக்கு'%s: வகை = <type> 'என்பது செல்லுபடியாகும் பொருள் வகை அல்ல

source: invalid filter-spec '%s'
ta: தவறான வடிகட்டி-ச்பெக் '%s'

source: must escape char in sub-filter-spec: '%c'
ta: துணை-வடிகட்டி-ச்பெக்கில் கரி தப்பிக்க வேண்டும்: '%c'

source: expected something after combine:
ta: இணைந்த பிறகு ஏதாவது எதிர்பார்க்கப்படுகிறது:

source: multiple filter-specs cannot be combined
ta: பல வடிகட்டி-ச்பெக்குகளை இணைக்க முடியாது

source: unable to upgrade repository format to support partial clone
ta: பகுதி நகலியை ஆதரிக்க களஞ்சிய வடிவமைப்பை மேம்படுத்த முடியவில்லை

source: args
ta: ஆர்க்ச்

source: object filtering
ta: பொருள் வடிகட்டுதல்

source: unable to access sparse blob in '%s'
ta: '%s' இல் சிதறிய குமிழியை அணுக முடியவில்லை

source: unable to parse sparse filter data in %s
ta: %s இல் சிதறிய வடிகட்டி தரவை பாகுபடுத்த முடியவில்லை

source: entry '%s' in tree %s has tree mode, but is not a tree
ta: '%s' மரத்தின் நுழைவு %s மரத்தின் பயன்முறையைக் கொண்டுள்ளது, ஆனால் ஒரு மரம் அல்ல

source: entry '%s' in tree %s has blob mode, but is not a blob
ta: மரம் %s இல் நுழைவு '%s' குமிழ் பயன்முறையைக் கொண்டுள்ளது, ஆனால் இது ஒரு குமிழ் அல்ல

source: unable to load root tree for commit %s
ta: வேர் மரத்தை உறுதி %s ஏற்ற முடியவில்லை

source: Unable to create '%s.lock': %s. Another git process seems to be running in this repository, e.g. an editor opened by 'git commit'. Please make sure all processes are terminated then try again. If it still fails, a git process may have crashed in this repository earlier: remove the file manually to continue.
ta: ' %s.lock' ஐ உருவாக்க முடியவில்லை: %s. இந்த களஞ்சியத்தில் மற்றொரு அறிவிலி செயல்முறை இயங்குவதாக தெரிகிறது, எ.கா. 'அறிவிலி உறுதி' திறந்த ஒரு ஆசிரியர். எல்லா செயல்முறைகளும் உறுதிப்படுத்தவும் நிறுத்தப்பட்டு மீண்டும் முயற்சிக்கவும். அது இன்னும் தோல்வியுற்றால், ஒரு அறிவிலி செயல்முறை இந்த களஞ்சியத்தில் முன்பு செயலிழந்திருக்கலாம்: தொடர கோப்பை கைமுறையாக அகற்றவும்.

source: Unable to create '%s.lock': %s
ta: ' %s.lock' ஐ உருவாக்க முடியவில்லை: %s

source: unable to create temporary object directory
ta: தற்காலிக பொருள் கோப்பகத்தை உருவாக்க முடியவில்லை

source: unexpected line: '%s'
ta: எதிர்பாராத வரி: '%s'

source: expected flush after ls-refs arguments
ta: எல்.எச்-ரெஃப்ச் வாதங்களுக்குப் பிறகு எதிர்பார்க்கப்படும் பறிப்பு

source: quoted CRLF detected
ta: மேற்கோள் காட்டப்பட்ட சி.ஆர்.எல்.எஃப் கண்டறியப்பட்டது

source: Could not parse object '%s'
ta: பொருளை '%s' அலச முடியவில்லை

source: Failed to merge submodule %s (not checked out)
ta: துணைதொகுதி %s ஐ ஒன்றிணைப்பதில் தோல்வி (சரிபார்க்கப்படவில்லை)

source: Failed to merge submodule %s (no merge base)
ta: துணைதொகுதி %s ஒன்றிணைப்பதில் தோல்வி (ஒன்றிணைக்கும் அடிப்படை இல்லை)

source: Failed to merge submodule %s (commits not present)
ta: துணைதொகுதி %s ஒன்றிணைப்பதில் தோல்வி (தற்போது இல்லை)

source: Failed to merge submodule %s (commits don't follow merge-base)
ta: துணைதொகுதி %s ஒன்றிணைப்பதில் தோல்வி ( உறுதிச் ஒன்றிணைப்பு-தளத்தைப் பின்பற்ற வேண்டாம்)

source: Note: Fast-forwarding submodule %s to %s
ta: குறிப்பு: வேகமாக முன்னோக்கி துணைதொகுதி %s முதல் %s வரை

source: Failed to merge submodule %s
ta: துணைதொகுதி %s ஒன்றிணைப்பதில் தோல்வி

source: Failed to merge submodule %s, but a possible merge resolution exists: %s
ta: துணைதொகுதி %s ஒன்றிணைப்பதில் தோல்வி, ஆனால் சாத்தியமான ஒன்றிணைக்கும் தீர்மானம் உள்ளது: %s

source: Failed to merge submodule %s, but multiple possible merges exist: %s
ta: துணைதொகுதி %s ஐ ஒன்றிணைக்கத் தவறிவிட்டது, ஆனால் பல சாத்தியமான இணைப்புகள் உள்ளன: %s

source: Auto-merging %s
ta: தானாக ஒன்றிணைக்கும் %s

source: CONFLICT (implicit dir rename): Existing file/dir at %s in the way of implicit directory rename(s) putting the following path(s) there: %s.
ta: மோதல் (மறைமுகமாக மறுபெயரிடல்): உள்ளார்ந்த அடைவு (கள்) மறுபெயரிடும் வழியில் %s இல் இருக்கும் கோப்பு/dir பின்வரும் பாதையை (களை) வைத்திருக்கும் வழியில்: %s.

source: CONFLICT (implicit dir rename): Cannot map more than one path to %s; implicit directory renames tried to put these paths there: %s
ta: மோதல் (மறைமுகமாக மறுபெயரிடுதல்): %s க்கு ஒன்றுக்கு மேற்பட்ட பாதைகளை வரைபடமாக்க முடியாது; மறைமுக அடைவு மறுபெயரிடங்கள் இந்த பாதைகளை அங்கு வைக்க முயற்சித்தன: %s

source: CONFLICT (directory rename split): Unclear where to rename %s to; it was renamed to multiple other directories, with no destination getting a majority of the files.
ta: மோதல் (அடைவு மறுபெயரிடுதல் பிளவு): %s க்கு மறுபெயரிடுவது தெளிவாகத் தெரியவில்லை; இது பல கோப்பகங்களுக்கு மறுபெயரிடப்பட்டது, எந்த இடமும் பெரும்பான்மையான கோப்புகளைப் பெறவில்லை.

source: WARNING: Avoiding applying %s -> %s rename to %s, because %s itself was renamed.
ta: முன்னறிவிப்பு: %s -> %s %s என மறுபெயரிடுவதைத் தவிர்ப்பது, ஏனெனில் %s தானே மறுபெயரிடப்பட்டது.

source: Path updated: %s added in %s inside a directory that was renamed in %s; moving it to %s.
ta: பாதை புதுப்பிக்கப்பட்டது: %s ஒரு கோப்பகத்தில் %s இல் சேர்க்கப்பட்டுள்ளன, அது %s இல் மறுபெயரிடப்பட்டது; அதை %s க்கு நகர்த்துவது.

source: Path updated: %s renamed to %s in %s, inside a directory that was renamed in %s; moving it to %s.
ta: பாதை புதுப்பிக்கப்பட்டது: %s %s இல் %s என மறுபெயரிடப்பட்டது, ஒரு கோப்பகத்திற்குள் %s என மறுபெயரிடப்பட்டது; அதை %s க்கு நகர்த்துவது.

source: CONFLICT (file location): %s added in %s inside a directory that was renamed in %s, suggesting it should perhaps be moved to %s.
ta: மோதல் (கோப்பு இருப்பிடம்): %s ஒரு கோப்பகத்திற்குள் %s இல் சேர்க்கப்பட்டுள்ளன, இது %s இல் மறுபெயரிடப்பட்டது, இது %s க்கு நகர்த்தப்பட வேண்டும் என்று பரிந்துரைக்கிறது.

source: CONFLICT (file location): %s renamed to %s in %s, inside a directory that was renamed in %s, suggesting it should perhaps be moved to %s.
ta: மோதல் (கோப்பு இருப்பிடம்): %s %s இல் %s என மறுபெயரிடப்படுகின்றன, இது ஒரு கோப்பகத்திற்குள் %s என மறுபெயரிடப்பட்டது, இது %s க்கு நகர்த்தப்பட வேண்டும் என்று பரிந்துரைக்கிறது.

source: CONFLICT (rename/rename): %s renamed to %s in %s and to %s in %s.
ta: மோதல் (மறுபெயரிட/மறுபெயரிடுதல்): %s %s இல் %s மற்றும் %s இல் %s என மறுபெயரிடப்பட்டன.

source: CONFLICT (rename involved in collision): rename of %s -> %s has content conflicts AND collides with another path; this may result in nested conflict markers.
ta: மோதல் (மோதலில் மறுபெயரிடுதல்): %s -> %s மறுபெயரிடுவது உள்ளடக்க மோதல்களைக் கொண்டுள்ளது மற்றும் மற்றொரு பாதையுடன் மோதுகிறது; இது உள்ளமைக்கப்பட்ட மோதல் குறிப்பான்களுக்கு வழிவகுக்கும்.

source: CONFLICT (rename/delete): %s renamed to %s in %s, but deleted in %s.
ta: மோதல் (மறுபெயரிடு/நீக்குதல்): %s %s இல் %s என மறுபெயரிடப்பட்டன, ஆனால் %s இல் நீக்கப்பட்டன.

source: CONFLICT (file/directory): directory in the way of %s from %s; moving it to %s instead.
ta: மோதல் (கோப்பு/அடைவு): %s இலிருந்து %s வழியில் உள்ள அடைவு; அதற்கு பதிலாக %s க்கு நகரும்.

source: CONFLICT (distinct types): %s had different types on each side; renamed both of them so each can be recorded somewhere.
ta: மோதல் (தனித்துவமான வகைகள்): %s ஒவ்வொரு பக்கத்திலும் வெவ்வேறு வகைகளைக் கொண்டிருந்தன; அவர்கள் இருவருக்கும் மறுபெயரிடப்பட்டது, எனவே ஒவ்வொன்றையும் எங்காவது பதிவு செய்யலாம்.

source: CONFLICT (distinct types): %s had different types on each side; renamed one of them so each can be recorded somewhere.
ta: மோதல் (தனித்துவமான வகைகள்): %s ஒவ்வொரு பக்கத்திலும் வெவ்வேறு வகைகளைக் கொண்டிருந்தன; அவற்றில் ஒன்று மறுபெயரிடப்பட்டது, எனவே ஒவ்வொன்றும் எங்காவது பதிவு செய்யப்படலாம்.

source: content
ta: உள்ளடக்கம்

source: add/add
ta: சேர்க்க/சேர்க்கவும்

source: submodule
ta: துணைதொகுதி

source: CONFLICT (%s): Merge conflict in %s
ta: மோதல் ( %s): மோதலை %s இல் ஒன்றிணைக்கவும்

source: CONFLICT (modify/delete): %s deleted in %s and modified in %s. Version %s of %s left in tree.
ta: மோதல் (மாற்றியமைக்க/நீக்கு): %s %s இல் நீக்கப்பட்டு %s இல் மாற்றியமைக்கப்படுகின்றன. மரத்தில் எஞ்சியிருக்கும் %s பதிப்பு %s.

source: - go to submodule (%s), and either merge commit %s or update to an existing commit which has merged those changes
ta: - துணைதொகுதி ( %s) க்குச் சென்று, %s ஐ ஒன்றிணைக்கவும் அல்லது அந்த மாற்றங்களை ஒன்றிணைத்த ஏற்கனவே உள்ள உறுதிப்பாட்டிற்கு புதுப்பிக்கவும்

source: Recursive merging with submodules currently only supports trivial cases. Please manually handle the merging of each conflicted submodule. This can be accomplished with the following steps: %s - come back to superproject and run: git add %s to record the above merge or update - resolve any other conflicts in the superproject - commit the resulting index in the superproject
ta: துணைதொகுதிகளுடன் சுழல்நிலை ஒன்றிணைவது தற்போது அற்ப நிகழ்வுகளை மட்டுமே ஆதரிக்கிறது. ஒவ்வொரு முரண்பட்ட துணைதொகுதியையும் ஒன்றிணைப்பதை கைமுறையாக கையாளவும். பின்வரும் படிகளுடன் இதை நிறைவேற்ற முடியும்: %s - சூப்பர் புரோசெக்டுக்கு திரும்பி வந்து இயக்கவும்: git %s ஐச் சேர்க்கவும் மேலே உள்ள ஒன்றிணைப்பு அல்லது புதுப்பிப்பை பதிவு செய்ய - சூப்பர் திட்டத்தில் வேறு எந்த மோதல்களையும் தீர்க்கவும் - இதன் விளைவாக வரும் குறியீட்டை சூப்பர் புரோசெக்டில் செய்யுங்கள்

source: collecting merge info failed for trees %s, %s, %s
ta: கூட்டுத் தகவல்களைச் சேகரிப்பது மரங்களுக்கு %s, %s, %s தோல்வியுற்றது

source: failed to read the cache
ta: தற்காலிக சேமிப்பைப் படிக்கத் தவறிவிட்டது

source: failed to add packfile '%s'
ta: பேக்ஃபைல் '%s' சேர்க்கத் தவறிவிட்டது

source: failed to open pack-index '%s'
ta: கட்டு-இன்டெக்ச் '%s' திறக்கத் தவறிவிட்டது
