Repository: Nizhal/git-ta-po
Catalog: po/*.po
Languages: ta

source: dst refspec %s matches more than one
ta: டிஎச்டி ரெஃப்ச்பெக் %s ஒன்றுக்கு மேற்பட்டவை

source: dst ref %s receives from more than one src
ta: ஒன்றுக்கு மேற்பட்ட எச்.ஆர்.சி யிலிருந்து டிஎச்டி ரெஃப் %s பெறுகிறது

source: HEAD does not point to a branch
ta: தலை ஒரு கிளையை சுட்டிக்காட்டாது

source: no such branch: '%s'
ta: அத்தகைய கிளை இல்லை: '%s'

source: no upstream configured for branch '%s'
ta: கிளை '%s' க்கு மேலோடை கட்டமைக்கப்படவில்லை

source: upstream branch '%s' not stored as a remote-tracking branch
ta: மேலோடை கிளை '%s' தொலை கண்காணிப்பு கிளையாக சேமிக்கப்படவில்லை

source: push destination '%s' on remote '%s' has no local tracking branch
ta: தொலை '%s' இல் உள்ள இலக்கு '%s' உள்ளக கண்காணிப்பு கிளை இல்லை

source: branch '%s' has no remote for pushing
ta: கிளை '%s' தள்ளுவதற்கு தொலைநிலை இல்லை

source: push refspecs for '%s' do not include '%s'
ta: '%s' க்கான தள்ளு குறிகுறிப்புகள் '%s' சேர்க்க வேண்டாம்

source: push has no destination (push.default is 'nothing')
ta: தள்ளு எந்த இடமும் இல்லை (push.default 'ஒன்றுமில்லை')

source: cannot resolve 'simple' push to a single destination
ta: ஒரு இலக்குக்கு 'எளிய' உந்துதலைத் தீர்க்க முடியாது

source: couldn't find remote ref %s
ta: தொலை ரெஃப் %s கண்டுபிடிக்க முடியவில்லை

source: * Ignoring funny ref '%s' locally
ta: * உள்நாட்டில் வேடிக்கையான ref '%s' ஐ புறக்கணித்தல்

source: Your branch is based on '%s', but the upstream is gone.
ta: உங்கள் கிளை '%s' ஐ அடிப்படையாகக் கொண்டது, ஆனால் மேலோடை போய்விட்டது.

source: (use "git branch --unset-upstream" to fixup)
ta: (சரிசெய்ய "git branch --unset-upstream" ஐப் பயன்படுத்தவும்)

source: Your branch is up to date with '%s'.
ta: உங்கள் கிளை '%s' உடன் புதுப்பித்த நிலையில் உள்ளது.

source: Your branch and '%s' refer to different commits.
ta: உங்கள் கிளை மற்றும் '%s' ஆகியவை வெவ்வேறு உறுதிடிகளைக் குறிக்கின்றன.

source: (use "%s" for details)
ta: (விவரங்களுக்கு "%s" ஐப் பயன்படுத்தவும்)

source: Your branch is ahead of '%s' by %d commit.
ta: உங்கள் கிளை '%s' ஐ விட %d உறுதிடால் முன்னால் உள்ளது.

source: (use "git push" to publish your local commits)
ta: (உங்கள் உள்ளக உறுதிடுகளை வெளியிட "அறிவிலி புச்" ஐப் பயன்படுத்தவும்)

source: Your branch is behind '%s' by %d commit, and can be fast-forwarded.
ta: உங்கள் கிளை '%s' பின்னால் %d உறுதிடால் உள்ளது, மேலும் வேகமாக முன்னோக்கி செல்ல முடியும்.

source: (use "git pull" to update your local branch)
ta: (உங்கள் உள்ளக கிளையைப் புதுப்பிக்க "அறிவிலி புல்" ஐப் பயன்படுத்தவும்)

source: Your branch and '%s' have diverged, and have %d and %d different commit each, respectively.
ta: உங்கள் கிளை மற்றும் '%s' வேறுபட்டுள்ளன, மற்றும் முறையே ஒவ்வொன்றும் %d மற்றும் %d வேறுபட்டவை.

source: (use "git pull" if you want to integrate the remote branch with yours)
ta: (தொலை கிளையை உங்களுடன் ஒருங்கிணைக்க விரும்பினால் "அறிவிலி புல்" ஐப் பயன்படுத்தவும்)

source: cannot parse expected object name '%s'
ta: எதிர்பார்க்கப்படும் பொருள் பெயரை '%s' அலச முடியாது

source: cannot strip one component off url '%s'
ta: முகவரி '%s' இலிருந்து ஒரு கூறுகளை அகற்ற முடியாது

source: bad replace ref name: %s
ta: மோசமான மாற்றுதல் பெயர்: %s

source: duplicate replace ref: %s
ta: நகல் மாற்றுதல் குறிப்பு: %s

source: replace depth too high for object %s
ta: பொருள் %s க்கு ஆழத்தை மிக அதிகமாக மாற்றவும்

source: corrupt MERGE_RR
ta: ஊழல் MERGE_RR

source: unable to write rerere record
ta: rerere பதிவை எழுத முடியவில்லை

source: there were errors while writing '%s' (%s)
ta: '%s' (%s) எழுதும் போது பிழைகள் இருந்தன

source: could not parse conflict hunks in '%s'
ta: '%s' இல் மோதல் அன்களை அலச முடியவில்லை

source: failed utime() on '%s'
ta: '%s' இல் தோல்வியுற்ற utime ()

source: writing '%s' failed
ta: '%s' எழுதுவது தோல்வியடைந்தது

source: Staged '%s' using previous resolution.
ta: முந்தைய தீர்மானத்தைப் பயன்படுத்தி '%s' அரங்கேற்றப்பட்டது.

source: Recorded resolution for '%s'.
ta: '%s' க்கான பதிவு செய்யப்பட்ட தீர்மானம்.

source: Resolved '%s' using previous resolution.
ta: முந்தைய தீர்மானத்தைப் பயன்படுத்தி '%s' தீர்க்கப்பட்டது.

source: cannot unlink stray '%s'
ta: தவறான '%s' ஐ அவிழ்க்க முடியாது

source: Recorded preimage for '%s'
ta: '%s' க்கான பதிவு செய்யப்பட்ட முன்கணிப்பு

source: failed to update conflicted state in '%s'
ta: '%s' இல் முரண்பட்ட நிலையை புதுப்பிக்கத் தவறிவிட்டது

source: no remembered resolution for '%s'
ta: '%s' க்கான நினைவுகூரப்பட்ட தீர்மானம் இல்லை

source: Updated preimage for '%s'
ta: '%s' க்கான புதுப்பிக்கப்பட்ட முன்கூட்டியே புதுப்பிக்கப்பட்டது

source: Forgot resolution for '%s'
ta: '%s' க்கான தீர்மானத்தை மறந்துவிட்டேன்

source: unable to open rr-cache directory
ta: ஆர்.ஆர்-கேச் கோப்பகத்தைத் திறக்க முடியவில்லை

source: update the index with reused conflict resolution if possible
ta: முடிந்தால் மீண்டும் பயன்படுத்தப்பட்ட மோதல் தீர்மானத்துடன் குறியீட்டைப் புதுப்பிக்கவும்

source: could not determine HEAD revision
ta: தலை திருத்தத்தை தீர்மானிக்க முடியவில்லை

source: failed to find tree of %s
ta: %s மரத்தைக் கண்டுபிடிக்கத் தவறிவிட்டது

source: unsupported section for hidden refs: %s
ta: மறைக்கப்பட்ட குறிப்புகளுக்கு ஆதரிக்கப்படாத பிரிவு: %s

source: --exclude-hidden= passed more than once
ta: --exclude-hidden= ஒன்றுக்கு மேற்பட்ட முறை கடந்துவிட்டது

source: resolve-undo records `%s` which is missing
ta: தீர்வு-அன்டோ பதிவுகளை `%s` காணவில்லை

source: --unpacked=<packfile> no longer supported
ta: --unpacked=<கட்டுகோப்பு> இனி ஆதரிக்கப்படாது

source: invalid option '%s' in --stdin mode
ta: தவறான விருப்பம் '%s' --stdin பயன்முறையில்

source: your current branch appears to be broken
ta: உங்கள் தற்போதைய கிளை உடைந்ததாகத் தெரிகிறது

source: your current branch '%s' does not have any commits yet
ta: உங்கள் தற்போதைய கிளை '%s' இதுவரை எந்த உறுதிடிகளும் இல்லை

source: object filtering requires --objects
ta: பொருள் வடிகட்டலுக்கு --objects தேவை

source: -L does not yet support diff formats besides -p and -s
ta: -p மற்றும் -s தவிர வேறுபட்ட வடிவங்களை -L இன்னும் ஆதரிக்கவில்லை

source: cannot create async thread: %s
ta: ஒத்திசைவு நூலை உருவாக்க முடியாது: %s

source: '%s' does not exist
ta: '%s' இல்லை

source: could not switch to '%s'
ta: '%s' க்கு மாற முடியவில்லை

source: need a working directory
ta: பணி அடைவு தேவை

source: Scalar enlistments require a worktree
ta: அளவிடுதல் பட்டியலுக்கு ஒரு பணியாளர் தேவை

source: could not configure %s=%s
ta: %s = %s ஐ உள்ளமைக்க முடியவில்லை

source: could not configure log.excludeDecoration
ta: log.excludeDecoration ஐ உள்ளமைக்க முடியவில்லை

source: could not add enlistment
ta: பட்டியலிட முடியவில்லை

source: could not set recommended config
ta: பரிந்துரைக்கப்பட்ட கட்டமைப்பை அமைக்க முடியவில்லை

source: could not start the FSMonitor daemon
ta: fsmonitor டீமனைத் தொடங்க முடியவில்லை

source: could not turn off maintenance
ta: பராமரிப்பை அணைக்க முடியவில்லை

source: could not remove enlistment
ta: பட்டியலிடலை அகற்ற முடியவில்லை

source: remote HEAD is not a branch: '%.*s'
ta: தொலைநிலை தலை ஒரு கிளை அல்ல: '%.*s'

source: failed to get default branch name from remote; using local default
ta: தொலைதூரத்திலிருந்து இயல்புநிலை கிளை பெயரைப் பெறுவதில் தோல்வி; உள்ளக இயல்புநிலையைப் பயன்படுத்துதல்

source: failed to get default branch name
ta: இயல்புநிலை கிளை பெயரைப் பெறுவதில் தோல்வி

source: failed to unregister repository
ta: களஞ்சியத்தை பதிவு செய்யத் தவறிவிட்டது

source: failed to stop the FSMonitor daemon
ta: fsmonitor damen ஐ நிறுத்தத் தவறிவிட்டது

source: failed to delete enlistment directory
ta: பட்டியலிடும் கோப்பகத்தை நீக்குவதில் தோல்வி

source: branch to checkout after clone
ta: குளோனுக்குப் பிறகு புதுப்பிக்க கிளை

source: when cloning, create full working directory
ta: குளோனிங் செய்யும் போது, முழு பணி கோப்பகத்தை உருவாக்கவும்

source: only download metadata for the branch that will be checked out
ta: சரிபார்க்கப்படும் கிளைக்கு மெட்டாடேட்டாவை மட்டுமே பதிவிறக்கவும்

source: create repository within 'src' directory
ta: 'எச்.ஆர்.சி' கோப்பகத்திற்குள் களஞ்சியத்தை உருவாக்கவும்

source: cannot deduce worktree name from '%s'
ta: '%s' இலிருந்து பணியிட பெயரைக் குறைக்க முடியாது

source: directory '%s' exists already
ta: அடைவு '%s' ஏற்கனவே உள்ளது

source: failed to get default branch for '%s'
ta: '%s' க்கு இயல்புநிலை கிளையைப் பெறுவதில் தோல்வி

source: could not configure remote in '%s'
ta: '%s' இல் தொலைடை உள்ளமைக்க முடியவில்லை

source: could not configure '%s'
ta: '%s' கட்டமைக்க முடியவில்லை

source: partial clone failed; attempting full clone
ta: பகுதி நகலி தோல்வியடைந்தது; முழு நகலியை முயற்சிக்கிறது

source: could not configure for full clone
ta: முழு குளோனுக்கு கட்டமைக்க முடியவில்லை

source: scalar diagnose [<enlistment>]
ta: அளவிடுதல் கண்டறிதல் [<விரிவாக்க>]

source: `scalar list` does not take arguments
ta: `அளவிடுதல் பட்டியல்` வாதங்களை எடுக்காது

source: reconfigure all registered enlistments
ta: பதிவுசெய்யப்பட்ட அனைத்து பட்டியல்களையும் மறுகட்டமைக்கவும்

source: --all or <enlistment>, but not both
ta: --all அல்லது <பட்டியலிடுதல்>, ஆனால் இரண்டும் இல்லை

source: could not remove stale scalar.repo '%s'
ta: பழைய அளவிடலை scalar.repo அகற்ற முடியவில்லை '%s'

source: removed stale scalar.repo '%s'
ta: அகற்றப்பட்ட பழைய scalar.repo '%s'

source: repository at '%s' has different owner
ta: '%s' இல் உள்ள களஞ்சியத்தில் வெவ்வேறு உரிமையாளர் உள்ளது

source: repository at '%s' has a format issue
ta: '%s' இல் களஞ்சியத்தில் ஒரு வடிவமைப்பு சிக்கல் உள்ளது

source: repository not found in '%s'
ta: '%s' இல் களஞ்சியம் காணப்படவில்லை

source: to unregister this repository from Scalar, run git config --global --unset --fixed-value scalar.repo "%s"
ta: இந்த களஞ்சியத்தை அளவிடலில் இருந்து பதிவு செய்ய, இயக்கவும் git config --global --unset --fixed-value scalar.repo "%s"

source: scalar run <task> [<enlistment>] Tasks:
ta: அளவிடுதல் இயக்கம் <பணி> [<பட்டியலிடுதல்>] பணிகள்:

source: no such task: '%s'
ta: அத்தகைய பணி இல்லை: '%s'

source: scalar unregister [<enlistment>]
ta: அளவிடுதல் பதிவு செய்யப்படவில்லை [<விரிவாக்க>]

source: scalar delete <enlistment>
ta: அளவிடுதல் நீக்கு <விரிவாக்க>

source: refusing to delete current working directory
ta: தற்போதைய பணி கோப்பகத்தை நீக்க மறுக்கிறது

source: include Git version
ta: அறிவிலி பதிப்பை சேர்க்கவும்

source: include Git's build options
ta: git இன் உருவாக்க விருப்பங்களைச் சேர்க்கவும்

source: scalar verbose [-v | --verbose] [--build-options]
ta: அளவிடுதல் வாய்மொழி [-v | --verbose] [-கட்டியெழுப்ப-விருப்பங்கள்]

source: -C requires a <directory>
ta: -c க்கு ஒரு <அடைவு> தேவை

source: could not change to '%s'
ta: '%s' என மாற முடியவில்லை

source: -c requires a <key>=<value> argument
ta: -c க்கு <விசை> = <மதிப்பு> உரையாடல் தேவை

source: scalar [-C <directory>] [-c <key>=<value>] <command> [<options>] Commands:
ta: அளவிடுதல் [-c <அடைவு>] [-c <விசை>=<மதிப்பு>] <கட்டளை> [<விருப்பங்கள்>] கட்டளைகள்:

source: unexpected flush packet while reading remote unpack status
ta: தொலைநிலை அவிழ்க்கப்பட்ட நிலையைப் படிக்கும்போது எதிர்பாராத பறிப்பு பாக்கெட்

source: unable to parse remote unpack status: %s
ta: தொலைநிலை திறக்க நிலையை அலச முடியவில்லை: %s

source: remote unpack failed: %s
ta: தொலை அவிழ்ப்பது தோல்வியுற்றது: %s

source: failed to sign the push certificate
ta: புச் சான்றிதழில் கையெழுத்திடுவதில் தோல்வி

source: send-pack: unable to fork off fetch subprocess
ta: அனுப்பு-கட்டு: துணை செயலாக்கத்தைப் பெற முடியவில்லை

source: push negotiation failed; proceeding anyway with push
ta: புச் பேச்சுவார்த்தை தோல்வியடைந்தது; உந்துதலுடன் எப்படியும் தொடர்கிறது

source: the receiving end does not support this repository's hash algorithm
ta: பெறும் முடிவு இந்த களஞ்சியத்தின் ஆச் வழிமுறையை ஆதரிக்காது

source: the receiving end does not support --signed push
ta: பெறும் முடிவு --signed தள்ளு ஆதரிக்காது

source: not sending a push certificate since the receiving end does not support --signed push
ta: பெறும் முடிவு ஆதரிக்கவில்லை என்பதால் புச் சான்றிதழை அனுப்பவில்லை --signed தள்ளு

source: the receiving end does not support --atomic push
ta: --atomic தள்ளு பெறும் முடிவு ஆதரிக்காது

source: the receiving end does not support push options
ta: பெறும் முடிவு புச் விருப்பங்களை ஆதரிக்காது

source: invalid commit message cleanup mode '%s'
ta: தவறான உறுதி செய்தி தூய்மைப்படுத்தும் பயன்முறை '%s'

source: could not delete '%s'
ta: '%s' ஐ நீக்க முடியவில்லை

source: revert
ta: திரும்பவும்

source: cherry-pick
ta: செர்ரி-பிக்

source: rebase
ta: ரீடிச்

source: unknown action: %d
ta: தெரியாத செயல்: %d

source: Resolve all conflicts manually, mark them as resolved with "git add/rm <conflicted_files>", then run "git rebase --continue". You can instead skip this commit: run "git rebase --skip". To abort and get back to the state before "git rebase", run "git rebase --abort".
ta: எல்லா மோதல்களையும் கைமுறையாக தீர்க்கவும், தீர்க்கப்பட்டபடி அவற்றைக் குறிக்கவும் "git add/rm <sponficated_files>", பின்னர் "git rebase --continue" ஐ இயக்கவும். அதற்கு பதிலாக நீங்கள் இந்த உறுதிப்பாட்டைத் தவிர்க்கலாம்: "git rebase --skip" ஐ இயக்கவும். "git rebase" க்கு முன் நிறுத்தி மீண்டும் மாநிலத்திற்கு வர, "git rebase --abort" ஐ இயக்கவும்.

source: after resolving the conflicts, mark the corrected paths with 'git add <paths>' or 'git rm <paths>'
ta: மோதல்களைத் தீர்த்த பிறகு, சரிசெய்யப்பட்ட பாதைகளை குறிக்கவும் 'அறிவிலி சேர் <பாதைகள்>' அல்லது 'அறிவிலி ஆர்.எம் <பாதைகள்>' உடன்

source: After resolving the conflicts, mark them with "git add/rm <pathspec>", then run "git cherry-pick --continue". You can instead skip this commit with "git cherry-pick --skip". To abort and get back to the state before "git cherry-pick", run "git cherry-pick --abort".
ta: மோதல்களைத் தீர்த்த பிறகு, அவற்றைக் குறிக்கவும் "git add/rm <adagspec>", பின்னர் இயக்கவும் "git cherry-pick --continue". அதற்கு பதிலாக "git cherry-pick --skip" மூலம் இந்த உறுதிப்பாட்டை நீங்கள் தவிர்க்கலாம். "git cherry-pick" க்கு முன் நிறுத்தி மீண்டும் நிலைக்கு வர, "git cherry-pick --abort" ஐ இயக்கவும்.

source: After resolving the conflicts, mark them with "git add/rm <pathspec>", then run "git revert --continue". You can instead skip this commit with "git revert --skip". To abort and get back to the state before "git revert", run "git revert --abort".
ta: மோதல்களைத் தீர்த்த பிறகு, அவற்றைக் குறிக்கவும் "git add/rm <adagspec>", பின்னர் இயக்கவும் "git revert --continue". அதற்கு பதிலாக "git revert --skip" உடன் இந்த உறுதிப்பாட்டைத் தவிர்க்கலாம். "git revert" முன் நிறுத்தி மீண்டும் மாநிலத்திற்குத் திரும்ப, "git revert --abort" ஐ இயக்கவும்.

source: could not lock '%s'
ta: '%s' பூட்ட முடியவில்லை

source: could not write eol to '%s'
ta: '%s' க்கு eol ஐ எழுத முடியவில்லை

source: failed to finalize '%s'
ta: '%s' ஐ இறுதி செய்யத் தவறிவிட்டது

source: your local changes would be overwritten by %s.
ta: உங்கள் உள்ளக மாற்றங்கள் %s மூலம் மேலெழுதப்படும்.

source: commit your changes or stash them to proceed.
ta: உங்கள் மாற்றங்களைச் செய்யுங்கள் அல்லது தொடர அவற்றைத் தட்டவும்.

source: %s: Unable to write new index file
ta: %s: புதிய குறியீட்டு கோப்பை எழுத முடியவில்லை

source: unable to update cache tree
ta: கேச் மரத்தை புதுப்பிக்க முடியவில்லை

source: could not resolve HEAD commit
ta: தலை உறுதிப்பாட்டை தீர்க்க முடியவில்லை

source: no key present in '%.*s'
ta: '%.*s' இல் எந்த விசையும் இல்லை

source: unable to dequote value of '%s'
ta: '%s' இன் மதிப்பைக் குறைக்க முடியவில்லை

source: 'GIT_AUTHOR_NAME' already given
ta: 'GIT_AUTHOR_NAME' ஏற்கனவே கொடுக்கப்பட்டுள்ளது

source: 'GIT_AUTHOR_EMAIL' already given
ta: 'GIT_AUTHOR_EMAIL' ஏற்கனவே கொடுக்கப்பட்டுள்ளது

source: 'GIT_AUTHOR_DATE' already given
ta: 'GIT_AUTHOR_DATE' ஏற்கனவே கொடுக்கப்பட்டுள்ளது

source: unknown variable '%s'
ta: அறியப்படாத மாறி '%s'

source: missing 'GIT_AUTHOR_NAME'
ta: 'GIT_AUTHOR_NAME' ஐக் காணவில்லை

source: missing 'GIT_AUTHOR_EMAIL'
ta: 'GIT_AUTHOR_EMAIL' ஐக் காணவில்லை

source: missing 'GIT_AUTHOR_DATE'
ta: 'GIT_AUTHOR_DATE' ஐக் காணவில்லை

source: you have staged changes in your working tree If these changes are meant to be squashed into the previous commit, run: git commit --amend %s If they are meant to go into a new commit, run: git commit %s In both cases, once you're done, continue with: git rebase --continue
ta: உங்கள் பணி மரத்தில் மாற்றங்களை நடத்தியுள்ளீர்கள் இந்த மாற்றங்கள் முந்தைய உறுதிப்பாட்டிற்குள் செல்லப்பட வேண்டும் என்றால், இயக்கவும்: git commit --amend %s அவை ஒரு புதிய உறுதிப்பாட்டிற்கு செல்ல வேண்டும் என்றால், இயக்கவும்: அறிவிலி உறுதி %s இரண்டு சந்தர்ப்பங்களிலும், நீங்கள் முடிந்ததும், தொடரவும்: git rebase --continue

source: 'prepare-commit-msg' hook failed
ta: 'தயார்- உறுதி-எம்.எச்.சி' கொக்கி தோல்வியடைந்தது

source: Your name and email address were configured automatically based on your username and hostname. Please check that they are accurate. You can suppress this message by setting them explicitly. Run the following command and follow the instructions in your editor to edit your configuration file: git config --global --edit After doing this, you may fix the identity used for this commit with: git commit --amend --reset-author
ta: உங்கள் பெயர் மற்றும் மின்னஞ்சல் முகவரி தானாகவே கட்டமைக்கப்பட்டன உங்கள் பயனர்பெயர் மற்றும் ஓச்ட்பெயரில். அவை துல்லியமானவை என்பதை சரிபார். இந்த செய்தியை வெளிப்படையாக அமைப்பதன் மூலம் அவற்றை அடக்கலாம். இயக்கவும் கட்டளையிடவும், திருத்தவும் உங்கள் எடிட்டரில் உள்ள வழிமுறைகளைப் பின்பற்றவும் உங்கள் உள்ளமைவு கோப்பு: git config --global --edit இதைச் செய்த பிறகு, இந்த உறுதிப்பாட்டிற்கு பயன்படுத்தப்படும் அடையாளத்தை நீங்கள் சரிசெய்யலாம்: git commit --amend --reset-author

source: Your name and email address were configured automatically based on your username and hostname. Please check that they are accurate. You can suppress this message by setting them explicitly: git config --global user.name "Your Name" git config --global user.email you@example.com After doing this, you may fix the identity used for this commit with: git commit --amend --reset-author
ta: உங்கள் பெயர் மற்றும் மின்னஞ்சல் முகவரி தானாகவே கட்டமைக்கப்பட்டன உங்கள் பயனர்பெயர் மற்றும் ஓச்ட்பெயரில். அவை துல்லியமானவை என்பதை சரிபார். இந்த செய்தியை வெளிப்படையாக அமைப்பதன் மூலம் அவற்றை அடக்கலாம்: git config --global user.name "உங்கள் பெயர்" git config --global user.email பெயர்@தளம்.வணி இதைச் செய்த பிறகு, இந்த உறுதிப்பாட்டிற்கு பயன்படுத்தப்படும் அடையாளத்தை நீங்கள் சரிசெய்யலாம்: git commit --amend --reset-author

source: couldn't look up newly created commit
ta: புதிதாக உருவாக்கப்பட்ட உறுதிப்பாட்டை பார்க்க முடியவில்லை

source: could not parse newly created commit
ta: புதிதாக உருவாக்கப்பட்ட உறுதிப்பாட்டை அலச முடியவில்லை

source: unable to resolve HEAD after creating commit
ta: உறுதிப்பாட்டை உருவாக்கிய பின் தலையைத் தீர்க்க முடியவில்லை

source: detached HEAD
ta: பிரிக்கப்பட்ட தலை

source: (root-commit)
ta: (வேர்- உறுதி)

source: could not parse HEAD
ta: தலையை அலச முடியவில்லை

source: HEAD %s is not a commit!
ta: தலை %s ஒரு உறுதி அல்ல!

source: unable to parse commit author
ta: உறுதி எழுத்தாளரை பாகுபடுத்த முடியவில்லை

source: unable to read commit message from '%s'
ta: '%s' இலிருந்து உறுதி செய்தியைப் படிக்க முடியவில்லை

source: invalid author identity '%s'
ta: தவறான ஆசிரியர் அடையாளம் '%s'

source: corrupt author: missing date information
ta: ஊழல் ஆசிரியர்: காணாமல் போன தேதி செய்தி

source: could not update %s
ta: %s ஐ புதுப்பிக்க முடியவில்லை

source: could not parse parent commit %s
ta: பெற்றோரை அலச முடியவில்லை %s

source: unknown command: %d
ta: தெரியாத கட்டளை: %d

source: This is the 1st commit message:
ta: இது 1 வது உறுதி செய்தி:

source: This is the commit message #%d:
ta: இது #%d:

source: The 1st commit message will be skipped:
ta: 1 வது உறுதி செய்தி தவிர்க்கப்படும்:

source: The commit message #%d will be skipped:
ta: உறுதி செய்தி #%d தவிர்க்கப்படும்:

source: This is a combination of %d commits.
ta: இது %d உறுதிசின் கலவையாகும்.

source: cannot write '%s'
ta: '%s' எழுத முடியாது

source: need a HEAD to fixup
ta: சரிசெய்ய ஒரு தலை தேவை

source: could not read HEAD
ta: தலை படிக்க முடியவில்லை

source: could not read HEAD's commit message
ta: எட்ச் உறுதி செய்தியைப் படிக்க முடியவில்லை

source: could not read commit message of %s
ta: %s இன் உறுதி செய்தியைப் படிக்க முடியவில்லை

source: your index file is unmerged.
ta: உங்கள் குறியீட்டு கோப்பு மறுக்கப்படுகிறது.

source: cannot fixup root commit
ta: வேர் உறுதிப்பாட்டை சரிசெய்ய முடியாது

source: commit %s is a merge but no -m option was given.
ta: உறுதி %s ஒரு ஒன்றிணைப்பு ஆனால் இல்லை -எம் விருப்பம் வழங்கப்பட்டது.

source: commit %s does not have parent %d
ta: உறுதி %s பெற்றோர் இல்லை %d

source: cannot get commit message for %s
ta: %s க்கு செய்த செய்தியைப் பெற முடியாது

source: %s: cannot parse parent commit %s
ta: %s: பெற்றோரை அலச முடியாது %s

source: could not revert %s... %s
ta: %s ஐ மாற்ற முடியவில்லை ... %s

source: could not apply %s... %s
ta: %s ... %s ஐப் பயன்படுத்த முடியவில்லை

source: dropping %s %s -- patch contents already upstream
ta: %s %s ஐ கைவிடுதல் - ஒட்டு உள்ளடக்கங்கள் ஏற்கனவே மேலோடை

source: git %s: failed to read the index
ta: git %s: குறியீட்டைப் படிக்கத் தவறிவிட்டது

source: git %s: failed to refresh the index
ta: git %s: குறியீட்டைப் புதுப்பிப்பதில் தோல்வி

source: '%s' is not a valid label
ta: '%s' என்பது சரியான சிட்டை அல்ல

source: '%s' is not a valid refname
ta: '%s' என்பது செல்லுபடியாகும் refname அல்ல

source: update-ref requires a fully qualified refname e.g. refs/heads/%s
ta: புதுப்பிப்பு-ரெஃப் ஒரு முழுமையான தகுதிவாய்ந்த refname தேவை எ.கா. refs/heads/%s

source: invalid command '%.*s'
ta: தவறான கட்டளை '%.*s'

source: missing arguments for %s
ta: %s க்கான வாதங்களைக் காணவில்லை

source: could not parse '%s'
ta: '%s' ஐ அலச முடியவில்லை

source: invalid line %d: %.*s
ta: தவறான வரி %d: %.*s

source: cannot '%s' without a previous commit
ta: முந்தைய உறுதி இல்லாமல் '%s' முடியாது

source: cancelling a cherry picking in progress
ta: செர்ரி எடுப்பதை ரத்துசெய்கிறது

source: cancelling a revert in progress
ta: முன்னேற்றத்தில் மாற்றியமைத்தல்

source: please fix this using 'git rebase --edit-todo'.
ta: தயவுசெய்து இதை 'git rebase --edit-todo' பயன்படுத்தி சரிசெய்யவும்.

source: unusable instruction sheet: '%s'
ta: பயன்படுத்த முடியாத அறிவுறுத்தல் தாள்: '%s'

source: no commits parsed.
ta: எந்த உறுதிடும் பாகுபடுத்தப்படவில்லை.

source: cannot cherry-pick during a revert.
ta: மாற்றத்தின் போது செர்ரி-பிக் முடியாது.

source: cannot revert during a cherry-pick.
ta: செர்ரி-பிக் போது மாற்ற முடியாது.

source: unusable squash-onto
ta: பயன்படுத்த முடியாத ச்குவாச்-ஒன்டோ

source: malformed options sheet: '%s'
ta: தவறாக விருப்பத் தாள்கள் '%s'

source: empty commit set passed
ta: வெற்று உறுதி செட் கடந்து சென்றது

source: revert is already in progress
ta: மாற்றியமைத்தல் ஏற்கனவே நடந்து கொண்டிருக்கிறது

source: try "git revert (--continue | %s--abort | --quit)"
ta: "git revert (--continue | %s--abort | --quit)" முயற்சிக்கவும்

source: cherry-pick is already in progress
ta: செர்ரி-பிக் ஏற்கனவே நடந்து கொண்டிருக்கிறது

source: try "git cherry-pick (--continue | %s--abort | --quit)"
ta: "git cherry-pick (--continue | %s--abort | --quit)" முயற்சிக்கவும்

source: could not create sequencer directory '%s'
ta: '%s' என்ற சீக்வென்சர் கோப்பகத்தை உருவாக்க முடியவில்லை

source: no cherry-pick or revert in progress
ta: செர்ரி-பிக் இல்லை அல்லது முன்னேற்றம் இல்லை

source: cannot resolve HEAD
ta: தலையை தீர்க்க முடியாது

source: cannot abort from a branch yet to be born
ta: இன்னும் பிறக்காத ஒரு கிளையிலிருந்து கருக்கலைப்பு செய்ய முடியாது

source: cannot read '%s': %s
ta: '%s' ஐப் படிக்க முடியாது: %s

source: unexpected end of file
ta: கோப்பின் எதிர்பாராத முடிவு

source: stored pre-cherry-pick HEAD file '%s' is corrupt
ta: சேமிக்கப்பட்ட முன்-செர்ரி-பிக் தலை கோப்பு '%s' ஊழல் நிறைந்ததாகும்

source: You seem to have moved HEAD. Not rewinding, check your HEAD!
ta: நீங்கள் தலையை நகர்த்தியதாகத் தெரிகிறது. முன்னாடி அல்ல, உங்கள் தலையைச் சரிபார்!

source: no revert in progress
ta: முன்னேற்றம் இல்லை

source: no cherry-pick in progress
ta: செர்ரி-பிக் செயலில் இல்லை

source: failed to skip the commit
ta: உறுதிப்பாட்டைத் தவிர்க்கத் தவறிவிட்டது

source: there is nothing to skip
ta: தவிர்க்க எதுவும் இல்லை

source: have you committed already? try "git %s --continue"
ta: நீங்கள் ஏற்கனவே உறுதியளித்திருக்கிறீர்களா? "git %s --continue" ஐ முயற்சிக்கவும்

source: cannot read HEAD
ta: தலையைப் படிக்க முடியாது
