Repository: Nizhal/git-ta-po
Catalog: po/*.po
Languages: ta

source: A git directory for '%s' is found locally with remote(s):
ta: '%s' க்கான ஒரு அறிவிலி அடைவு தொலை (கள்) உடன் உள்நாட்டில் காணப்படுகிறது:

source: If you want to reuse this local git directory instead of cloning again from %s use the '--force' option. If the local git directory is not the correct repo or you are unsure what this means choose another name with the '--name' option.
ta: இந்த உள்ளக அறிவிலி கோப்பகத்தை மீண்டும் குளோனிங் செய்வதற்கு பதிலாக மீண்டும் பயன்படுத்த விரும்பினால் %s '--force' விருப்பத்தைப் பயன்படுத்தவும். உள்ளக அறிவிலி அடைவு சரியான ரெப்போ இல்லையென்றால் அல்லது இதன் பொருள் என்னவென்று உங்களுக்குத் தெரியவில்லை '--name' விருப்பத்துடன் மற்றொரு பெயரைத் தேர்வுசெய்க.

source: Reactivating local git directory for submodule '%s'
ta: துணைதொகுதி '%s' க்கான உள்ளக அறிவிலி கோப்பகத்தை மீண்டும் செயல்படுத்துதல்

source: unable to checkout submodule '%s'
ta: '%s' துணைதொகுதி சரிபார்க்க முடியவில்லை

source: please make sure that the .gitmodules file is in the working tree
ta: .gitmodules கோப்பு பணி மரத்தில் இருப்பதை உறுதிப்படுத்தவும்

source: Failed to add submodule '%s'
ta: துணைதொகுதி '%s' சேர்க்கத் தவறிவிட்டது

source: Failed to register submodule '%s'
ta: துணைதொகுதி '%s' பதிவு செய்யத் தவறிவிட்டது

source: '%s' already exists in the index
ta: '%s' ஏற்கனவே குறியீட்டில் உள்ளது

source: '%s' already exists in the index and is not a submodule
ta: '%s' ஏற்கனவே குறியீட்டில் உள்ளது மற்றும் இது ஒரு துணைதொகுதி அல்ல

source: '%s' does not have a commit checked out
ta: '%s' சரிபார்க்கப்பட்ட ஒரு உறுதிப்பாட்டைக் கொண்டிருக்கவில்லை

source: branch of repository to add as submodule
ta: துணைதொகுதியாக சேர்க்க களஞ்சியத்தின் கிளை

source: allow adding an otherwise ignored submodule path
ta: இல்லையெனில் புறக்கணிக்கப்பட்ட துணைதொகுதி பாதையைச் சேர்க்க அனுமதிக்கவும்

source: borrow the objects from reference repositories
ta: குறிப்பு களஞ்சியங்களிலிருந்து பொருட்களை கடன் வாங்கவும்

source: sets the submodule's name to the given string instead of defaulting to its path
ta: துணைதொகுதியின் பெயரை அதன் பாதைக்கு இயல்புநிலைக்கு பதிலாக கொடுக்கப்பட்ட சரத்திற்கு அமைக்கிறது

source: git submodule add [<options>] [--] <repository> [<path>]
ta: git submodule add [<விருப்பங்கள்>] [--] <களஞ்சியம்> [<பாதை>]

source: Relative path can only be used from the toplevel of the working tree
ta: உறவினர் பாதையை பணி மரத்தின் மேல்மட்டத்திலிருந்து மட்டுமே பயன்படுத்த முடியும்

source: repo URL: '%s' must be absolute or begin with ./|../
ta: ரெப்போ url: '%s' முழுமையானதாக இருக்க வேண்டும் அல்லது தொடங்க வேண்டும். /|../

source: '%s' is not a valid submodule name
ta: '%s' என்பது சரியான துணைதொகுதி பெயர் அல்ல

source: git submodule--helper <command>
ta: git submodule--helper <கட்டளை>

source: git symbolic-ref [-m <reason>] <name> <ref>
ta: git symbolic-ref [-m <காரணம்>] <பெயர்> <குறி>

source: git symbolic-ref [-q] [--short] [--no-recurse] <name>
ta: git symbolic-ref [-q] [--short] [--no-recurse] <பெயர்>

source: git symbolic-ref --delete [-q] <name>
ta: git symbolic-ref --delete [-q] <பெயர்>

source: suppress error message for non-symbolic (detached) refs
ta: சிம்போலிக் அல்லாத (பிரிக்கப்பட்ட) குறிப்புகளுக்கான பிழை செய்தியை அடக்கவும்

source: delete symbolic ref
ta: குறியீட்டு ref ஐ நீக்கு

source: shorten ref output
ta: ref வெளியீட்டை சுருக்கவும்

source: recursively dereference (default)
ta: மீண்டும் மீண்டும் டெரென்ச் (இயல்புநிலை)

source: reason
ta: காரணம்

source: reason of the update
ta: புதுப்பிப்பின் காரணம்

source: git tag [-n[<num>]] -l [--contains <commit>] [--no-contains <commit>] [--points-at <object>] [--column[=<options>] | --no-column] [--create-reflog] [--sort=<key>] [--format=<format>] [--merged <commit>] [--no-merged <commit>] [<pattern>...]
ta: git tag [-n [<எண்>]] -l [-contains <உறுதி>] [--no-contains <உறுதி>] [--points-at <object>] [--column[=<options>] | --no-column] [--create-reflog] [--sort=<திறவுகோல்>] [--format=<வடிவம்>] [--merged <commit>] [--no-merged <commit>] [<pattern>...]

source: tag '%s' not found.
ta: குறிச்சொல் '%s' காணப்படவில்லை.

source: Deleted tag '%s' (was %s)
ta: நீக்கப்பட்ட குறிச்சொல் '%s' (இருந்தது %s)

source: unable to sign the tag
ta: குறிச்சொல்லில் கையெழுத்திட முடியவில்லை

source: You have created a nested tag. The object referred to by your new tag is already a tag. If you meant to tag the object that it points to, use: git tag -f %s %s^{}
ta: நீங்கள் ஒரு உள்ளமை குறிச்சொல்லை உருவாக்கியுள்ளீர்கள். உங்கள் புதிய குறிச்சொல்லால் குறிப்பிடப்படும் பொருள் ஏற்கனவே ஒரு குறிச்சொல். அது சுட்டிக்காட்டும் பொருளை நீங்கள் குறிக்க விரும்பினால், பயன்படுத்தவும்: git tag -f %s %s^{}

source: bad object type.
ta: மோசமான பொருள் வகை.

source: no tag message?
ta: குறிச்சொல் செய்தி இல்லையா?

source: The tag message has been left in %s
ta: குறிச்சொல் செய்தி %s இல் விடப்பட்டுள்ளது

source: list tag names
ta: குறிச்சொல் பெயர்களை பட்டியலிடுங்கள்

source: print <n> lines of each tag message
ta: ஒவ்வொரு குறிச்சொல் செய்தியின் வரிகளை அச்சிடுங்கள்

source: delete tags
ta: குறிச்சொற்களை நீக்கு

source: verify tags
ta: குறிச்சொற்களை சரிபார்

source: Tag creation options
ta: குறிச்சொல் உருவாக்கும் விருப்பங்கள்

source: annotated tag, needs a message
ta: சிறுகுறிப்பு குறிச்சொல், ஒரு செய்தி தேவை

source: tag message
ta: குறிச்சொல் செய்தி

source: force edit of tag message
ta: குறிச்சொல் செய்தியின் திருத்து

source: annotated and GPG-signed tag
ta: சிறுகுறிப்பு மற்றும் சிபிசி கையொப்பமிடப்பட்ட குறிச்சொல்

source: use another key to sign the tag
ta: குறிச்சொல்லில் கையொப்பமிட மற்றொரு விசையைப் பயன்படுத்தவும்

source: replace the tag if exists
ta: இருந்தால் குறிச்சொல்லை மாற்றவும்

source: create a reflog
ta: ஒரு பிரதிபலிப்பை உருவாக்கவும்

source: Tag listing options
ta: குறிச்சொல் பட்டியல் விருப்பங்கள்

source: show tag list in columns
ta: நெடுவரிசைகளில் குறிச்சொல் பட்டியலைக் காட்டு

source: print only tags that contain the commit
ta: உறுதிப்பாட்டைக் கொண்ட குறிச்சொற்களை மட்டும் அச்சிடுக

source: print only tags that don't contain the commit
ta: உறுதிப்பாட்டைக் கொண்டிருக்காத குறிச்சொற்களை மட்டும் அச்சிடுங்கள்

source: print only tags that are merged
ta: இணைக்கப்பட்ட குறிச்சொற்களை மட்டும் அச்சிடுக

source: print only tags that are not merged
ta: ஒன்றிணைக்கப்படாத குறிச்சொற்களை மட்டும் அச்சிடுக

source: print only tags of the object
ta: பொருளின் குறிச்சொற்களை மட்டும் அச்சிடுக

source: the '%s' option is only allowed in list mode
ta: '%s' விருப்பம் பட்டியல் பயன்முறையில் மட்டுமே அனுமதிக்கப்படுகிறது

source: '%s' is not a valid tag name.
ta: '%s' என்பது சரியான குறிச்சொல் பெயர் அல்ல.

source: tag '%s' already exists
ta: குறிச்சொல் '%s' ஏற்கனவே உள்ளது

source: Invalid cleanup mode %s
ta: தவறான தூய்மைப்படுத்தும் முறை %s

source: Updated tag '%s' (was %s)
ta: புதுப்பிக்கப்பட்ட குறிச்சொல் '%s' ( %s)

source: pack exceeds maximum allowed size
ta: கட்டு அதிகபட்சமாக அனுமதிக்கப்பட்ட அளவை மீறுகிறது

source: failed to write object in stream
ta: ச்ட்ரீமில் பொருளை எழுதுவதில் தோல்வி

source: inflate returned (%d)
ta: ரிட்டர்ன் (%d)

source: invalid blob object from stream
ta: ச்ட்ரீமில் இருந்து தவறான குமிழ் பொருள்

source: Unpacking objects
ta: பொருள்களைத் திறக்கும்

source: failed to create directory %s
ta: அடைவு %s ஐ உருவாக்குவதில் தோல்வி

source: failed to delete file %s
ta: கோப்பு %s ஐ நீக்குவதில் தோல்வி

source: failed to delete directory %s
ta: அடைவு %s ஐ நீக்குவதில் தோல்வி

source: Testing mtime in '%s'
ta: '%s' இல் mtime ஐ சோதித்தல்

source: directory stat info does not change after adding a new file
ta: புதிய கோப்பைச் சேர்த்த பிறகு அடைவு புள்ளிவிவர செய்தி மாறாது

source: directory stat info does not change after adding a new directory
ta: புதிய கோப்பகத்தைச் சேர்த்த பிறகு அடைவு புள்ளிவிவர செய்தி மாறாது

source: directory stat info changes after updating a file
ta: கோப்பைப் புதுப்பித்த பிறகு அடைவு புள்ளிவிவர செய்தி மாறுகிறது

source: directory stat info changes after adding a file inside subdirectory
ta: துணை அடைவுக்குள் ஒரு கோப்பைச் சேர்த்த பிறகு அடைவு புள்ளிவிவர செய்தி மாறுகிறது

source: directory stat info does not change after deleting a file
ta: கோப்பை நீக்கிய பின் அடைவு புள்ளிவிவர செய்தி மாறாது

source: directory stat info does not change after deleting a directory
ta: ஒரு கோப்பகத்தை நீக்கிய பின் அடைவு புள்ளிவிவர செய்தி மாறாது

source: OK
ta: சரி

source: git update-index [<options>] [--] [<file>...]
ta: git update-index [<விருப்பங்கள்>] [-] [<file> ...]

source: continue refresh even when index needs update
ta: குறியீட்டு புதுப்பிப்பு தேவைப்படும்போது கூட புதுப்பிக்கவும்

source: refresh: ignore submodules
ta: புதுப்பிக்கவும்: துணைதொகுதிகளைப் புறக்கணி

source: do not ignore new files
ta: புதிய கோப்புகளை புறக்கணிக்காதீர்கள்

source: let files replace directories and vice-versa
ta: கோப்புகள் கோப்பகங்களை மாற்றட்டும், நேர்மாறாகவும்

source: notice files missing from worktree
ta: பணியிடத்திலிருந்து காணாமல் போன கோப்புகளைக் கவனியுங்கள்

source: refresh even if index contains unmerged entries
ta: குறியீட்டில் அவிழ்க்கப்படாத உள்ளீடுகள் இருந்தாலும் புதுப்பிக்கவும்

source: refresh stat information
ta: புள்ளிவிவர தகவல்களைப் புதுப்பிக்கவும்

source: like --refresh, but ignore assume-unchanged setting
ta: --refresh போன்றது, ஆனால் அனுமதி-பொறிக்கப்பட்ட அமைப்பை புறக்கணி

source: <mode>,<object>,<path>
ta: <bood>, <பொருள்>, <பாதை>

source: add the specified entry to the index
ta: குறியீட்டில் குறிப்பிட்ட உள்ளீட்டைச் சேர்க்கவும்

source: mark files as "not changing"
ta: கோப்புகளை "மாறாதது" என்று குறிக்கவும்

source: clear assumed-unchanged bit
ta: துடை அனுமானிக்கப்பட்ட-மாறாத இருமம்

source: mark files as "index-only"
ta: கோப்புகளை "குறியீட்டு மட்டும்" என்று குறிக்கவும்

source: clear skip-worktree bit
ta: துடை தவிர்-பணிமரம் இருமம்

source: do not touch index-only entries
ta: குறியீட்டு மட்டும் உள்ளீடுகளைத் தொட வேண்டாம்

source: add to index only; do not add content to object database
ta: குறியீட்டில் மட்டுமே சேர்க்கவும்; பொருள் தரவுத்தளத்தில் உள்ளடக்கத்தை சேர்க்க வேண்டாம்

source: remove named paths even if present in worktree
ta: பணியிடத்தில் இருந்தாலும் பெயரிடப்பட்ட பாதைகளை அகற்றவும்

source: with --stdin: input lines are terminated by null bytes
ta: --stdin உடன்: உள்ளீட்டு வரிகள் சுழிய பைட்டுகளால் நிறுத்தப்படுகின்றன

source: read list of paths to be updated from standard input
ta: நிலையான உள்ளீட்டிலிருந்து புதுப்பிக்கப்பட வேண்டிய பாதைகளின் பட்டியலைப் படியுங்கள்

source: add entries from standard input to the index
ta: நிலையான உள்ளீட்டிலிருந்து குறியீட்டுக்கு உள்ளீடுகளைச் சேர்க்கவும்

source: repopulate stages #2 and #3 for the listed paths
ta: பட்டியலிடப்பட்ட பாதைகளுக்கு #2 மற்றும் #3 நிலைகளை மறுபரிசீலனை செய்யுங்கள்

source: only update entries that differ from HEAD
ta: தலையிலிருந்து வேறுபடும் உள்ளீடுகளை மட்டுமே புதுப்பிக்கவும்

source: ignore files missing from worktree
ta: பணியிடத்திலிருந்து காணாமல் போன கோப்புகளை புறக்கணி

source: report actions to standard output
ta: நிலையான வெளியீட்டிற்கு செயல்களைப் புகாரளிக்கவும்

source: (for porcelains) forget saved unresolved conflicts
ta: (பீங்கான்) காப்பாற்றப்பட்ட தீர்க்கப்படாத மோதல்களை மறந்து விடுங்கள்

source: write index in this format
ta: இந்த வடிவத்தில் குறியீட்டை எழுதுங்கள்

source: report on-disk index format version
ta: டிச்க் குறியீட்டு வடிவமைப்பு பதிப்பைப் புகாரளிக்கவும்

source: enable or disable split index
ta: பிளவு குறியீட்டை இயக்கவும் அல்லது முடக்கவும்

source: enable/disable untracked cache
ta: கட்டுப்படுத்தப்படாத தற்காலிக சேமிப்பை இயக்கவும்/முடக்கவும்

source: test if the filesystem supports untracked cache
ta: கோப்பு முறைமை கட்டுப்படுத்தப்படாத தற்காலிக சேமிப்பை ஆதரித்தால் சோதிக்கவும்

source: enable untracked cache without testing the filesystem
ta: கோப்பு முறைமையை சோதிக்காமல் கட்டுப்படுத்தப்படாத தற்காலிக சேமிப்பை இயக்கவும்

source: write out the index even if is not flagged as changed
ta: மாற்றப்பட்டபடி கொடியிடப்படாவிட்டாலும் குறியீட்டை எழுதுங்கள்

source: enable or disable file system monitor
ta: கோப்பு முறைமை மானிட்டரை இயக்கவும் அல்லது முடக்கவும்

source: mark files as fsmonitor valid
ta: கோப்புகளை fsmonitor செல்லுபடியாகும் எனக் குறிக்கவும்

source: clear fsmonitor valid bit
ta: துடை fsmonitor செல்லுபடியாகும் இருமம்

source: index-version: was %d, set to %d
ta: குறியீட்டு-பதிப்பு: %d, %d என அமைக்கப்பட்டது

source: core.splitIndex is set to false; remove or change it, if you really want to enable split index
ta: core.splitIndex தவறானதாக அமைக்கப்பட்டுள்ளது; பிளவு குறியீட்டை இயக்க விரும்பினால் அதை அகற்று அல்லது மாற்றவும்

source: core.splitIndex is set to true; remove or change it, if you really want to disable split index
ta: core.splitIndex உண்மை என அமைக்கப்பட்டுள்ளது; பிளவு குறியீட்டை முடக்க விரும்பினால் அதை அகற்று அல்லது மாற்றவும்

source: core.untrackedCache is set to true; remove or change it, if you really want to disable the untracked cache
ta: core.untrackedCache உண்மை என அமைக்கப்பட்டுள்ளது; கட்டுப்படுத்தப்படாத தற்காலிக சேமிப்பை முடக்க விரும்பினால் அதை அகற்றவும் அல்லது மாற்றவும்

source: Untracked cache disabled
ta: கட்டுப்படுத்தப்படாத கேச் முடக்கப்பட்டது

source: core.untrackedCache is set to false; remove or change it, if you really want to enable the untracked cache
ta: core.untrackedCache தவறானதாக அமைக்கப்பட்டுள்ளது; கட்டுப்படுத்தப்படாத தற்காலிக சேமிப்பை இயக்க விரும்பினால் அதை அகற்றவும் அல்லது மாற்றவும்

source: Untracked cache enabled for '%s'
ta: '%s' க்கு செயல்படுத்தப்படாத தற்காலிக சேமிப்பு இயக்கப்பட்டது

source: core.fsmonitor is unset; set it if you really want to enable fsmonitor
ta: core.fsmonitor sonbed; நீங்கள் உண்மையிலேயே fsmonitor ஐ இயக்க விரும்பினால் அதை அமைக்கவும்

source: fsmonitor enabled
ta: fsmonitor இயக்கப்பட்டது

source: core.fsmonitor is set; remove it if you really want to disable fsmonitor
ta: core.fsmonitor அமைக்கப்பட்டுள்ளது; நீங்கள் உண்மையில் fsmonitor ஐ முடக்க விரும்பினால் அதை அகற்றவும்

source: fsmonitor disabled
ta: fsmonitor முடக்கப்பட்டது

source: delete the reference
ta: குறிப்பை நீக்கு

source: update <refname> not the one it points to
ta: புதுப்பிப்பு <effname> அது சுட்டிக்காட்டும் ஒன்றல்ல

source: stdin has NUL-terminated arguments
ta: stdin nul- நிறுத்தப்பட்ட வாதங்களைக் கொண்டுள்ளது

source: read updates from stdin
ta: stdin இலிருந்து புதுப்பிப்புகளைப் படியுங்கள்

source: update the info files from scratch
ta: புதிதாக செய்தி கோப்புகளைப் புதுப்பிக்கவும்

source: git-upload-pack [--[no-]strict] [--timeout=<n>] [--stateless-rpc] [--advertise-refs] <directory>
ta: git-upload-pack [-[இல்லை-] கண்டிப்பான] [-timeout=<எ>] [--stateless-rpc] [--advertise-refs] <அடைவு>

source: quit after a single request/response exchange
ta: ஒற்றை கோரிக்கை/மறுமொழி பரிமாற்றத்திற்குப் பிறகு வெளியேறவும்

source: serve up the info/refs for git-http-backend
ta: git-http-backend க்கான தகவல்/குறிப்புகளை வழங்கவும்

source: do not try <directory>/.git/ if <directory> is no Git directory
ta: <ighatory>/. git/ if <factory> git அடைவு அல்ல என்பதை முயற்சிக்க வேண்டாம்

source: interrupt transfer after <n> seconds of inactivity
ta: <n> செயலற்ற தன்மைக்குப் பிறகு பரிமாற்ற பரிமாற்றம்

source: git verify-commit [-v | --verbose] [--raw] <commit>...
ta: git verify-commit [-v | --verbose] [--raw] <உறுதி>...

source: print commit contents
ta: உள்ளடக்கங்களை அச்சிடுங்கள்

source: print raw gpg status output
ta: மூல சிபிசி நிலை வெளியீட்டை அச்சிடுக

source: git verify-pack [-v | --verbose] [-s | --stat-only] [--] <pack>.idx...
ta: git verify-pack [-v | --verbose] [-s | --stat-only] [-] <கட்டு>.idx...

source: verbose
ta: வாய்மொழி

source: show statistics only
ta: புள்ளிவிவரங்களை மட்டும் காட்டு

source: git verify-tag [-v | --verbose] [--format=<format>] [--raw] <tag>...
ta: git verify-tag [-v | --verbose] [--format=<வடிவம்>] [--raw] <குறி>...

source: print tag contents
ta: குறிச்சொல் உள்ளடக்கங்களை அச்சிடுக

source: git worktree add [-f] [--detach] [--checkout] [--lock [--reason <string>]] [--orphan] [(-b | -B) <new-branch>] <path> [<commit-ish>]
ta: git worktree add [-f] [--detach] [--checkout] [--lock [--reason <சரம்>]] [--orphan] [(-b | -B) <புதிய-கிளை>] <பாதை> [<உறுதியாக>]

source: git worktree lock [--reason <string>] <worktree>
ta: git worktree lock [--reason <சரம்>] <பணிமரம்>

source: git worktree move <worktree> <new-path>
ta: git worktree move <பணிமரம்> <புதிய-பாதை>

source: git worktree prune [-n] [-v] [--expire <expire>]
ta: git worktree prune [-n] [-v] [--expire <காலவதி>]

source: git worktree remove [-f] <worktree>
ta: git worktree remove [-f] <பணிமரம்>

source: git worktree repair [<path>...]
ta: git worktree repair [<பாதை> ...]

source: git worktree unlock <worktree>
ta: git worktree unlock <பணிமரம்>

source: No possible source branch, inferring '--orphan'
ta: சாத்தியமான மூல கிளை இல்லை, '--orphan'

source: If you meant to create a worktree containing a new unborn branch (branch with no commits) for this repository, you can do so using the --orphan flag: git worktree add --orphan -b %s %s
ta: புதிய பிறக்காத கிளையைக் கொண்ட ஒரு பணியாளரை உருவாக்க நீங்கள் விரும்பினால் (எந்தவொரு கமையும் இல்லாத கிளை) இந்த களஞ்சியத்திற்கு, நீங்கள் அவ்வாறு செய்யலாம் --orphan கொடியைப் பயன்படுத்துதல்: git worktree கூட்டு -chorpan -b %s %s

source: If you meant to create a worktree containing a new unborn branch (branch with no commits) for this repository, you can do so using the --orphan flag: git worktree add --orphan %s
ta: புதிய பிறக்காத கிளையைக் கொண்ட ஒரு பணியாளரை உருவாக்க நீங்கள் விரும்பினால் (எந்தவொரு கமையும் இல்லாத கிளை) இந்த களஞ்சியத்திற்கு, நீங்கள் அவ்வாறு செய்யலாம் --orphan கொடியைப் பயன்படுத்துதல்: git worktree கூட்டு -chorphan %s

source: Removing %s/%s: %s
ta: %s/ %s ஐ நீக்குதல்: %s

source: report pruned working trees
ta: கொடிமுந்திருக்கும் மரங்களை அறிக்கை

source: expire working trees older than <time>
ta: <time> ஐ விட பழைய பணி மரங்களை காலாவதியாகுங்கள்

source: '%s' already exists
ta: '%s' ஏற்கனவே உள்ளது

source: unusable worktree destination '%s'
ta: பயன்படுத்த முடியாத பணிப்பறை இலக்கு '%s'

source: '%s' is a missing but locked worktree; use '%s -f -f' to override, or 'unlock' and 'prune' or 'remove' to clear
ta: '%s' என்பது காணாமல் போன ஆனால் பூட்டப்பட்ட பணியாளர்; மிகைப்படுத்த '%s -f -f' ஐப் பயன்படுத்தவும், அல்லது 'திறத்தல்' மற்றும் 'ப்ரூன்' அல்லது அழிக்க 'அகற்று'

source: '%s' is a missing but already registered worktree; use '%s -f' to override, or 'prune' or 'remove' to clear
ta: '%s' என்பது காணாமல் போன ஆனால் ஏற்கனவே பதிவுசெய்யப்பட்ட பணிப்பாய்வு; அழிக்க '%s -f' ஐப் பயன்படுத்தவும், அல்லது அழிக்க 'ப்ரூன்' அல்லது 'அகற்று'

source: failed to copy '%s' to '%s'; sparse-checkout may not work correctly
ta: '%s' ஐ '%s' க்கு நகலெடுப்பதில் தோல்வி; சிதறல்-சோதனை சரியாக பணி செய்யாது

source: failed to copy worktree config from '%s' to '%s'
ta: '%s' முதல் '%s' வரை பணியிட கட்டமைப்பை நகலெடுப்பதில் தோல்வி

source: failed to unset '%s' in '%s'
ta: '%s' இல் '%s' ஐ இணைக்கத் தவறிவிட்டது

source: could not create directory of '%s'
ta: '%s' என்ற கோப்பகத்தை உருவாக்க முடியவில்லை

source: initializing
ta: துவக்குதல்

source: could not find created worktree '%s'
ta: உருவாக்கப்பட்ட பணிப்பெண் '%s' கண்டுபிடிக்க முடியவில்லை

source: Preparing worktree (new branch '%s')
ta: பணியிடத்தைத் தயாரித்தல் (புதிய கிளை '%s')

source: Preparing worktree (resetting branch '%s'; was at %s)
ta: பணியிடத்தைத் தயாரித்தல் (கிளையை மீட்டமைத்தல் '%s'; %s இல் இருந்தது)

source: Preparing worktree (checking out '%s')
ta: பணியிடத்தைத் தயாரித்தல் ('%s' ஐப் பார்க்கிறது)

source: unreachable: invalid reference: %s
ta: அணுக முடியாதது: தவறான குறிப்பு: %s

source: Preparing worktree (detached HEAD %s)
ta: பணியிடத்தைத் தயாரித்தல் (பிரிக்கப்பட்ட தலை %s)

source: HEAD points to an invalid (or orphaned) reference. HEAD path: '%s' HEAD contents: '%s'
ta: தவறான (அல்லது அனாதை) குறிப்பை தலை சுட்டிக்காட்டுகிறது. தலை பாதை: '%s' தலை உள்ளடக்கங்கள்: '%s'

source: No local or remote refs exist despite at least one remote present, stopping; use 'add -f' to override or fetch a remote first
ta: குறைந்தது ஒரு தொலை இருந்தபோதிலும் உள்ளக அல்லது தொலைதூறுகள் எதுவும் இல்லை தற்போது, நிறுத்துதல்; முதலில் தொலைதூரத்தை மேலெழுத அல்லது பெற 'add -f' ஐப் பயன்படுத்தவும்

source: checkout <branch> even if already checked out in other worktree
ta: புதுப்பித்து <கிளை> ஏற்கனவே மற்ற பணியாளர்களில் சரிபார்க்கப்பட்டாலும் கூட

source: create a new branch
ta: ஒரு புதிய கிளையை உருவாக்கவும்

source: create or reset a branch
ta: ஒரு கிளையை உருவாக்கவும் அல்லது மீட்டமை

source: create unborn branch
ta: பிறக்காத கிளையை உருவாக்கவும்

source: populate the new working tree
ta: புதிய பணி மரத்தை விரிவுபடுத்துங்கள்

source: keep the new working tree locked
ta: புதிய பணி மரத்தை பூட்டிக் கொள்ளுங்கள்

source: reason for locking
ta: பூட்டுவதற்கான காரணம்

source: set up tracking mode (see git-branch(1))
ta: கண்காணிப்பு பயன்முறையை அமைக்கவும் (git-branch(1) ஐப் பார்)

source: try to match the new branch name with a remote-tracking branch
ta: புதிய கிளை பெயரை தொலை-கண்காணிப்பு கிளையுடன் பொருத்த முயற்சிக்கவும்

source: options '%s', '%s', and '%s' cannot be used together
ta: விருப்பங்கள் '%s', '%s', மற்றும் '%s' ஆகியவற்றை ஒன்றாகப் பயன்படுத்த முடியாது

source: option '%s' and commit-ish cannot be used together
ta: விருப்பம் '%s' மற்றும் உறுதி-இச் ஒன்றாகப் பயன்படுத்த முடியாது

source: added with --lock
ta: --lock உடன் சேர்க்கப்பட்டது

source: --[no-]track can only be used if a new branch is created
ta: -[இல்லை-] ஒரு புதிய கிளை உருவாக்கப்பட்டால் மட்டுமே பாதையைப் பயன்படுத்த முடியும்

source: show extended annotations and reasons, if available
ta: கிடைத்தால், நீட்டிக்கப்பட்ட சிறுகுறிப்புகளையும் காரணங்களையும் காட்டு

source: add 'prunable' annotation to worktrees older than <time>
ta: <time> ஐ விட பழைய பணியாளர்களிடம் 'விவேகக்கூடிய' சிறுகுறிப்பைச் சேர்க்கவும்

source: terminate records with a NUL character
ta: ஒரு nul எழுத்துடன் பதிவுகளை நிறுத்தவும்

source: '%s' is not a working tree
ta: '%s' ஒரு பணி மரம் அல்ல

source: The main working tree cannot be locked or unlocked
ta: முக்கிய பணி மரத்தை பூட்டவோ திறக்கவோ முடியாது

source: '%s' is already locked, reason: %s
ta: '%s' ஏற்கனவே பூட்டப்பட்டுள்ளது, காரணம்: %s

source: '%s' is already locked
ta: '%s' ஏற்கனவே பூட்டப்பட்டுள்ளது

source: '%s' is not locked
ta: '%s' பூட்டப்படவில்லை

source: working trees containing submodules cannot be moved or removed
ta: துணைதொகுதிகளைக் கொண்ட பணி மரங்களை நகர்த்தவோ அகற்றவோ முடியாது

source: force move even if worktree is dirty or locked
ta: பணியாளர் அழுக்கு அல்லது பூட்டப்பட்டிருந்தாலும் படை நகர்வு

source: '%s' is a main working tree
ta: '%s' ஒரு முக்கிய பணி மரம்

source: could not figure out destination name from '%s'
ta: '%s' இலிருந்து இலக்கு பெயரை கண்டுபிடிக்க முடியவில்லை

source: cannot move a locked working tree, lock reason: %s use 'move -f -f' to override or unlock first
ta: பூட்டிய பணி மரத்தை நகர்த்த முடியாது, பூட்டு காரணம்: %s முதலில் மேலெழுத அல்லது திறக்க 'நகர்த்து -f -f' ஐப் பயன்படுத்தவும்

source: cannot move a locked working tree; use 'move -f -f' to override or unlock first
ta: பூட்டிய பணி மரத்தை நகர்த்த முடியாது; முதலில் மேலெழுத அல்லது திறக்க 'நகர்த்து -f -f' ஐப் பயன்படுத்தவும்

source: validation failed, cannot move working tree: %s
ta: சரிபார்ப்பு தோல்வியடைந்தது, பணி மரத்தை நகர்த்த முடியாது: %s

source: failed to move '%s' to '%s'
ta: '%s' ஐ '%s' க்கு நகர்த்துவதில் தோல்வி

source: failed to run 'git status' on '%s'
ta: '%s' இல் 'அறிவிலி நிலையை' இயக்கத் தவறிவிட்டது

source: '%s' contains modified or untracked files, use --force to delete it
ta: '%s' மாற்றியமைக்கப்பட்ட அல்லது கட்டுப்படுத்தப்படாத கோப்புகளைக் கொண்டுள்ளது, அதை நீக்க --force பயன்படுத்தவும்

source: failed to run 'git status' on '%s', code %d
ta: '%s' இல் 'அறிவிலி நிலையை' இயக்கத் தவறிவிட்டது, குறியீடு %d

source: force removal even if worktree is dirty or locked
ta: பணியாளர் அழுக்கு அல்லது பூட்டப்பட்டிருந்தாலும் கூட கட்டாயப்படுத்துதல்

source: cannot remove a locked working tree, lock reason: %s use 'remove -f -f' to override or unlock first
ta: பூட்டப்பட்ட பணி மரத்தை அகற்ற முடியாது, பூட்டு காரணம்: %s முதலில் மேலெழுத அல்லது திறக்க 'அகற்று -f -f' ஐப் பயன்படுத்தவும்

source: cannot remove a locked working tree; use 'remove -f -f' to override or unlock first
ta: பூட்டிய பணி மரத்தை அகற்ற முடியாது; முதலில் மேலெழுத அல்லது திறக்க 'அகற்று -f -f' ஐப் பயன்படுத்தவும்
