Repository: Nizhal/git-ta-po
Catalog: po/*.po
Languages: ta

source: --chmod param '%s' must be either -x or +x
ta: --chmod param '%s' ஒன்று -x அல்லது +x ஆக இருக்க வேண்டும்

source: '%s' and pathspec arguments cannot be used together
ta: '%s' மற்றும் பாதைகுறிப்பு வாதங்களை ஒன்றாகப் பயன்படுத்த முடியாது

source: Nothing specified, nothing added.
ta: எதுவும் குறிப்பிடப்படவில்லை, எதுவும் சேர்க்கப்படவில்லை.

source: index file corrupt
ta: குறியீட்டு கோப்பு ஊழல்

source: unable to write new index file
ta: புதிய குறியீட்டு கோப்பை எழுத முடியவில்லை

source: bad action '%s' for '%s'
ta: '%s' க்கு மோசமான நடவடிக்கை '%s'

source: invalid value for '%s': '%s'
ta: '%s' க்கு தவறான மதிப்பு: '%s'

source: could not read '%s'
ta: '%s' படிக்க முடியவில்லை

source: could not parse author script
ta: எழுத்தாளர் ச்கிரிப்டை அலச முடியவில்லை

source: could not parse %s
ta: %s ஐ பாகுபடுத்த முடியவில்லை

source: '%s' was deleted by the applypatch-msg hook
ta: '%s' applypatch-msg கொக்கி மூலம் நீக்கப்பட்டன

source: Malformed input line: '%s'.
ta: தவறாக உள்ளீட்டு வரி: '%s'.

source: Failed to copy notes from '%s' to '%s'
ta: '%s' இலிருந்து '%s' க்கு குறிப்புகளை நகலெடுப்பதில் தோல்வி

source: fseek failed
ta: fseek தோல்வியுற்றது

source: could not open '%s' for reading
ta: வாசிப்புக்கு '%s' திறக்க முடியவில்லை

source: could not open '%s' for writing
ta: எழுதுவதற்கு '%s' திறக்க முடியவில்லை

source: could not parse patch '%s'
ta: ஒட்டு '%s' என்று அலச முடியவில்லை

source: Only one StGIT patch series can be applied at once
ta: ஒரே நேரத்தில் ஒரு stgit ஒட்டு தொடர் மட்டுமே பயன்படுத்தப்படலாம்

source: invalid timestamp
ta: தவறான நேர முத்திரை

source: invalid Date line
ta: தவறான தேதி வரி

source: invalid timezone offset
ta: தவறான நேர மண்டல ஆஃப்செட்

source: Patch format detection failed.
ta: இணைப்பு வடிவமைப்பு கண்டறிதல் தோல்வியடைந்தது.

source: failed to create directory '%s'
ta: '%s' கோப்பகத்தை உருவாக்குவதில் தோல்வி

source: Failed to split patches.
ta: திட்டுகளைப் பிரிக்கத் தவறிவிட்டது.

source: To restore the original branch and stop patching, run "%s --abort".
ta: அசல் கிளையை மீட்டெடுக்கவும், ஒட்டுவதை நிறுத்தவும், "%s --abort" ஐ இயக்கவும்.

source: Patch sent with format=flowed; space at the end of lines might be lost.
ta: வடிவத்துடன் அனுப்பப்பட்ட ஒட்டு = பாய்ந்தது; வரிகளின் முடிவில் இடம் இழக்கப்படலாம்.

source: missing author line in commit %s
ta: உறுதி %s இல் எழுத்தாளர் வரி காணவில்லை

source: invalid ident line: %.*s
ta: தவறான அடையாள வரி: %.*s

source: unable to parse commit %s
ta: %s உறுதி செய்ய முடியவில்லை

source: Repository lacks necessary blobs to fall back on 3-way merge.
ta: களஞ்சியத்தில் 3-வழி ஒன்றிணைக்க தேவையான குமிழ்கள் இல்லை.

source: Using index info to reconstruct a base tree...
ta: ஒரு அடிப்படை மரத்தை புனரமைக்க குறியீட்டு தகவலைப் பயன்படுத்துதல் ...

source: Did you hand edit your patch? It does not apply to blobs recorded in its index.
ta: உங்கள் பேட்சைத் திருத்தினீர்களா? அதன் குறியீட்டில் பதிவு செய்யப்பட்ட குமிழிகளுக்கு இது பொருந்தாது.

source: Falling back to patching base and 3-way merge...
ta: ஒட்டுதல் தளத்திற்கு மீண்டும் விழுதல் மற்றும் 3-வழி ஒன்றிணைப்பு ...

source: Failed to merge in the changes.
ta: மாற்றங்களில் ஒன்றிணைக்கத் தவறிவிட்டது.

source: git write-tree failed to write a tree
ta: git write-tree ஒரு மரத்தை எழுதத் தவறிவிட்டது

source: applying to an empty history
ta: வெற்று வரலாற்றுக்கு பொருந்தும்

source: failed to write commit object
ta: உறுதி பொருளை எழுதுவதில் தோல்வி

source: cannot resume: %s does not exist.
ta: மீண்டும் தொடங்க முடியாது: %s இல்லை.

source: Commit Body is:
ta: உடல் உறுதிப்பாடு:

source: Apply? [y]es/[n]o/[e]dit/[v]iew patch/[a]ccept all:
ta: இடவா? [y]ஆம்/[n]இல்/[e]திருத்து/[v]காண் ஒட்டு/[a]அனைத்தும் ஏற்க:

source: unable to write index file
ta: குறியீட்டு கோப்பை எழுத முடியவில்லை

source: Dirty index: cannot apply patches (dirty: %s)
ta: அழுக்கு அட்டவணை: திட்டுகளைப் பயன்படுத்த முடியாது (அழுக்கு: %s)

source: Skipping: %.*s
ta: ச்கிப்பிங்: %.*s

source: Creating an empty commit: %.*s
ta: வெற்று உறுதிப்பாட்டை உருவாக்குதல்: %.*s

source: Patch is empty.
ta: இணைப்பு காலியாக உள்ளது.

source: Applying: %.*s
ta: விண்ணப்பித்தல்: %.*s

source: No changes -- Patch already applied.
ta: மாற்றங்கள் இல்லை - ஒட்டு ஏற்கனவே பயன்படுத்தப்பட்டது.

source: Patch failed at %s %.*s
ta: ஒட்டு %s %.*s இல் தோல்வியடைந்தது

source: Use 'git am --show-current-patch=diff' to see the failed patch
ta: தோல்வியுற்ற பேட்சைக் காண 'git am --show-current-patch=diff' ஐப் பயன்படுத்தவும்

source: No changes - recorded it as an empty commit.
ta: மாற்றங்கள் இல்லை - அதை வெற்று உறுதிப்பாடாக பதிவு செய்தது.

source: No changes - did you forget to use 'git add'? If there is nothing left to stage, chances are that something else already introduced the same changes; you might want to skip this patch.
ta: மாற்றங்கள் இல்லை - 'அறிவிலி சேர்' பயன்படுத்த மறந்துவிட்டீர்களா? மேடைக்கு எதுவும் இல்லை என்றால், வேறு ஏதாவது வாய்ப்புகள் உள்ளன ஏற்கனவே அதே மாற்றங்களை அறிமுகப்படுத்தியது; இந்த இணைப்பைத் தவிர்க்க நீங்கள் விரும்பலாம்.

source: You still have unmerged paths in your index. You should 'git add' each file with resolved conflicts to mark them as such. You might run `git rm` on a file to accept "deleted by them" for it.
ta: உங்கள் குறியீட்டில் இன்னும் அவிழ்க்கப்படாத பாதைகள் உள்ளன. ஒவ்வொரு கோப்பையும் தீர்க்கப்பட்ட மோதல்களுடன் 'சேர்க்க வேண்டும்'. அதற்காக "அவர்களால் நீக்கப்பட்ட" ஏற்றுக்கொள்ள நீங்கள் ஒரு கோப்பில் `கிட் ஆர்.எம்` இயக்கலாம்.

source: Could not parse object '%s'.
ta: பொருளின் '%s' ஐ அலச முடியவில்லை.

source: failed to clean index
ta: குறியீட்டை தூய்மை செய்வதில் தோல்வி

source: You seem to have moved HEAD since the last 'am' failure. Not rewinding to ORIG_HEAD
ta: கடைசி 'am' தோல்வியிலிருந்து நீங்கள் HEAD ஐ நகர்த்தியதாகத் தெரிகிறது. ORIG_HEAD க்கு முன்னாடி அல்ல

source: failed to read '%s'
ta: '%s' படிக்கத் தவறிவிட்டது

source: git am [<options>] [(<mbox> | <Maildir>)...]
ta: git am [<விருப்பங்கள்>] [(<mbox> | <அஞ்சல்அடைவு>) ...]

source: git am [<options>] (--continue | --skip | --abort)
ta: git am [<விருப்பங்கள்>] (--continue |--skip | --abort)

source: run interactively
ta: ஊடாடும் வகையில் இயக்கவும்

source: bypass pre-applypatch and applypatch-msg hooks
ta: பைபாச் முன்-அப்ல்பாட்ச் மற்றும் விண்ணப்பிக்கும்-எம்எச்சி கொக்கிகள்

source: historical option -- no-op
ta: வரலாற்று விருப்பம்-இல்லை-ஒப்

source: allow fall back on 3way merging if needed
ta: தேவைப்பட்டால் ஒன்றிணைவதில் 3 வழியில் மீண்டும் விழ அனுமதிக்கவும்

source: be quiet
ta: அமைதியாக இரு

source: add a Signed-off-by trailer to the commit message
ta: உறுதி செய்தியில் கையொப்பமிடப்பட்ட டிரெய்லரைச் சேர்க்கவும்

source: recode into utf8 (default)
ta: utf8 இல் (இயல்புநிலை) மறுசீரமைக்கவும்

source: pass -k flag to git-mailinfo
ta: git-mailinfo க்கு -k கொடி அனுப்பு

source: pass -b flag to git-mailinfo
ta: git-mailinfo க்கு -பி கொடி அனுப்பு

source: pass -m flag to git-mailinfo
ta: git-mailinfo க்கு -m கொடி அனுப்பு

source: pass --keep-cr flag to git-mailsplit for mbox format
ta: எம்பாக்ச் வடிவமைப்பிற்காக git-mailsplit க்கு --keep-cr கொடியை கடந்து செல்லுங்கள்

source: strip everything before a scissors line
ta: ஒரு கத்தரிக்கோல் வரிக்கு முன் எல்லாவற்றையும் அகற்றவும்

source: pass it through git-mailinfo
ta: git-mailinfo வழியாக அதை அனுப்பு

source: pass it through git-apply
ta: அதை git-apply வழியாக அனுப்பு

source: format
ta: வடிவம்

source: format the patch(es) are in
ta: வடிவமைப்பு (கள்) வடிவத்தில் உள்ளன

source: override error message when patch failure occurs
ta: இணைப்பு தோல்வி ஏற்படும் போது பிழை செய்தியை மீறவும்

source: continue applying patches after resolving a conflict
ta: மோதலைத் தீர்த்த பிறகு திட்டுகளைப் பயன்படுத்துவதைத் தொடரவும்

source: synonyms for --continue
ta: --continue இதற்கான ஒத்த சொற்கள்

source: skip the current patch
ta: தற்போதைய பேட்சைத் தவிர்க்கவும்

source: restore the original branch and abort the patching operation
ta: அசல் கிளையை மீட்டெடுத்து ஒட்டுதல் செயல்பாட்டை நிறுத்துங்கள்

source: abort the patching operation but keep HEAD where it is
ta: ஒட்டுதல் செயல்பாட்டை நிறுத்துங்கள், ஆனால் அது இருக்கும் இடத்தில் தலையை வைக்கவும்

source: show the patch being applied
ta: ஒட்டு பயன்படுத்தப்படுவதைக் காட்டு

source: record the empty patch as an empty commit
ta: வெற்று இணைப்பை வெற்று உறுதிப்பாடாக பதிவு செய்யுங்கள்

source: lie about committer date
ta: கமிசர் தேதி பற்றி பொய்

source: use current timestamp for author date
ta: ஆசிரியர் தேதிக்கு தற்போதைய நேர முத்திரையைப் பயன்படுத்தவும்

source: key-id
ta: விசை-அடையாளம்

source: GPG-sign commits
ta: சி.பி.சி-சைன் கம்யூச்

source: how to handle empty patches
ta: வெற்று திட்டுகளை எவ்வாறு கையாள்வது

source: (internal use for git-rebase)
ta: (git-rebase இதற்கான உள் பயன்பாடு)

source: The -b/--binary option has been a no-op for long time, and it will be removed. Please do not use it anymore.
ta: -b/--binary விருப்பம் நீண்ட காலமாக இல்லை, மற்றும் அது அகற்றப்படும். தயவுசெய்து இதை இனி பயன்படுத்த வேண்டாம்.

source: failed to read the index
ta: குறியீட்டைப் படிக்கத் தவறிவிட்டது

source: previous rebase directory %s still exists but mbox given.
ta: முந்தைய மறுசீரமைப்பு அடைவு %s இன்னும் உள்ளன, ஆனால் mbox கொடுக்கப்பட்டுள்ளது.

source: Stray %s directory found. Use "git am --abort" to remove it.
ta: ச்ட்ரே %s அடைவு காணப்பட்டது. அதை அகற்ற "git am --abort" ஐப் பயன்படுத்தவும்.

source: Resolve operation not in progress, we are not resuming.
ta: செயல்பாட்டை தீர்க்கவும் செயலில் இல்லை, நாங்கள் மீண்டும் தொடங்கவில்லை.

source: interactive mode requires patches on the command line
ta: ஊடாடும் பயன்முறையில் கட்டளை வரியில் திட்டுகள் தேவை

source: git apply [<options>] [<patch>...]
ta: git விண்ணப்பிக்கவும் [<விருப்பங்கள்>] [<பேட்ச்> ...]

source: could not redirect output
ta: வெளியீட்டை திருப்பிவிட முடியவில்லை

source: git archive: expected ACK/NAK, got a flush packet
ta: அறிவிலி காப்பகம்: எதிர்பார்க்கப்படும் ack/nak, ஒரு பறிப்பு பாக்கெட் கிடைத்தது

source: git archive: NACK %s
ta: அறிவிலி காப்பகம்: nack %s

source: git archive: protocol error
ta: அறிவிலி காப்பகம்: நெறிமுறை பிழை

source: git archive: expected a flush
ta: அறிவிலி காப்பகம்: ஒரு பறிப்பு எதிர்பார்க்கப்படுகிறது

source: git bisect start [--term-(new|bad)=<term> --term-(old|good)=<term>] [--no-checkout] [--first-parent] [<bad> [<good>...]] [--] [<pathspec>...]
ta: git bisect start [--term-(new|bad)=<சொல்> --term-(old|good)=<சொல்> [--no-checkout] [--first-parent] [<கெட்டது>[<நல்லது>...]] [--] [<பாதைகுறி>...]

source: git bisect (good|bad) [<rev>...]
ta: git bisect ( | கெட்டது) [<பதி> ...]

source: git bisect skip [(<rev>|<range>)...]
ta: git bisect skip [(<பதி> | <வரம்பு>) ...]

source: git bisect reset [<commit>]
ta: git bisect மீட்டமைப்பு [< உறுதி>]

source: git bisect run <cmd> [<arg>...]
ta: git bisect ஓடு <cmd> [<arg> ...]

source: cannot open file '%s' in mode '%s'
ta: பயன்முறையில் '%s' கோப்பைத் திறக்க முடியாது '%s'

source: could not write to file '%s'
ta: '%s' கோப்புக்கு எழுத முடியவில்லை

source: cannot open file '%s' for reading
ta: வாசிப்புக்கு '%s' கோப்பைத் திறக்க முடியாது

source: '%s' is not a valid term
ta: '%s' என்பது சரியான சொல் அல்ல

source: can't use the builtin command '%s' as a term
ta: பில்டின் கட்டளை '%s' ஒரு காலமாக பயன்படுத்த முடியாது

source: can't change the meaning of the term '%s'
ta: '%s' என்ற வார்த்தையின் பொருளை மாற்ற முடியாது

source: please use two different terms
ta: தயவுசெய்து இரண்டு வெவ்வேறு சொற்களைப் பயன்படுத்தவும்

source: We are not bisecting.
ta: நாங்கள் பிளவுபடவில்லை.

source: '%s' is not a valid commit
ta: '%s' என்பது சரியான உறுதி அல்ல

source: could not check out original HEAD '%s'. Try 'git bisect reset <commit>'.
ta: அசல் தலை '%s' ஐப் பார்க்க முடியவில்லை. 'git bisect மீட்டமை < உறுதி>' ஐ முயற்சிக்கவும்.

source: Bad bisect_write argument: %s
ta: மோசமான bisect_write வாதம்: %s

source: couldn't get the oid of the rev '%s'
ta: ரெவ் '%s' இன் oid ஐப் பெற முடியவில்லை

source: couldn't open the file '%s'
ta: '%s' கோப்பைத் திறக்க முடியவில்லை

source: Invalid command: you're currently in a %s/%s bisect
ta: தவறான கட்டளை: நீங்கள் தற்போது ஒரு %s/ %s இருசந்தியில் இருக்கிறீர்கள்

source: You need to give me at least one %s and %s revision. You can use "git bisect %s" and "git bisect %s" for that.
ta: நீங்கள் எனக்கு குறைந்தது ஒரு %s மற்றும் %s திருத்தத்தை கொடுக்க வேண்டும். அதற்காக நீங்கள் "git bisect %s" மற்றும் "git bisect %s" ஐப் பயன்படுத்தலாம்.

source: You need to start by "git bisect start". You then need to give me at least one %s and %s revision. You can use "git bisect %s" and "git bisect %s" for that.
ta: நீங்கள் "அறிவிலி பிசெக்ட் ச்டார்ட்" மூலம் தொடங்க வேண்டும். நீங்கள் எனக்கு குறைந்தது ஒரு %s மற்றும் %s திருத்தத்தை கொடுக்க வேண்டும். அதற்காக நீங்கள் "git bisect %s" மற்றும் "git bisect %s" ஐப் பயன்படுத்தலாம்.

source: bisecting only with a %s commit
ta: ஒரு %s உறுதிடுடன் மட்டுமே பிரித்தல்

source: Are you sure [Y/n]?
ta: நீங்கள் நிச்சயமாக [Y/n]?

source: status: waiting for both good and bad commits
ta: நிலை: நல்ல மற்றும் மோசமான உறுதிடுகளுக்காக காத்திருக்கிறது

source: status: waiting for bad commit, %d good commit known
ta: நிலை: மோசமான உறுதிப்பாட்டிற்காக காத்திருக்கிறது, %d நல்ல உறுதி அறியப்பட்டது

source: status: waiting for good commit(s), bad commit known
ta: நிலை: நல்ல உறுதிப்பாட்டிற்காக காத்திருக்கிறது (கள்), மோசமான உறுதிப்பாடு அறியப்பட்டது

source: no terms defined
ta: விதிமுறைகள் வரையறுக்கப்படவில்லை

source: Your current terms are %s for the old state and %s for the new state.
ta: உங்கள் தற்போதைய விதிமுறைகள் பழைய நிலைக்கு %s ஆகும் மற்றும் புதிய மாநிலத்திற்கு %s.

source: invalid argument %s for 'git bisect terms'. Supported options are: --term-good|--term-old and --term-bad|--term-new.
ta: 'git bisect terms' தவறான உரையாடல் %s. ஆதரிக்கப்பட்ட விருப்பங்கள்: --term-good|--term-old மற்றும் --term-bad|--term-new.

source: could not open '%s' for appending
ta: சேர்ப்பதற்கு '%s' திறக்க முடியவில்லை

source: '' is not a valid term
ta: '' என்பது சரியான சொல் அல்ல

source: unrecognized option: '%s'
ta: அங்கீகரிக்கப்படாத விருப்பம்: '%s'

source: '%s' does not appear to be a valid revision
ta: '%s' சரியான திருத்தமாகத் தெரியவில்லை

source: bad HEAD - I need a HEAD
ta: மோசமான தலை - எனக்கு ஒரு தலை தேவை

source: checking out '%s' failed. Try 'git bisect start <valid-branch>'.
ta: '%s' சோதனை செய்வது தோல்வியடைந்தது. 'git bisect தொடக்க <செல்லுபடியாகும்-கிளை>' ஐ முயற்சிக்கவும்.

source: bad HEAD - strange symbolic ref
ta: மோசமான தலை - விசித்திரமான குறியீட்டு குறிப்பு

source: invalid ref: '%s'
ta: தவறான குறிப்பு: '%s'

source: You need to start by "git bisect start"
ta: நீங்கள் "அறிவிலி பிசெக்ட் ச்டார்ட்" மூலம் தொடங்க வேண்டும்

source: Do you want me to do it for you [Y/n]?
ta: நான் உங்களுக்காக இதைச் செய்ய விரும்புகிறீர்களா [Y/n]?

source: Please call `--bisect-state` with at least one argument
ta: குறைந்தது ஒரு வாதத்துடன் `--bisect-state` ஐ அழைக்கவும்

source: 'git bisect %s' can take only one argument.
ta: 'git bisect %s' ஒரே ஒரு வாதத்தை மட்டுமே எடுக்க முடியும்.

source: Bad rev input: %s
ta: மோசமான ரெவ் உள்ளீடு: %s

source: Bad rev input (not a commit): %s
ta: மோசமான ரெவ் உள்ளீடு (ஒரு உறுதி அல்ல): %s

source: We are not bisecting.
ta: நாங்கள் பிளவுபடவில்லை.

source: '%s'?? what are you talking about?
ta: '%s' ?? நீங்கள் எதை பற்றி பேசுகிறிர்கள்?

source: cannot read file '%s' for replaying
ta: மீண்டும் இயக்க '%s' கோப்பைப் படிக்க முடியாது

source: running %s
ta: இயங்கும் %s

source: bisect run failed: no command provided.
ta: இரு இயக்கம் தோல்வியுற்றது: கட்டளை எதுவும் வழங்கப்படவில்லை.

source: unable to verify %s on good revision
ta: நல்ல திருத்தத்தில் %s ஐ சரிபார்க்க முடியவில்லை

source: bogus exit code %d for good revision
ta: நல்ல திருத்தத்திற்கு போலி வெளியேறும் குறியீடு %d

source: bisect run failed: exit code %d from %s is < 0 or >= 128
ta: இருபிரிவு இயக்கம் தோல்வியுற்றது: வெளியேறு குறி %d ஐ %s இலிருந்து < 0 அல்லது >= 128

source: cannot open file '%s' for writing
ta: எழுதுவதற்கு '%s' கோப்பைத் திறக்க முடியாது

source: bisect run cannot continue any more
ta: பிளவு இயக்கம் இனி தொடர முடியாது

source: bisect run success
ta: பி.எச்.இ.டி இயக்கம் செய்

source: bisect found first bad commit
ta: பி.எச்.ஐ.டி முதல் மோசமான உறுதிப்பாட்டைக் கண்டறிந்தது

source: bisect run failed: 'git bisect %s' exited with error code %d
ta: பிசெக்ட் இயக்கம் தோல்வியுற்றது: 'அறிவிலி பிசெக்ட் %s' பிழைக் குறியீட்டைக் கொண்டு வெளியேறியது %d

source: '%s' requires either no argument or a commit
ta: '%s' க்கு எந்த வாதமும் அல்லது ஒரு உறுதிப்பாடும் தேவையில்லை

source: '%s' requires 0 or 1 argument
ta: '%s' க்கு 0 அல்லது 1 உரையாடல் தேவை

source: '%s' requires 0 arguments
ta: '%s' க்கு 0 வாதங்கள் தேவை

source: no logfile given
ta: பதிவு செய்யப்படவில்லை

source: '%s' failed: no command provided.
ta: '%s' தோல்வியுற்றது: கட்டளை எதுவும் வழங்கப்படவில்லை.

source: need a command
ta: ஒரு கட்டளை தேவை

source: unknown command: '%s'
ta: தெரியாத கட்டளை: '%s'

source: git blame [<options>] [<rev-opts>] [<rev>] [--] <file>
ta: அறிவிலி பழி [<விருப்பங்கள்>] [<rev-opts>] [<vev>] [-] <file>

source: git annotate [<options>] [<rev-opts>] [<rev>] [--] <file>
ta: git சிறுகுறிப்பு [<விருப்பங்கள்>] [<rev-opts>] [<vev>] [-] <file>

source: <rev-opts> are documented in git-rev-list(1)
ta: <rev-opts> git-rev-list இல் ஆவணப்படுத்தப்பட்டுள்ளது (1)

source: expecting a color: %s
ta: ஒரு வண்ணத்தை எதிர்பார்க்கிறது: %s

source: must end with a color
ta: ஒரு வண்ணத்துடன் முடிவடைய வேண்டும்

source: cannot find revision %s to ignore
ta: புறக்கணிக்க திருத்தம் %s ஐக் கண்டுபிடிக்க முடியவில்லை

source: show blame entries as we find them, incrementally
ta: பழி உள்ளீடுகளை நாம் கண்டறிந்தவுடன், அதிக அளவில் காட்டுங்கள்

source: do not show object names of boundary commits (Default: off)
ta: எல்லை உறுதிடுகளின் பொருள் பெயர்களைக் காட்ட வேண்டாம் (இயல்புநிலை: முடக்கு)

source: do not treat root commits as boundaries (Default: off)
ta: வேர் உறுதிடுகளை எல்லைகளாகக் கருத வேண்டாம் (இயல்புநிலை: முடக்கப்பட்டுள்ளது)

source: show work cost statistics
ta: பணி செலவு புள்ளிவிவரங்களைக் காட்டு

source: force progress reporting
ta: படை முன்னேற்ற அறிக்கையிடல்

source: show output score for blame entries
ta: பழி உள்ளீடுகளுக்கு வெளியீட்டு மதிப்பெண்ணைக் காட்டு

source: show original filename (Default: auto)
ta: அசல் கோப்பு பெயரைக் காட்டு (இயல்புநிலை: ஆட்டோ)

source: show original linenumber (Default: off)
ta: அசல் லினென்யூம்பரைக் காட்டு (இயல்புநிலை: முடக்கப்பட்டுள்ளது)

source: show in a format designed for machine consumption
ta: இயந்திர நுகர்வுக்காக வடிவமைக்கப்பட்ட வடிவத்தில் காண்பி

source: show porcelain format with per-line commit information
ta: ஒவ்வொரு வரி உறுதி தகவலுடன் பீங்கான் வடிவமைப்பைக் காட்டு

source: use the same output mode as git-annotate (Default: off)
ta: git-annotate போன்ற அதே வெளியீட்டு பயன்முறையைப் பயன்படுத்தவும் (இயல்புநிலை: முடக்கப்பட்டுள்ளது)

source: show raw timestamp (Default: off)
ta: மூல நேர முத்திரையைக் காட்டு (இயல்புநிலை: முடக்கு)

source: show long commit SHA1 (Default: off)
ta: நீண்ட உறுதி சா 1 ஐக் காட்டு (இயல்புநிலை: முடக்கப்பட்டுள்ளது)

source: suppress author name and timestamp (Default: off)
ta: எழுத்தாளர் பெயர் மற்றும் நேர முத்திரை அடக்கவும் (இயல்புநிலை: முடக்கு)

source: show author email instead of name (Default: off)
ta: பெயருக்கு பதிலாக ஆசிரியர் மின்னஞ்சலைக் காட்டு (இயல்புநிலை: முடக்கு)

source: ignore whitespace differences
ta: இடைவெளி வேறுபாடுகளை புறக்கணி

source: rev
ta: ரெவ்

source: ignore <rev> when blaming
ta: குற்றம் சாட்டும்போது புறக்கணி

source: ignore revisions from <file>
ta: <file> இலிருந்து திருத்தங்களை புறக்கணி

source: color redundant metadata from previous line differently
ta: முந்தைய வரியிலிருந்து வண்ண தேவையற்ற மேனிலை தரவு வித்தியாசமாக

source: color lines by age
ta: வயதிற்குள் வண்ண வரிகள்

source: spend extra cycles to find better match
ta: சிறந்த பொருத்தத்தைக் கண்டுபிடிக்க கூடுதல் சுழற்சிகளைச் செலவிடுங்கள்

source: use revisions from <file> instead of calling git-rev-list
ta: git-rev-list ஐ அழைப்பதற்கு பதிலாக <file> இலிருந்து திருத்தங்களைப் பயன்படுத்தவும்

source: use <file>'s contents as the final image
ta: <file> இன் உள்ளடக்கங்களை இறுதி படமாகப் பயன்படுத்தவும்

source: score
ta: கெலிப்பெண்

source: find line copies within and across files
ta: கோப்புகளுக்கு உள்ளேயும் முழுவதும் வரி நகல்களைக் கண்டறியவும்

source: find line movements within and across files
ta: கோப்புகளுக்கு உள்ளேயும் முழுவதும் வரி இயக்கங்களைக் கண்டறியவும்

source: range
ta: வீச்சு

source: process only line range <start>,<end> or function :<funcname>
ta: வரி வரம்பு <start>, <end> அல்லது செயல்பாடு: <funcname>

source: --progress can't be used with --incremental or porcelain formats
ta: --incremental அல்லது பீங்கான் வடிவங்களுடன் --progress ஐப் பயன்படுத்த முடியாது

source: 4 years, 11 months ago
ta: 4 ஆண்டுகள், 11 மாதங்களுக்கு முன்பு

source: file %s has only %lu line
ta: கோப்பு %s %lu வரி மட்டுமே உள்ளது

source: Blaming lines
ta: குற்றம் சாட்டுதல் வரிகள்

source: git branch [<options>] [-r | -a] [--merged] [--no-merged]
ta: git branch [<விருப்பங்கள்>] [-r | -a] [--merged] [--no-merged]

source: git branch [<options>] [-f] [--recurse-submodules] <branch-name> [<start-point>]
ta: git branch [<விருப்பங்கள்>] [-f] [--recurse-submodules] <கிளை-பெயர்> [<தொடக்க-புள்ளி>]]

source: git branch [<options>] [-l] [<pattern>...]
ta: git branch [<விருப்பங்கள்>] [-l] [<முறை> ...]

source: git branch [<options>] [-r] (-d | -D) <branch-name>...
ta: git branch [<விருப்பங்கள்>] [-r] (-d | -D) <கிளை-பெயர்> ...

source: git branch [<options>] (-m | -M) [<old-branch>] <new-branch>
ta: git branch [<விருப்பங்கள்>] (-m | -M) [<பழைய-கிளை>] <புதிய-கிளை>

source: git branch [<options>] (-c | -C) [<old-branch>] <new-branch>
ta: git branch [<விருப்பங்கள்>] (-c | -C) [<பழைய-கிளை>] <புதிய-கிளை>

source: git branch [<options>] [-r | -a] [--points-at]
ta: git branch [<விருப்பங்கள்>] [-r | -a] [--points-at]

source: git branch [<options>] [-r | -a] [--format]
ta: git branch [<விருப்பங்கள்>] [-r | -a] [--format]

source: deleting branch '%s' that has been merged to '%s', but not yet merged to HEAD
ta: இணைக்கப்பட்ட '%s' கிளையை நீக்குதல் '%s', ஆனால் இன்னும் தலையில் இணைக்கப்படவில்லை

source: not deleting branch '%s' that is not yet merged to '%s', even though it is merged to HEAD
ta: இன்னும் ஒன்றிணைக்கப்படாத கிளையை '%s' நீக்கவில்லை '%s', அது தலையில் இணைக்கப்பட்டிருந்தாலும்

source: couldn't look up commit object for '%s'
ta: '%s' க்கான உறுதி பொருளைப் பார்க்க முடியவில்லை

source: the branch '%s' is not fully merged
ta: கிளை '%s' முழுமையாக இணைக்கப்படவில்லை

source: If you are sure you want to delete it, run 'git branch -D %s'
ta: நீங்கள் அதை நீக்க விரும்பினால், 'அறிவிலி கிளை -d %s' ஐ இயக்கவும்

source: update of config-file failed
ta: கட்டமைப்பு-கோப்பின் புதுப்பிப்பு தோல்வியடைந்தது

source: cannot use -a with -d
ta: -d உடன் -a ஐப் பயன்படுத்த முடியாது

source: cannot delete branch '%s' used by worktree at '%s'
ta: '%s' இல் பணியிடத்தால் பயன்படுத்தப்படும் கிளையை '%s' நீக்க முடியாது

source: remote-tracking branch '%s' not found
ta: தொலை-கண்காணிப்பு கிளை '%s' காணப்படவில்லை

source: branch '%s' not found. Did you forget --remote?
ta: கிளை '%s' காணப்படவில்லை. --remote நீங்கள் மறந்துவிட்டீர்களா?

source: branch '%s' not found
ta: கிளை '%s' காணப்படவில்லை

source: Deleted remote-tracking branch %s (was %s).
ta: நீக்கப்பட்ட தொலை-கண்காணிப்பு கிளை %s (இருந்தது %s).

source: Deleted branch %s (was %s).
ta: நீக்கப்பட்ட கிளை %s ( %s).

source: unable to parse format string
ta: வடிவ சரத்தை அலச முடியவில்லை

source: could not resolve HEAD
ta: தலையைத் தீர்க்க முடியவில்லை

source: HEAD (%s) points outside of refs/heads/
ta: HEAD (%s) புள்ளிகள் refs/heads/ க்கு வெளியே

source: branch %s is being rebased at %s
ta: கிளை %s %s இல் திரும்பப் பெறப்படுகின்றன

source: branch %s is being bisected at %s
ta: கிளை %s %s இல் பிரிக்கப்படுகின்றன

source: HEAD of working tree %s is not updated
ta: பணி மரத்தின் தலைவர் %s புதுப்பிக்கப்படவில்லை

source: invalid branch name: '%s'
ta: தவறான கிளை பெயர்: '%s'

source: no commit on branch '%s' yet
ta: கிளை '%s' இல் இதுவரை இல்லை

source: no branch named '%s'
ta: '%s' என்று பெயரிடப்படவில்லை

source: branch rename failed
ta: கிளை மறுபுறம் தோல்வியுற்றது

source: branch copy failed
ta: கிளை நகல் தோல்வியடைந்தது

source: created a copy of a misnamed branch '%s'
ta: தவறாக பெயரிடப்பட்ட கிளையின் நகலை உருவாக்கியது '%s'
