Repository: Nizhal/git-ta-po
Catalog: po/*.po
Languages: ta

source: Invalid ignored mode '%s'
ta: தவறான புறக்கணிக்கப்பட்ட பயன்முறை '%s'

source: Invalid untracked files mode '%s'
ta: தவறான கட்டுப்படுத்தப்படாத கோப்புகள் பயன்முறை '%s'

source: You are in the middle of a merge -- cannot reword.
ta: நீங்கள் ஒரு ஒன்றிணைப்பின் நடுவில் இருக்கிறீர்கள் - மறுபரிசீலனை செய்ய முடியாது.

source: You are in the middle of a cherry-pick -- cannot reword.
ta: நீங்கள் ஒரு செர்ரி-பிக் நடுவில் இருக்கிறீர்கள்-மறுபரிசீலனை செய்ய முடியாது.

source: reword option of '%s' and path '%s' cannot be used together
ta: '%s' மற்றும் பாதை '%s' ஆகியவற்றின் மறுபரிசீலனை விருப்பத்தை ஒன்றாகப் பயன்படுத்த முடியாது

source: reword option of '%s' and '%s' cannot be used together
ta: '%s' மற்றும் '%s' ஆகியவற்றின் மறுபரிசீலனை விருப்பத்தை ஒன்றாகப் பயன்படுத்த முடியாது

source: You have nothing to amend.
ta: நீங்கள் திருத்த எதுவும் இல்லை.

source: You are in the middle of a merge -- cannot amend.
ta: நீங்கள் ஒரு ஒன்றிணைப்பின் நடுவில் இருக்கிறீர்கள் - திருத்த முடியாது.

source: You are in the middle of a cherry-pick -- cannot amend.
ta: நீங்கள் ஒரு செர்ரி-பிக் நடுவில் இருக்கிறீர்கள்-திருத்த முடியாது.

source: You are in the middle of a rebase -- cannot amend.
ta: நீங்கள் ஒரு மறுதொடக்கத்தின் நடுவில் இருக்கிறீர்கள் - திருத்த முடியாது.

source: --reset-author can be used only with -C, -c or --amend.
ta: --reset-author ஐ -C, -c அல்லது --amend உடன் மட்டுமே பயன்படுத்த முடியும்.

source: unknown option: --fixup=%s:%s
ta: அறியப்படாத விருப்பம்: --fixup =%s:%s

source: paths '%s ...' with -a does not make sense
ta: -a உடன் பாதைகள் '%s ...'

source: show status concisely
ta: நிலையை சுருக்கமாகக் காட்டுங்கள்

source: show branch information
ta: கிளை தகவலைக் காட்டு

source: show stash information
ta: ச்டாச் தகவலைக் காட்டு

source: compute full ahead/behind values
ta: மதிப்புகளை முழுமையாக/பின்னால் கணக்கிடுங்கள்

source: version
ta: பதிப்பு

source: machine-readable output
ta: இயந்திரம் படிக்கக்கூடிய வெளியீடு

source: show status in long format (default)
ta: நிலையை நீண்ட வடிவத்தில் காண்பி (இயல்புநிலை)

source: terminate entries with NUL
ta: nul உடன் உள்ளீடுகளை நிறுத்தவும்

source: show untracked files, optional modes: all, normal, no. (Default: all)
ta: கட்டுப்படுத்தப்படாத கோப்புகளைக் காட்டு, விருப்ப முறைகள்: அனைத்தும், இயல்பானவை, இல்லை. (இயல்புநிலை: அனைத்தும்)

source: show ignored files, optional modes: traditional, matching, no. (Default: traditional)
ta: புறக்கணிக்கப்பட்ட கோப்புகள், விருப்ப முறைகள்: பாரம்பரிய, பொருத்தம், இல்லை. (இயல்புநிலை: பாரம்பரிய)

source: when
ta: எப்பொழுது

source: ignore changes to submodules, optional when: all, dirty, untracked. (Default: all)
ta: துணைதொகுதிகளுக்கான மாற்றங்களை புறக்கணி, விருப்பமானது எப்போது: அனைத்தும், அழுக்கு, கட்டுப்படுத்தப்படாதது. (இயல்புநிலை: அனைத்தும்)

source: list untracked files in columns
ta: கட்டுப்படுத்தப்படாத கோப்புகளை நெடுவரிசைகளில் பட்டியலிடுங்கள்

source: do not detect renames
ta: மறுபெயரிடங்களைக் கண்டறிய வேண்டாம்

source: detect renames, optionally set similarity index
ta: மறுபெயரிட்டுக் கண்டறியவும், விருப்பமாக அமைத்தல் குறியீட்டை அமைக்கவும்

source: Unsupported combination of ignored and untracked-files arguments
ta: புறக்கணிக்கப்பட்ட மற்றும் கட்டுப்படுத்தப்படாத-கோப்புகள் வாதங்களின் ஆதரிக்கப்படாத கலவையாகும்

source: suppress summary after successful commit
ta: வெற்றிகரமான உறுதிப்பாட்டிற்குப் பிறகு சுருக்கத்தை அடக்கவும்

source: show diff in commit message template
ta: உறுதி செய்தி வார்ப்புருவில் வேறுபாட்டைக் காட்டு

source: Commit message options
ta: செய்தி விருப்பங்களைச் செய்யுங்கள்

source: read message from file
ta: கோப்பிலிருந்து செய்தியைப் படியுங்கள்

source: author
ta: நூலாசிரியர்

source: override author for commit
ta: உறுதிடத்திற்காக எழுத்தாளரை மேலெழுதவும்

source: date
ta: திகதி

source: override date for commit
ta: உறுதிப்பாட்டிற்கான தேதியை மீறவும்

source: commit
ta: உறுதி

source: reuse and edit message from specified commit
ta: குறிப்பிட்ட உறுதிப்பாட்டிலிருந்து செய்தியை மீண்டும் பயன்படுத்தவும் திருத்தவும்

source: reuse message from specified commit
ta: குறிப்பிட்ட உறுதிப்பாட்டிலிருந்து செய்தியை மீண்டும் பயன்படுத்தவும்

source: [(amend|reword):]commit
ta: [(amend|reword):]உறுதி

source: use autosquash formatted message to fixup or amend/reword specified commit
ta: குறிப்பிட்ட உறுதிப்பாட்டை சரிசெய்ய அல்லது திருத்த/மறுபரிசீலனை செய்ய ஆட்டோச்காச் வடிவமைக்கப்பட்ட செய்தியைப் பயன்படுத்தவும்

source: use autosquash formatted message to squash specified commit
ta: ச்குவாச் குறிப்பிட்ட உறுதிப்பாட்டிற்கு ஆட்டோச்காச் வடிவமைக்கப்பட்ட செய்தியைப் பயன்படுத்தவும்

source: the commit is authored by me now (used with -C/-c/--amend)
ta: உறுதி இப்போது என்னால் எழுதப்பட்டுள்ளது (-C/-c/--amend உடன் பயன்படுத்தப்படுகிறது)

source: trailer
ta: டிரெய்லர்

source: add custom trailer(s)
ta: தனிப்பயன் டிரெய்லர்களைச் சேர்க்கவும்)

source: add a Signed-off-by trailer
ta: கையொப்பமிடப்பட்ட டிரெய்லரைச் சேர்க்கவும்

source: use specified template file
ta: குறிப்பிட்ட வார்ப்புரு கோப்பைப் பயன்படுத்தவும்

source: force edit of commit
ta: உறுதிடின் படை திருத்தம்

source: include status in commit message template
ta: உறுதி செய்தி வார்ப்புருவில் நிலையைச் சேர்க்கவும்

source: Commit contents options
ta: உள்ளடக்க விருப்பங்களைச் செய்யுங்கள்

source: commit all changed files
ta: மாற்றப்பட்ட அனைத்து கோப்புகளையும் செய்யுங்கள்

source: add specified files to index for commit
ta: ஒப்பந்தத்திற்காக குறிப்பிட்ட கோப்புகளை குறியீட்டில் சேர்க்கவும்

source: interactively add files
ta: ஊடாடும் வகையில் கோப்புகளைச் சேர்க்கவும்

source: interactively add changes
ta: ஊடாடும் வகையில் மாற்றங்களைச் சேர்க்கவும்

source: commit only specified files
ta: குறிப்பிட்ட கோப்புகளை மட்டுமே செய்யுங்கள்

source: bypass pre-commit and commit-msg hooks
ta: பைபாச் முன் கட்டளை மற்றும் உறுதி-எம்.எச்.சி கொக்கிகள்

source: show what would be committed
ta: என்ன செய்ய வேண்டும் என்பதைக் காட்டுங்கள்

source: amend previous commit
ta: முந்தைய உறுதிப்பாட்டை திருத்துங்கள்

source: bypass post-rewrite hook
ta: பைபாச் பிந்தைய மறுபயன்பாட்டு கொக்கி

source: ok to record an empty change
ta: வெற்று மாற்றத்தை பதிவு செய்வது சரி

source: ok to record a change with an empty message
ta: வெற்று செய்தியுடன் மாற்றத்தை பதிவு செய்வது சரி

source: could not parse HEAD commit
ta: தலையை அலச முடியவில்லை

source: Corrupt MERGE_HEAD file (%s)
ta: ஊழல் MERGE_HEAD கோப்பு (%s)

source: could not read MERGE_MODE
ta: MERGE_MODE படிக்க முடியவில்லை

source: could not read commit message: %s
ta: உறுதி செய்தியைப் படிக்க முடியவில்லை: %s

source: Aborting commit due to empty commit message.
ta: வெற்று உறுதி செய்தி காரணமாக கருக்கலைப்பு.

source: Aborting commit; you did not edit the message.
ta: கருக்கலைப்பு; நீங்கள் செய்தியைத் திருத்தவில்லை.

source: Aborting commit due to empty commit message body.
ta: வெற்று உறுதி செய்தி அமைப்பு காரணமாக கருக்கலைப்பு.

source: repository has been updated, but unable to write new index file. Check that disk is not full and quota is not exceeded, and then "git restore --staged :/" to recover.
ta: களஞ்சியம் புதுப்பிக்கப்பட்டுள்ளது, ஆனால் எழுத முடியவில்லை புதிய குறியீட்டு கோப்பு. வட்டு நிரம்பவில்லை மற்றும் ஒதுக்கீடு என்பதை சரிபார் மீறப்படவில்லை, பின்னர் "git restore --staged :/" மீட்க.

source: Config file location
ta: கோப்பு இருப்பிடம்

source: use global config file
ta: உலகளாவிய கட்டமைப்பு கோப்பைப் பயன்படுத்தவும்

source: use system config file
ta: கணினி கட்டமைப்பு கோப்பைப் பயன்படுத்தவும்

source: use repository config file
ta: களஞ்சிய கட்டமைப்பு கோப்பைப் பயன்படுத்தவும்

source: use per-worktree config file
ta: betorporktree கட்டமைப்பு கோப்பைப் பயன்படுத்தவும்

source: use given config file
ta: கொடுக்கப்பட்ட கட்டமைப்பு கோப்பைப் பயன்படுத்தவும்

source: blob-id
ta: குமிழ்-அடையாளம்

source: read config from given blob object
ta: கொடுக்கப்பட்ட குமிழ் பொருளிலிருந்து கட்டமைப்பைப் படியுங்கள்

source: Type
ta: வகை

source: type
ta: வகை

source: value is given this type
ta: மதிப்பு இந்த வகை வழங்கப்படுகிறது

source: value is "true" or "false"
ta: மதிப்பு "உண்மை" அல்லது "பொய்"

source: value is decimal number
ta: மதிப்பு தசம எண்

source: value is --bool or --int
ta: மதிப்பு --bool அல்லது --int

source: value is --bool or string
ta: மதிப்பு --bool அல்லது சரம்

source: value is a path (file or directory name)
ta: மதிப்பு ஒரு பாதை (கோப்பு அல்லது அடைவு பெயர்)

source: value is an expiry date
ta: மதிப்பு ஒரு காலாவதி தேதி

source: terminate values with NUL byte
ta: nul பைட் உடன் மதிப்புகளை நிறுத்தவும்

source: show variable names only
ta: மாறி பெயர்களை மட்டும் காட்டு

source: show origin of config (file, standard input, blob, command line)
ta: கட்டமைப்பின் தோற்றத்தைக் காட்டு (கோப்பு, நிலையான உள்ளீடு, குமிழ், கட்டளை வரி)

source: show scope of config (worktree, local, global, system, command)
ta: கட்டமைப்பின் நோக்கத்தைக் காட்டு (பணியிடங்கள், உள்ளக, உலகளாவிய, அமைப்பு, கட்டளை)

source: unrecognized --type argument, %s
ta: அங்கீகரிக்கப்படாத --type உரையாடல், %s

source: only one type at a time
ta: ஒரு நேரத்தில் ஒரு வகை மட்டுமே

source: wrong number of arguments, should be %d
ta: தவறான வாதங்கள், %d ஆக இருக்க வேண்டும்

source: wrong number of arguments, should be from %d to %d
ta: வாதங்களின் தவறான எண்ணிக்கை, %d முதல் %d வரை இருக்க வேண்டும்

source: invalid key pattern: %s
ta: தவறான முக்கிய முறை: %s

source: invalid pattern: %s
ta: தவறான முறை: %s

source: failed to format default config value: %s
ta: இயல்புநிலை கட்டமைப்பு மதிப்பை வடிவமைக்கத் தவறிவிட்டது: %s

source: cannot parse color '%s'
ta: வண்ணத்தை '%s' அலச முடியாது

source: unable to parse default color value
ta: இயல்புநிலை வண்ண மதிப்பை அலச முடியவில்லை

source: not in a git directory
ta: ஒரு அறிவிலி கோப்பகத்தில் இல்லை

source: writing to stdin is not supported
ta: stdin க்கு எழுதுவது ஆதரிக்கப்படவில்லை

source: writing config blobs is not supported
ta: கட்டமைப்பு குமிழ்களை எழுதுவது ஆதரிக்கப்படவில்லை

source: # This is Git's per-user configuration file. [user] # Please adapt and uncomment the following lines: # name = %s # email = %s
ta: # இது git இன் ஒவ்வொரு பயனர் உள்ளமைவு கோப்பு. [பயனர்] # தயவுசெய்து பின்வரும் வரிகளை மாற்றியமைத்து மாற்றவும்: # பெயர் = %s # மின்னஞ்சல் = %s

source: only one config file at a time
ta: ஒரு நேரத்தில் ஒரு கட்டமைப்பு கோப்பு மட்டுமே

source: --local can only be used inside a git repository
ta: --local ஒரு அறிவிலி களஞ்சியத்திற்குள் மட்டுமே பயன்படுத்த முடியும்

source: --blob can only be used inside a git repository
ta: --blob ஒரு அறிவிலி களஞ்சியத்திற்குள் மட்டுமே பயன்படுத்த முடியும்

source: --worktree can only be used inside a git repository
ta: --worktree ஒரு அறிவிலி களஞ்சியத்திற்குள் மட்டுமே பயன்படுத்த முடியும்

source: $HOME not set
ta: $HOME அமைக்கப்படவில்லை

source: --worktree cannot be used with multiple working trees unless the config extension worktreeConfig is enabled. Please read "CONFIGURATION FILE" section in "git help worktree" for details
ta: --worktree பல பணி மரங்களுடன் பயன்படுத்த முடியாது விரிவாக்க பணிகள் இயக்கப்பட்டுள்ளன. தயவுசெய்து "உள்ளமைவு கோப்பு" படிக்கவும் விவரங்களுக்கு "அறிவிலி உதவி பணிக்குழுக்களில்" பிரிவு

source: Other
ta: மற்றொன்று

source: respect include directives on lookup
ta: மரியாதை தேடலில் வழிமுறைகள் அடங்கும்

source: unable to read config file '%s'
ta: கட்டமைப்பு கோப்பை '%s' படிக்க முடியவில்லை

source: error processing config file(s)
ta: பிழை செயலாக்க கட்டமைப்பு கோப்பு (கள்)

source: value
ta: மதிப்பு

source: --fixed-value only applies with 'value-pattern'
ta: --fixed-value என்பது 'value-pattern' உடன் மட்டுமே பொருந்தும்

source: cannot overwrite multiple values with a single value Use a regexp, --add or --replace-all to change %s.
ta: ஒற்றை மதிப்புடன் பல மதிப்புகளை மேலெழுத முடியாது %s ஐ மாற்ற ஒரு regexp, --add அல்லது --replace-all ஐப் பயன்படுத்தவும்.

source: no such section: %s
ta: அத்தகைய பிரிவு இல்லை: %s

source: editing stdin is not supported
ta: stdin ஐத் திருத்துதல் ஆதரிக்கப்படவில்லை

source: editing blobs is not supported
ta: குமிழ்களைத் திருத்துவது ஆதரிக்கப்படவில்லை

source: cannot create configuration file %s
ta: உள்ளமைவு கோப்பு %s ஐ உருவாக்க முடியாது

source: Action
ta: செயல்

source: get value specific for the URL: section[.var] URL
ta: முகவரி க்கு குறிப்பிட்ட மதிப்பைப் பெறுங்கள்: பிரிவு [.var] முகவரி

source: add a new variable: name value
ta: புதிய மாறியைச் சேர்க்கவும்: பெயர் மதிப்பு

source: rename section: old-name new-name
ta: மறுபெயரிடு பிரிவு: பழைய பெயர் புதிய பெயர்

source: remove a section: name
ta: ஒரு பகுதியை அகற்று: பெயர்

source: list all
ta: அனைத்தையும் பட்டியலிடுங்கள்

source: open an editor
ta: ஒரு எடிட்டரைத் திறக்கவும்

source: with --get, use default value when missing entry
ta: --get உடன், உள்ளீட்டைக் காணாமல் போகும்போது இயல்புநிலை மதிப்பைப் பயன்படுத்தவும்

source: --get-color and variable type are incoherent
ta: --get-color மற்றும் மாறி வகை ஆகியவை பொருத்தமற்றவை

source: --name-only is only applicable to --list or --get-regexp
ta: --name-only --list அல்லது --get-regexp க்கு மட்டுமே பொருந்தும்

source: --show-origin is only applicable to --get, --get-all, --get-regexp, and --list
ta: --show-origin என்பது --get, --get-all, --get-regexp மற்றும் --list க்கு மட்டுமே பொருந்தும்

source: --default is only applicable to --get
ta: --default என்பது --get க்கு மட்டுமே பொருந்தும்

source: print sizes in human readable format
ta: மனித படிக்கக்கூடிய வடிவத்தில் அளவுகளை அச்சிடுக

source: The permissions on your socket directory are too loose; other users may be able to read your cached credentials. Consider running: chmod 0700 %s
ta: உங்கள் சாக்கெட் கோப்பகத்தில் உள்ள அனுமதிகள் மிகவும் தளர்வானவை; மற்றொன்று பயனர்கள் உங்கள் தற்காலிக சேமிப்பு நற்சான்றிதழ்களைப் படிக்க முடியும். ஓடுவதைக் கவனியுங்கள்: chmod 0700 %s

source: print debugging messages to stderr
ta: பிழைத்திருத்த செய்திகளை ச்டெர்ருக்கு அச்சிடுங்கள்

source: credential-cache--daemon unavailable; no unix socket support
ta: credential-cache--daemon கிடைக்கவில்லை; யூனிக்ச் சாக்கெட் உதவி இல்லை

source: credential-cache unavailable; no unix socket support
ta: credential-cache கிடைக்கவில்லை; யூனிக்ச் சாக்கெட் உதவி இல்லை

source: unable to get credential storage lock in %d ms
ta: %d ms இல் நற்சான்றிதழ் சேமிப்பு பூட்டைப் பெற முடியவில்லை

source: git describe [--all] [--tags] [--contains] [--abbrev=<n>] [<commit-ish>...]
ta: git describe [--all] [--tags] [--contains] [--abbrev=<n>] [<உறுதி-கள்>...]

source: git describe [--all] [--tags] [--contains] [--abbrev=<n>] --dirty[=<mark>]
ta: git describe [--all] [--tags] [--contains] [--abbrev=<n>] --dirty[=<குறி>]

source: git describe <blob>
ta: அறிவிலி <bulob> ஐ விவரிக்கவும்

source: head
ta: தலை

source: lightweight
ta: இலகுரக

source: annotated
ta: சிறுகுறிப்பு

source: annotated tag %s not available
ta: சிறுகுறிப்பு குறிச்சொல் %s கிடைக்கவில்லை

source: tag '%s' is externally known as '%s'
ta: குறிச்சொல் '%s' வெளிப்புறமாக '%s' என்று அழைக்கப்படுகிறது

source: no tag exactly matches '%s'
ta: எந்த குறிச்சொல்லும் சரியாக '%s' பொருந்தவில்லை

source: No exact match on refs or tags, searching to describe
ta: குறிப்புகள் அல்லது குறிச்சொற்களில் சரியான பொருத்தம் இல்லை, விவரிக்க தேடுகிறது

source: finished search at %s
ta: %s இல் தேடப்பட்டது

source: No annotated tags can describe '%s'. However, there were unannotated tags: try --tags.
ta: சிறுகுறிப்பு குறிச்சொற்கள் '%s' விவரிக்க முடியாது. இருப்பினும், அறிவிக்கப்படாத குறிச்சொற்கள் இருந்தன: முயற்சிக்கவும் --tags.

source: No tags can describe '%s'. Try --always, or create some tags.
ta: எந்த குறிச்சொற்களும் '%s' விவரிக்க முடியாது. --always முயற்சிக்கவும் அல்லது சில குறிச்சொற்களை உருவாக்கவும்.

source: traversed %lu commits
ta: பயணித்த %lu உறுதிமொழிகள்

source: describe %s
ta: %s ஐ விவரிக்கவும்

source: Not a valid object name %s
ta: செல்லுபடியாகும் பொருள் பெயர் %s அல்ல

source: %s is neither a commit nor blob
ta: %s ஒரு உறுதி அல்லது குமிழ் அல்ல

source: find the tag that comes after the commit
ta: உறுதிப்பாட்டிற்குப் பிறகு வரும் குறிச்சொல்லைக் கண்டறியவும்

source: debug search strategy on stderr
ta: ச்டெர்ரில் தேடல் உத்தி பிழைத்திருத்த

source: use any ref
ta: எந்த குறிப்பையும் பயன்படுத்தவும்

source: use any tag, even unannotated
ta: எந்த குறிச்சொல்லையும் பயன்படுத்தவும்

source: always use long format
ta: எப்போதும் நீண்ட வடிவமைப்பைப் பயன்படுத்துங்கள்

source: only follow first parent
ta: முதல் பெற்றோரைப் பின்பற்றுங்கள்

source: only output exact matches
ta: வெளியீட்டு சரியான பொருத்தங்கள் மட்டுமே

source: consider <n> most recent tags (default: 10)
ta: <n> மிக அண்மைக் கால குறிச்சொற்களைக் கவனியுங்கள் (இயல்புநிலை: 10)

source: only consider tags matching <pattern>
ta: பொருந்தக்கூடிய குறிச்சொற்களை மட்டுமே கருத்தில் கொள்ளுங்கள் <முறை>

source: do not consider tags matching <pattern>
ta: பொருந்தக்கூடிய குறிச்சொற்களைக் கருத்தில் கொள்ள வேண்டாம் <முறை>

source: show abbreviated commit object as fallback
ta: சுருக்கமான உறுதி பொருளை குறைவடையும் என்று காட்டு

source: mark
ta: குறி

source: append <mark> on dirty working tree (default: "-dirty")
ta: அழுக்கு பணி மரத்தில் <குறி> ஐச் சேர்க்கவும் (இயல்புநிலை: "-பிரிட்டி")

source: append <mark> on broken working tree (default: "-broken")
ta: உடைந்த பணி மரத்தில் <குறி> (இயல்புநிலை: "-பிரகென்")

source: No names found, cannot describe anything.
ta: பெயர்கள் எதுவும் கிடைக்கவில்லை, எதையும் விவரிக்க முடியாது.

source: option '%s' and commit-ishes cannot be used together
ta: விருப்பம் '%s' மற்றும் உறுதி-இச்களை ஒன்றாகப் பயன்படுத்த முடியாது

source: git diagnose [(-o | --output-directory) <path>] [(-s | --suffix) <format>] [--mode=<mode>]
ta: git கண்டறிதல் [(-o | --output-directory) <athe>] [(-s |--suffix) <format>]] [--பயன்முறை = <பயன்முறை>]

source: specify a destination for the diagnostics archive
ta: கண்டறியும் காப்பகத்திற்கான ஒரு இலக்கைக் குறிப்பிடவும்

source: specify a strftime format suffix for the filename
ta: கோப்பு பெயருக்கான strftime வடிவமைப்பு பின்னொட்டைக் குறிப்பிடவும்

source: specify the content of the diagnostic archive
ta: கண்டறியும் காப்பகத்தின் உள்ளடக்கத்தைக் குறிப்பிடவும்

source: unrecognized argument: %s
ta: அங்கீகரிக்கப்படாத வாதம்: %s

source: --merge-base only works with two commits
ta: --merge-base இரண்டு உறுதிடுகளுடன் மட்டுமே பணி செய்கிறது

source: '%s': not a regular file or symlink
ta: '%s': வழக்கமான கோப்பு அல்லது சிம்லிங்க் அல்ல

source: no merge given, only parents.
ta: ஒன்றிணைக்கப்படவில்லை, பெற்றோர் மட்டுமே.

source: invalid option: %s
ta: தவறான விருப்பம்: %s

source: %s...%s: no merge base
ta: %s ...%s: ஒன்றிணைக்கும் அடிப்படை இல்லை

source: Not a git repository
ta: ஒரு அறிவிலி களஞ்சியம் அல்ல

source: invalid object '%s' given.
ta: கொடுக்கப்பட்ட தவறான பொருள் '%s'.

source: more than two blobs given: '%s'
ta: இரண்டு குமிழ்கள் கொடுக்கப்பட்டவை: '%s'

source: unhandled object '%s' given.
ta: கொடுக்கப்படாத பொருள் '%s' கொடுக்கப்பட்டுள்ளது.

source: %s...%s: multiple merge bases, using %s
ta: %s ... %s: %s ஐப் பயன்படுத்தி பல ஒன்றிணைப்பு தளங்கள்

source: git difftool [<options>] [<commit> [<commit>]] [--] [<path>...]
ta: git difftool [<விருப்பங்கள்>] [< உறுதி> [< உறுதி>]] [-] [<athe> ...]

source: could not read symlink %s
ta: சிம்லிங்க் %s படிக்க முடியவில்லை

source: could not read symlink file %s
ta: சிம்லிங்க் கோப்பு %s படிக்க முடியவில்லை

source: could not read object %s for symlink %s
ta: சிம்லிங்க் %s க்கு பொருள் %s ஐப் படிக்க முடியவில்லை

source: combined diff formats ('-c' and '--cc') are not supported in directory diff mode ('-d' and '--dir-diff').
ta: ஒருங்கிணைந்த வேறுபாடு வடிவங்கள் ('-c' மற்றும் '--cc') ஆதரிக்கப்படவில்லை அடைவு வேறுபாடு பயன்முறை ('-d' மற்றும் '--dir-diff').

source: both files modified: '%s' and '%s'.
ta: இரண்டு கோப்புகளும் மாற்றியமைக்கப்பட்டன: '%s' மற்றும் '%s'.

source: working tree file has been left.
ta: பணி மரக் கோப்பு விடப்பட்டுள்ளது.

source: could not copy '%s' to '%s'
ta: '%s' ஐ '%s' க்கு நகலெடுக்க முடியவில்லை

source: temporary files exist in '%s'.
ta: தற்காலிக கோப்புகள் '%s' இல் உள்ளன.

source: you may want to cleanup or recover these.
ta: இவற்றை தூய்மை செய்ய அல்லது மீட்டெடுக்க நீங்கள் விரும்பலாம்.

source: failed: %d
ta: தோல்வியுற்றது: %d

source: use `diff.guitool` instead of `diff.tool`
ta: `diff.tool` க்கு பதிலாக` diff.guitool` ஐப் பயன்படுத்தவும்

source: perform a full-directory diff
ta: முழு அடைவு வேறுபாடு செய்யுங்கள்

source: do not prompt before launching a diff tool
ta: வேறுபட்ட கருவியைத் தொடங்குவதற்கு முன் கேட்க வேண்டாம்

source: use symlinks in dir-diff mode
ta: டிர்-டிஃப் பயன்முறையில் சிம்லிங்க்களைப் பயன்படுத்தவும்

source: tool
ta: கருவி

source: use the specified diff tool
ta: குறிப்பிட்ட வேறுபாடு கருவியைப் பயன்படுத்தவும்

source: print a list of diff tools that may be used with `--tool`
ta: `--tool` உடன் பயன்படுத்தக்கூடிய வெவ்வேறு கருவிகளின் பட்டியலை அச்சிடுக

source: make 'git-difftool' exit when an invoked diff tool returns a non-zero exit code
ta: பூச்சியமற்ற வெளியேறும் குறியீட்டை வழங்கும்போது 'git-difftool' வெளியேறவும்

source: specify a custom command for viewing diffs
ta: வேறுபாடுகளைப் பார்க்க தனிப்பயன் கட்டளையைக் குறிப்பிடவும்

source: passed to `diff`
ta: `டிஃப்` க்கு அனுப்பப்பட்டது

source: difftool requires worktree or --no-index
ta: வேறுகருவிக்கு பணிக்குழு அல்லது --no-index தேவை

source: no <tool> given for --tool=<tool>
ta: இல்லை <கருவி> --tool=<கருவி> க்கு கொடுக்கப்பட்டுள்ளது

source: no <cmd> given for --extcmd=<cmd>
ta: இல்லை <cmd> --extcmd=<cmd> க்கு கொடுக்கப்பட்டுள்ளது

source: Error: Cannot export nested tags unless --mark-tags is specified.
ta: பிழை: --mark-tags குறிப்பிடப்படாவிட்டால் உள்ளமைக்கப்பட்ட குறிச்சொற்களை ஏற்றுமதி செய்ய முடியாது.

source: --anonymize-map token cannot be empty
ta: --anonymize-map கிள்ளாக்கு காலியாக இருக்க முடியாது

source: show progress after <n> objects
ta: <எ> பொருள்களுக்குப் பிறகு முன்னேற்றத்தைக் காட்டு

source: select handling of signed tags
ta: கையொப்பமிடப்பட்ட குறிச்சொற்களைக் கையாளுவதைத் தேர்ந்தெடுக்கவும்

source: select handling of tags that tag filtered objects
ta: வடிகட்டப்பட்ட பொருள்களைக் குறிக்கும் குறிச்சொற்களைக் கையாளுவதைத் தேர்ந்தெடுக்கவும்

source: select handling of commit messages in an alternate encoding
ta: மாற்று குறியாக்கத்தில் உறுதி செய்திகளைக் கையாள்வதைத் தேர்ந்தெடுக்கவும்

source: dump marks to this file
ta: இந்த கோப்பில் மதிப்பெண்கள்

source: import marks from this file
ta: இந்த கோப்பிலிருந்து மதிப்பெண்களை இறக்குமதி செய்யுங்கள்

source: import marks from this file if it exists
ta: இந்த கோப்பிலிருந்து மதிப்பெண்களை இறக்குமதி செய்யுங்கள்

source: fake a tagger when tags lack one
ta: குறிச்சொற்கள் இல்லாதபோது போலி ஒரு குறிச்சொல்

source: output full tree for each commit
ta: ஒவ்வொரு உறுதிப்பாட்டிற்கும் முழு மரம்

source: use the done feature to terminate the stream
ta: ச்ட்ரீமை நிறுத்த முடிந்த அம்சத்தைப் பயன்படுத்தவும்

source: skip output of blob data
ta: குமிழ் தரவின் வெளியீட்டைத் தவிர்க்கவும்

source: refspec
ta: ரெஃப்ச்பெக்

source: apply refspec to exported refs
ta: ஏற்றுமதி செய்யப்பட்ட குறிப்புகளுக்கு refspec ஐப் பயன்படுத்துங்கள்

source: anonymize output
ta: வெளியீட்டை அநாமதேயமாக்குங்கள்

source: from:to
ta: இருந்து: முதல்

source: convert <from> to <to> in anonymized output
ta: அநாமதேய வெளியீட்டில் <இலிருந்து <க்கு <க்கு மாற்றவும்

source: reference parents which are not in fast-export stream by object id
ta: பொருள் ஐடியால் வேகமான ஏற்றுமதி ச்ட்ரீமில் இல்லாத பெற்றோர்களைக் குறிப்பிடவும்

source: show original object ids of blobs/commits
ta: குமிழ்கள்/ உறுதிடுகளின் அசல் பொருள் ஐடிகளைக் காட்டு

source: label tags with mark ids
ta: மார்க் ஐடிகளுடன் குறிச்சொற்களை சிட்டை

source: Missing from marks for submodule '%s'
ta: துணைதொகுதி '%s' க்கான மதிப்பெண்களிலிருந்து காணவில்லை

source: Missing to marks for submodule '%s'
ta: துணைதொகுதி '%s' க்கான மதிப்பெண்களுக்கு காணவில்லை

source: Expected 'mark' command, got %s
ta: எதிர்பார்க்கப்படும் 'மார்க்' கட்டளை, கிடைத்தது %s

source: Expected 'to' command, got %s
ta: 'கட்டளை' என்று எதிர்பார்க்கப்படுகிறது, கிடைத்தது %s

source: Expected format name:filename for submodule rewrite option
ta: எதிர்பார்க்கப்படும் வடிவமைப்பு பெயர்: துணைதொகுதி மறு எழுதும் விருப்பத்திற்கான கோப்பு பெயர்

source: feature '%s' forbidden in input without --allow-unsafe-features
ta: --allow-unsafe-features இல்லாமல் உள்ளீட்டில் தடைசெய்யப்பட்ட '%s' நற்பொருத்தம்

source: Lockfile created but not reported: %s
ta: லாக்ஃபைல் உருவாக்கப்பட்டது ஆனால் அறிக்கையிடப்படவில்லை: %s
