Repository: Nizhal/git-ta-po
Catalog: po/*.po
Languages: ta

source: failed to run 'crontab -l'; your system might not support 'cron'
ta: 'க்ரோன்டாப் -எல்' ஐ இயக்கத் தவறிவிட்டது; உங்கள் கணினி 'கிரான்' ஐ ஆதரிக்காது

source: failed to create crontab temporary file
ta: க்ரோன்டாப் தற்காலிக கோப்பை உருவாக்குவதில் தோல்வி

source: failed to open temporary file
ta: தற்காலிக கோப்பைத் திறக்கத் தவறிவிட்டது

source: failed to run 'crontab'; your system might not support 'cron'
ta: 'க்ரோன்டாப்' இயக்கத் தவறிவிட்டது; உங்கள் கணினி 'கிரான்' ஐ ஆதரிக்காது

source: 'crontab' died
ta: 'க்ரோன்டாப்' இறந்தார்

source: failed to delete '%s'
ta: '%s' நீக்குவதில் தோல்வி

source: failed to flush '%s'
ta: '%s' பறிப்பதில் தோல்வி

source: failed to start systemctl
ta: systemctl ஐத் தொடங்குவதில் தோல்வி

source: failed to run systemctl
ta: systemctl ஐ இயக்கத் தவறிவிட்டது

source: unrecognized --scheduler argument '%s'
ta: அங்கீகரிக்கப்படாத --scheduler உரையாடல் '%s'

source: neither systemd timers nor crontab are available
ta: சிச்டம் டி டைமர்கள் அல்லது க்ரோன்டாப் எதுவும் கிடைக்கவில்லை

source: %s scheduler is not available
ta: %s திட்டமிடல் கிடைக்கவில்லை

source: git maintenance start [--scheduler=<scheduler>]
ta: git maintenance start [--scheduler=<திட்டமிடல்>]

source: scheduler
ta: திட்டமிடுபவர்

source: scheduler to trigger git maintenance run
ta: அறிவிலி பராமரிப்பு ஓட்டத்தைத் தூண்டுவதற்கான திட்டமிடல்

source: failed to set up maintenance schedule
ta: பராமரிப்பு அட்டவணையை அமைப்பதில் தோல்வி

source: failed to add repo to global config
ta: உலகளாவிய கட்டமைப்பில் ரெப்போவைச் சேர்க்கத் தவறிவிட்டது

source: git maintenance <subcommand> [<options>]
ta: அறிவிலி பராமரிப்பு <துணைக் கட்டளை> [<விருப்பங்கள்>]

source: git grep [<options>] [-e] <pattern> [<rev>...] [[--] <path>...]
ta: git grep [<விருப்பங்கள்>] [-e] <முறை> [<vev> ...] [[-] <athe> ...]

source: grep: failed to create thread: %s
ta: உவவெஅ: நூலை உருவாக்குவதில் தோல்வி: %s

source: invalid number of threads specified (%d) for %s
ta: குறிப்பிடப்பட்ட நூல்களின் தவறான எண்ணிக்கை ( %d) %s க்கு

source: no threads support, ignoring %s
ta: %s ஐ புறக்கணித்து, நூல்கள் ஆதரிக்கவில்லை

source: unable to read tree %s
ta: மரம் %s படிக்க முடியவில்லை

source: unable to grep from object of type %s
ta: வகை %s பொருளிலிருந்து கிரெப் செய்ய முடியவில்லை

source: switch `%c' expects a numerical value
ta: `%c 'ஒரு எண் மதிப்பை எதிர்பார்க்கிறது

source: search in index instead of in the work tree
ta: பணி மரத்திற்கு பதிலாக குறியீட்டில் தேடுங்கள்

source: find in contents not managed by git
ta: அறிவிலி நிர்வகிக்காத உள்ளடக்கங்களில் கண்டறியவும்

source: search in both tracked and untracked files
ta: கண்காணிக்கப்பட்ட மற்றும் கட்டுப்படுத்தப்படாத கோப்புகளில் தேடுங்கள்

source: ignore files specified via '.gitignore'
ta: '.gitignore' வழியாக குறிப்பிடப்பட்ட கோப்புகளை புறக்கணி

source: recursively search in each submodule
ta: ஒவ்வொரு துணைதொகுதியில் மீண்டும் மீண்டும் தேடுங்கள்

source: show non-matching lines
ta: பொருந்தாத வரிகளைக் காட்டு

source: case insensitive matching
ta: வழக்கு உணர்வற்ற பொருத்தம்

source: match patterns only at word boundaries
ta: சொல் எல்லைகளில் மட்டுமே வடிவங்களை பொருத்தவும்

source: process binary files as text
ta: பைனரி கோப்புகளை உரையாக செயலாக்கவும்

source: don't match patterns in binary files
ta: பைனரி கோப்புகளில் வடிவங்களுடன் பொருந்த வேண்டாம்

source: process binary files with textconv filters
ta: textconv வடிப்பான்களுடன் பைனரி கோப்புகளை செயலாக்கவும்

source: search in subdirectories (default)
ta: துணை அடைவுகளில் தேடுங்கள் (இயல்புநிலை)

source: descend at most <n> levels
ta: அதிகபட்சம் <n> நிலைகளில் இறங்குங்கள்

source: use extended POSIX regular expressions
ta: நீட்டிக்கப்பட்ட posix வழக்கமான வெளிப்பாடுகளைப் பயன்படுத்தவும்

source: use basic POSIX regular expressions (default)
ta: அடிப்படை posix வழக்கமான வெளிப்பாடுகளைப் பயன்படுத்தவும் (இயல்புநிலை)

source: interpret patterns as fixed strings
ta: வடிவங்களை நிலையான சரங்களாக விளக்குங்கள்

source: use Perl-compatible regular expressions
ta: பெர்ல்-இணக்கமான வழக்கமான வெளிப்பாடுகளைப் பயன்படுத்தவும்

source: show line numbers
ta: வரி எண்களைக் காட்டு

source: show column number of first match
ta: முதல் போட்டியின் நெடுவரிசை எண்ணைக் காட்டு

source: don't show filenames
ta: கோப்பு பெயர்களைக் காட்ட வேண்டாம்

source: show filenames
ta: கோப்பு பெயர்களைக் காட்டு

source: show filenames relative to top directory
ta: சிறந்த கோப்பகத்துடன் தொடர்புடைய கோப்பு பெயர்களைக் காட்டு

source: show only filenames instead of matching lines
ta: பொருந்தக்கூடிய வரிகளுக்கு பதிலாக கோப்பு பெயர்களை மட்டும் காட்டு

source: synonym for --files-with-matches
ta: --files-with-matches இதற்கான ஒத்த பெயர்

source: show only the names of files without match
ta: பொருத்தமின்றி கோப்புகளின் பெயர்களை மட்டுமே காட்டுங்கள்

source: print NUL after filenames
ta: கோப்பு பெயர்களுக்குப் பிறகு nul ஐ அச்சிடுக

source: show only matching parts of a line
ta: ஒரு வரியின் பொருந்தக்கூடிய பகுதிகளை மட்டுமே காட்டு

source: show the number of matches instead of matching lines
ta: பொருந்தக்கூடிய வரிகளுக்கு பதிலாக போட்டிகளின் எண்ணிக்கையைக் காட்டு

source: highlight matches
ta: போட்டிகளை முன்னிலைப்படுத்தவும்

source: print empty line between matches from different files
ta: வெவ்வேறு கோப்புகளிலிருந்து போட்டிகளுக்கு இடையில் வெற்று வரியை அச்சிடுக

source: show filename only once above matches from same file
ta: அதே கோப்பிலிருந்து பொருந்தக்கூடிய ஒரு முறை மட்டுமே கோப்பு பெயரைக் காட்டு

source: show <n> context lines before and after matches
ta: போட்டிகளுக்கு முன்னும் பின்னும் <n> சூழல் கோடுகளைக் காட்டு

source: show <n> context lines before matches
ta: போட்டிகளுக்கு முன் <n> சூழல் கோடுகளைக் காட்டு

source: show <n> context lines after matches
ta: போட்டிகளுக்குப் பிறகு <n> சூழல் கோடுகளைக் காட்டு

source: use <n> worker threads
ta: <n> தொழிலாளர் நூல்களைப் பயன்படுத்தவும்

source: shortcut for -C NUM
ta: -c எண்

source: show a line with the function name before matches
ta: போட்டிகளுக்கு முன் செயல்பாட்டு பெயருடன் ஒரு வரியைக் காட்டு

source: show the surrounding function
ta: சுற்றியுள்ள செயல்பாட்டைக் காட்டு

source: read patterns from file
ta: கோப்பிலிருந்து வடிவங்களைப் படியுங்கள்

source: match <pattern>
ta: போட்டி <முறை>

source: combine patterns specified with -e
ta: -e உடன் குறிப்பிடப்பட்ட வடிவங்களை இணைக்கவும்

source: indicate hit with exit status without output
ta: வெளியீடு இல்லாமல் வெளியேறும் நிலையுடன் வெற்றியைக் குறிக்கவும்

source: show only matches from files that match all patterns
ta: எல்லா வடிவங்களுக்கும் பொருந்தக்கூடிய கோப்புகளிலிருந்து மட்டுமே போட்டிகளைக் காட்டு

source: pager
ta: பேசர்

source: show matching files in the pager
ta: பேசரில் பொருந்தக்கூடிய கோப்புகளைக் காட்டு

source: allow calling of grep(1) (ignored by this build)
ta: grep (1) ஐ அழைக்க அனுமதிக்கவும் (இந்த கட்டமைப்பால் புறக்கணிக்கப்பட்டது)

source: maximum number of results per file
ta: ஒரு கோப்பிற்கு அதிகபட்ச முடிவுகளின் எண்ணிக்கை

source: no pattern given
ta: எந்த முறையும் கொடுக்கப்படவில்லை

source: --no-index or --untracked cannot be used with revs
ta: --no-index அல்லது --untracked உடன் rev களுடன் பயன்படுத்த முடியாது

source: unable to resolve revision: %s
ta: திருத்தத்தை தீர்க்க முடியவில்லை: %s

source: --untracked not supported with --recurse-submodules
ta: --recurse-submodules உடன் --untracked ஆதரிக்கப்படவில்லை

source: invalid option combination, ignoring --threads
ta: தவறான விருப்ப சேர்க்கை, புறக்கணித்தல் --threads

source: no threads support, ignoring --threads
ta: நூல்கள் ஆதரிக்கவில்லை, புறக்கணித்தல் --threads

source: invalid number of threads specified (%d)
ta: குறிப்பிடப்பட்ட நூல்களின் தவறான எண்ணிக்கை (%d)

source: --open-files-in-pager only works on the worktree
ta: --open-files-in-pager பணிமரத்தில் மட்டுமே பணி செய்கிறது

source: --[no-]exclude-standard cannot be used for tracked contents
ta: கண்காணிக்கப்பட்ட உள்ளடக்கங்களுக்கு --[no-]exclude-standard பயன்படுத்த முடியாது

source: both --cached and trees are given
ta: இரண்டும் --cached மற்றும் மரங்கள் வழங்கப்படுகின்றன

source: git hash-object [-t <type>] [-w] [--path=<file> | --no-filters] [--stdin [--literally]] [--] <file>...
ta: git hash-object [-t <வகை>] [-w] [--path=<கோப்பு> | --no-filters] [--stdin [--literally]] [--] <கோப்பு>...

source: git hash-object [-t <type>] [-w] --stdin-paths [--no-filters]
ta: git hash-object [-t <வகை>] [-w] --stdin-paths [--no-filters]

source: object type
ta: பொருள் வகை

source: write the object into the object database
ta: பொருள் தரவுத்தளத்தில் பொருளை எழுதுங்கள்

source: read the object from stdin
ta: stdin இலிருந்து பொருளைப் படியுங்கள்

source: store file as is without filters
ta: வடிப்பான்கள் இல்லாமல் கோப்பை சேமிக்கவும்

source: just hash any random garbage to create corrupt objects for debugging Git
ta: பிழைத்திருத்தமான பொருட்களை உருவாக்க எந்தவொரு சீரற்ற குப்பைகளையும் ஆச் செய்யுங்கள்

source: process file as it were from this path
ta: இந்த பாதையில் இருந்து வந்ததைப் போல கோப்பு

source: print all available commands
ta: கிடைக்கக்கூடிய அனைத்து கட்டளைகளையும் அச்சிடுக

source: show external commands in --all
ta: --all இல் வெளிப்புற கட்டளைகளைக் காட்டு

source: show aliases in --all
ta: --all இல் மாற்றுப்பெயரைக் காட்டு

source: exclude guides
ta: வழிகாட்டிகளை விலக்கு

source: show man page
ta: மேன் பக்கத்தைக் காட்டு

source: show manual in web browser
ta: வலை உலாவியில் கையேட்டைக் காட்டு

source: show info page
ta: செய்தி பக்கத்தைக் காட்டு

source: print command description
ta: கட்டளை விளக்கத்தை அச்சிடுக

source: print list of useful guides
ta: பயனுள்ள வழிகாட்டிகளின் பட்டியல்

source: print list of user-facing repository, command and file interfaces
ta: பயனர் எதிர்கொள்ளும் களஞ்சியம், கட்டளை மற்றும் கோப்பு இடைமுகங்களின் பட்டியலை அச்சிடுக

source: print list of file formats, protocols and other developer interfaces
ta: கோப்பு வடிவங்கள், நெறிமுறைகள் மற்றும் பிற உருவாக்குபவர் இடைமுகங்களின் பட்டியலை அச்சிடுக

source: print all configuration variable names
ta: அனைத்து உள்ளமைவு மாறி பெயர்களையும் அச்சிடுக

source: git help [[-i|--info] [-m|--man] [-w|--web]] [<command>|<doc>]
ta: git உதவி [[-i |

source: unrecognized help format '%s'
ta: அங்கீகரிக்கப்படாத உதவி வடிவமைப்பு '%s'

source: Failed to start emacsclient.
ta: எமாக்ச்க்ளியன்ட் தொடங்குவதில் தோல்வி.

source: Failed to parse emacsclient version.
ta: எமாக்ச்க்ளியண்ட் பதிப்பை அலசத் தவறிவிட்டது.

source: emacsclient version '%d' too old (< 22).
ta: எமாக்ச்க்ளியண்ட் பதிப்பு '%d' மிகவும் பழையது (<22).

source: failed to exec '%s'
ta: '%s' நிறைவேற்றுவதில் தோல்வி

source: '%s': path for unsupported man viewer. Please consider using 'man.<tool>.cmd' instead.
ta: '%s': ஆதரிக்கப்படாத மனித பார்வையாளருக்கான பாதை. அதற்கு பதிலாக 'மேன். <கருவி> .cmd' ஐப் பயன்படுத்துங்கள்.

source: '%s': cmd for supported man viewer. Please consider using 'man.<tool>.path' instead.
ta: '%s': ஆதரிக்கப்பட்ட மனித பார்வையாளருக்கு சிஎம்டி. அதற்கு பதிலாக 'மனிதனை <கருவி> .பாத்' பயன்படுத்துவதைக் கவனியுங்கள்.

source: '%s': unknown man viewer.
ta: '%s': தெரியாத மனிதன் பார்வையாளர்.

source: no man viewer handled the request
ta: எந்த மனிதனரும் பார்வையாளரைக் கையாண்டதில்லை

source: no info viewer handled the request
ta: எந்த தகவலும் பார்வையாளர் கோரிக்கையை கையாண்டதில்லை

source: '%s' is aliased to '%s'
ta: '%s' '%s' உடன் மாற்றுப்பெயராகும்

source: bad alias.%s string: %s
ta: மோசமான மாற்றுப்பெயர். %s சரம்: %s

source: the '%s' option doesn't take any non-option arguments
ta: '%s' விருப்பம் எந்தவொரு விருப்பமற்ற வாதங்களையும் எடுக்காது

source: the '--no-[external-commands|aliases]' options can only be used with '--all'
ta: '--no-[external-commands|aliases]' விருப்பங்களை '--all' உடன் மட்டுமே பயன்படுத்த முடியும்

source: usage: %s%s
ta: பயன்பாடு: %s %s

source: 'git help config' for more information
ta: மேலும் தகவலுக்கு 'அறிவிலி உதவி கட்டமைப்பு'

source: git hook run [--ignore-missing] [--to-stdin=<path>] <hook-name> [-- <hook-args>]
ta: அறிவிலி ஊக் இயக்கம் [--ignore-missing] [--to-stdin = <athe>] <cook-name> [-<cook-args>]]

source: silently ignore missing requested <hook-name>
ta: கோரப்பட்ட <cook-name> ஐ அமைதியாக புறக்கணி

source: file to read into hooks' stdin
ta: ஊக்சின் stdin இல் படிக்க கோப்பு

source: object type mismatch at %s
ta: %s இல் பொருள் வகை பொருந்தாத தன்மை

source: did not receive expected object %s
ta: எதிர்பார்க்கப்படும் பொருள் %s பெறவில்லை

source: object %s: expected type %s, found %s
ta: பொருள் %s: எதிர்பார்க்கப்படும் வகை %s, காணப்படுகிறது %s

source: cannot fill %d byte
ta: %d பைட் நிரப்ப முடியாது

source: early EOF
ta: ஆரம்ப eof

source: read error on input
ta: உள்ளீட்டில் பிழையைப் படியுங்கள்

source: used more bytes than were available
ta: கிடைத்ததை விட அதிகமான பைட்டுகளைப் பயன்படுத்தியது

source: pack too large for current definition of off_t
ta: off_t இன் தற்போதைய வரையறைக்கு மிகப் பெரியது

source: pack exceeds maximum allowed size (%s)
ta: கட்டு அதிகபட்ச அனுமதிக்கப்பட்ட அளவை மீறுகிறது (%s)

source: pack signature mismatch
ta: கையொப்பம் பொருந்தாதது

source: pack version %<PRIu32> unsupported
ta: கட்டு பதிப்பு %<PRIu32> ஆதரிக்கப்படாதது

source: pack has bad object at offset %<PRIuMAX>: %s
ta: கட்டு ஆஃப்செட் %<PRIuMAX> இல் மோசமான பொருளைக் கொண்டுள்ளது: %s

source: inflate returned %d
ta: உயர்த்தப்பட்ட %d

source: offset value overflow for delta base object
ta: டெல்டா அடிப்படை பொருளுக்கு ஆஃப்செட் மதிப்பு வழிதல்

source: delta base offset is out of bound
ta: டெல்டா பேச் ஆஃப்செட் கட்டுப்படாதது

source: unknown object type %d
ta: அறியப்படாத பொருள் வகை %d

source: cannot pread pack file
ta: கட்டு கோப்பை முன்கூட்டியே வைக்க முடியாது

source: premature end of pack file, %<PRIuMAX> byte missing
ta: கட்டு கோப்பின் முன்கூட்டிய முடிவு, %<PRIuMAX> பைட் காணவில்லை

source: serious inflate inconsistency
ta: தீவிரமான உயர்த்துதல் முரண்பாடு

source: SHA1 COLLISION FOUND WITH %s !
ta: sha1 மோதல் %s உடன் காணப்படுகிறது!

source: cannot read existing object info %s
ta: இருக்கும் பொருள் செய்தி %s படிக்க முடியாது

source: cannot read existing object %s
ta: இருக்கும் பொருளை %s படிக்க முடியாது

source: invalid blob object %s
ta: தவறான குமிழ் பொருள் %s

source: fsck error in packed object
ta: நிரம்பிய பொருளில் fsck பிழை

source: Not all child objects of %s are reachable
ta: %s இன் அனைத்து குழந்தை பொருட்களும் அடைய முடியாது

source: failed to apply delta
ta: டெல்டாவைப் பயன்படுத்துவதில் தோல்வி

source: Receiving objects
ta: பொருள்களைப் பெறுதல்

source: Indexing objects
ta: பொருள்களை அட்டவணைப்படுத்துதல்

source: pack is corrupted (SHA1 mismatch)
ta: கட்டு சிதைந்துள்ளது (sha1 பொருந்தாதது)

source: cannot fstat packfile
ta: fstat பேக்ஃபைல் முடியாது

source: pack has junk at the end
ta: கட்டு இறுதியில் குப்பை உள்ளது

source: confusion beyond insanity in parse_pack_objects()
ta: parse_pack_objects () இல் பைத்தியக்காரத்தனத்திற்கு அப்பாற்பட்ட குழப்பம்

source: Resolving deltas
ta: டெல்டாக்களைத் தீர்ப்பது

source: unable to create thread: %s
ta: நூலை உருவாக்க முடியவில்லை: %s

source: confusion beyond insanity
ta: பைத்தியக்காரத்தனத்திற்கு அப்பாற்பட்ட குழப்பம்

source: completed with %d local object
ta: %d உள்ளக பொருளுடன் முடிக்கப்பட்டது

source: Unexpected tail checksum for %s (disk corruption?)
ta: %s (வட்டு ஊழல்?) க்கான எதிர்பாராத வால் செக்சம்

source: pack has %d unresolved delta
ta: கட்டு %d தீர்க்கப்படாத டெல்டாவைக் கொண்டுள்ளது

source: unable to deflate appended object (%d)
ta: சேர்க்கப்பட்ட பொருளை (%d) நீக்க முடியவில்லை

source: local object %s is corrupt
ta: உள்ளக பொருள் %s ஊழல் நிறைந்தவை

source: packfile name '%s' does not end with '.%s'
ta: பேக்ஃபைல் பெயர் '%s' முடிவதில்லை '.%s'

source: cannot write %s file '%s'
ta: %s கோப்பை '%s' எழுத முடியாது

source: cannot close written %s file '%s'
ta: எழுதப்பட்ட %s கோப்பை '%s' ஐ மூட முடியாது

source: unable to rename temporary '*.%s' file to '%s'
ta: தற்காலிக '*.%s' கோப்பை '%s' க்கு மறுபெயரிட முடியவில்லை

source: error while closing pack file
ta: கட்டு கோப்பை மூடும்போது பிழை

source: Cannot open existing pack file '%s'
ta: இருக்கும் கட்டு கோப்பை '%s' திறக்க முடியாது

source: Cannot open existing pack idx file for '%s'
ta: '%s' க்கு இருக்கும் கட்டு ஐடிஎக்ச் கோப்பைத் திறக்க முடியாது

source: non delta: %d object
ta: அல்லாத டெல்டா: %d பொருள்

source: chain length = %d: %lu object
ta: சங்கிலி நீளம் = %d: %lu பொருள்

source: Cannot come back to cwd
ta: cwd க்கு மீண்டும் வர முடியாது

source: bad %s
ta: மோசமான %s

source: unknown hash algorithm '%s'
ta: அறியப்படாத ஆச் வழிமுறை '%s'

source: --stdin requires a git repository
ta: --stdin க்கு ஒரு அறிவிலி களஞ்சியம் தேவை

source: --verify with no packfile name given
ta: --verify பெயர் கொடுக்கப்படவில்லை

source: fsck error in pack objects
ta: கட்டு பொருள்களில் fsck பிழை

source: git init [-q | --quiet] [--bare] [--template=<template-directory>] [--separate-git-dir <git-dir>] [--object-format=<format>] [--ref-format=<format>] [-b <branch-name> | --initial-branch=<branch-name>] [--shared[=<permissions>]] [<directory>]
ta: git init [-q | --quiet] [--bare] [--template=<வார்ப்புரு-அடைவு>] [--separate-git-dir <git-dir>] [--object-format=<format>] [--ref-format=<வடிவம்>] [-b <கிளை-பெயர்> | --initial-branch=<கிளை-பெயர்>] [--shared[=<அனுமதிகள்>]] [<அடைவு>]

source: permissions
ta: அனுமதிகள்

source: specify that the git repository is to be shared amongst several users
ta: அறிவிலி களஞ்சியம் பல பயனர்களிடையே பகிரப்பட வேண்டும் என்பதைக் குறிப்பிடவும்

source: override the name of the initial branch
ta: ஆரம்ப கிளையின் பெயரை மேலெழுதவும்

source: hash
ta: ஆச்

source: specify the hash algorithm to use
ta: பயன்படுத்த ஆச் வழிமுறையைக் குறிப்பிடவும்

source: cannot mkdir %s
ta: mkdir %s முடியாது

source: cannot chdir to %s
ta: chdir பெறுநர் %s

source: %s (or --work-tree=<directory>) not allowed without specifying %s (or --git-dir=<directory>)
ta: %s (அல்லது --work-tree=<அடைவு>) %s ஐக் குறிப்பிடாமல் அனுமதிக்கப்படவில்லை (அல்லது --git-dir=<அடைவு>)

source: Cannot access work tree '%s'
ta: பணி மரத்தை '%s' அணுக முடியாது

source: --separate-git-dir incompatible with bare repository
ta: --separate-git-dir வெற்று களஞ்சியத்துடன் பொருந்தாதது

source: could not stat %s
ta: ச்டேட் %s முடியவில்லை

source: file %s is not a regular file
ta: கோப்பு %s வழக்கமான கோப்பு அல்ல

source: file %s is not writable by user
ta: கோப்பு %s பயனரால் எழுதப்படவில்லை

source: could not open temporary file
ta: தற்காலிக கோப்பைத் திறக்க முடியவில்லை

source: could not read input file '%s'
ta: உள்ளீட்டு கோப்பை '%s' படிக்க முடியவில்லை

source: could not read from stdin
ta: stdin இலிருந்து படிக்க முடியவில்லை

source: could not rename temporary file to %s
ta: தற்காலிக கோப்பை %s க்கு மறுபெயரிட முடியவில்லை

source: edit files in place
ta: கோப்புகளைத் திருத்தவும்

source: trim empty trailers
ta: வெற்று டிரெய்லர்களை ஒழுங்கமைக்கவும்

source: placement
ta: இடவமைவு

source: where to place the new trailer
ta: புதிய டிரெய்லரை எங்கே வைக்க வேண்டும்

source: action if trailer already exists
ta: டிரெய்லர் ஏற்கனவே இருந்தால் நடவடிக்கை

source: action if trailer is missing
ta: டிரெய்லர் காணவில்லை என்றால் நடவடிக்கை

source: output only the trailers
ta: டிரெய்லர்களை மட்டும் வெளியிடுங்கள்

source: do not apply trailer.* configuration variables
ta: டிரெய்லரைப் பயன்படுத்த வேண்டாம்.* உள்ளமைவு மாறிகள்

source: reformat multiline trailer values as single-line values
ta: மல்டிலைன் டிரெய்லர் மதிப்புகளை ஒற்றை வரி மதிப்புகளாக மறுவடிவமைக்கவும்

source: alias for --only-trailers --only-input --unfold
ta: --only-trailers --only-input --unfold இவைகளுக்கான மாற்றுப்பெயர்

source: do not treat "---" as the end of input
ta: உள்ளீட்டின் முடிவாக "---" க்கு சிகிச்சையளிக்க வேண்டாம்

source: trailer(s) to add
ta: சேர்க்க டிரெய்லர் (கள்)

source: --trailer with --only-input does not make sense
ta: --trailer உடன் --only-input பொருளல்ல

source: no input file given for in-place editing
ta: இடத்தில் திருத்துதல் செய்ய உள்ளீட்டு கோப்பு எதுவும் வழங்கப்படவில்லை

source: git log [<options>] [<revision-range>] [[--] <path>...]
ta: அறிவிலி பதிவு [<விருப்பங்கள்>] [<திருத்தம்-ரேஞ்ச்>] [[-] <ath> ...]

source: git show [<options>] <object>...
ta: git காட்டு [<விருப்பங்கள்>] <borth> ...

source: invalid --decorate option: %s
ta: செல்லாத --decorate விருப்பம்: %s

source: suppress diff output
ta: வேறுபாடு வெளியீட்டை அடக்கவும்

source: show source
ta: மூலத்தைக் காட்டு

source: clear all previously-defined decoration filters
ta: முன்னர் வரையறுக்கப்பட்ட அனைத்து அலங்கார வடிப்பான்களையும் அழிக்கவும்

source: only decorate refs that match <pattern>
ta: <முறை> பொருந்தக்கூடிய குறிப்புகளை மட்டுமே அலங்கரிக்கவும்

source: do not decorate refs that match <pattern>
ta: <முறை> பொருந்தக்கூடிய குறிப்புகளை அலங்கரிக்க வேண்டாம்

source: decorate options
ta: விருப்பங்களை அலங்கரிக்கவும்

source: trace the evolution of line range <start>,<end> or function :<funcname> in <file>
ta: வரி வரம்பின் பரிணாமத்தை <தொடக்க>, <end> அல்லது செயல்பாட்டின் பரிணாமத்தைக் கண்டறியவும்: <funcname> <file> இல்

source: -L<range>:<file> cannot be used with pathspec
ta: -எல் <வரம்பு>: <file> பாதைகுறிப்பு உடன் பயன்படுத்த முடியாது

source: Final output: %d %s
ta: இறுதி வெளியீடு: %d %s

source: git show %s: bad file
ta: git காட்டு %s: மோசமான கோப்பு

source: could not read object %s
ta: பொருள் %s படிக்க முடியவில்லை

source: unknown type: %d
ta: தெரியாத வகை: %d

source: %s: invalid cover from description mode
ta: %s: விளக்க பயன்முறையிலிருந்து தவறான கவர்

source: format.headers without value
ta: format.headers மதிப்பு இல்லாமல்

source: cannot open patch file %s
ta: ஒட்டு கோப்பு %s ஐ திறக்க முடியாது

source: need exactly one range
ta: சரியாக ஒரு வரம்பு தேவை

source: not a range
ta: ஒரு வரம்பு அல்ல

source: unable to read branch description file '%s'
ta: கிளை விளக்கக் கோப்பை '%s' படிக்க முடியவில்லை

source: cover letter needs email format
ta: கவர் கடிதத்திற்கு மின்னஞ்சல் வடிவம் தேவை

source: failed to create cover-letter file
ta: கவர்-எழுத்து கோப்பை உருவாக்குவதில் தோல்வி

source: insane in-reply-to: %s
ta: பைத்தியக்காரத்தனமாக: %s

source: git format-patch [<options>] [<since> | <revision-range>]
ta: git format-patch [<விருப்பங்கள்>] [<முதல்> | <திருத்தம்-வரம்பு>]

source: two output directories?
ta: இரண்டு வெளியீட்டு கோப்பகங்கள்?

source: unknown commit %s
ta: தெரியாத உறுதி %s

source: failed to resolve '%s' as a valid ref
ta: செல்லுபடியாகும் ref ஆக '%s' ஐ தீர்க்கத் தவறிவிட்டது

source: could not find exact merge base
ta: சரியான ஒன்றிணைக்கும் தளத்தைக் கண்டுபிடிக்க முடியவில்லை

source: failed to get upstream, if you want to record base commit automatically, please use git branch --set-upstream-to to track a remote branch. Or you could specify base commit by --base=<base-commit-id> manually
ta: மேலோடை வருவதில் தோல்வி, நீங்கள் தானாகவே தளத்தை பதிவு செய்ய விரும்பினால், தொலை கிளையைக் கண்காணிக்க அறிவிலி கிளை --set-upstream-to பயன்படுத்தவும். அல்லது அடிபடை உறுதியை குறிப்பிடலாம் --base=<அடிபடை-உறுதி-அடை> கைமுறையாக

source: failed to find exact merge base
ta: சரியான ஒன்றிணைக்கும் தளத்தைக் கண்டுபிடிக்கத் தவறிவிட்டது

source: base commit should be the ancestor of revision list
ta: அடிப்படை உறுதி திருத்த பட்டியலின் மூதாதையராக இருக்க வேண்டும்

source: base commit shouldn't be in revision list
ta: அடிப்படை உறுதி திருத்த பட்டியலில் இருக்கக்கூடாது

source: cannot get patch id
ta: ஒட்டு ஐடியைப் பெற முடியாது

source: failed to infer range-diff origin of current series
ta: தற்போதைய தொடரின் வரம்பு-கடினமான தோற்றத்தை ஊகிக்கத் தவறிவிட்டது

source: using '%s' as range-diff origin of current series
ta: தற்போதைய தொடரின் வரம்பு-டிஃப் தோற்றமாக '%s' ஐப் பயன்படுத்துதல்

source: use [PATCH n/m] even with a single patch
ta: ஒற்றை இணைப்புடன் கூட [பேட்ச் n/m] ஐப் பயன்படுத்தவும்

source: use [PATCH] even with multiple patches
ta: பல திட்டுகளுடன் கூட [பேட்ச்] பயன்படுத்தவும்

source: print patches to standard out
ta: ச்டாண்டர்ட் அவுட்டுக்கு திட்டுகளை அச்சிடுக

source: generate a cover letter
ta: ஒரு கவர் கடிதத்தை உருவாக்குங்கள்

source: use simple number sequence for output file names
ta: வெளியீட்டு கோப்பு பெயர்களுக்கு எளிய எண் வரிசையைப் பயன்படுத்தவும்

source: sfx
ta: எச்.எஃப்.எக்ச்

source: use <sfx> instead of '.patch'
ta: '.பாட்ச்' என்பதற்கு பதிலாக <sfx> ஐப் பயன்படுத்தவும்

source: start numbering patches at <n> instead of 1
ta: 1 க்கு பதிலாக <n> இல் திட்டுகளை எண்ணுதல் தொடங்கவும்

source: reroll-count
ta: மறுபிரவேசம்

source: mark the series as Nth re-roll
ta: தொடரை nth re-roll எனக் குறிக்கவும்
