Repository: Nizhal/git-ta-po
Catalog: po/*.po
Languages: ta

source: packet write failed - data exceeds max packet size
ta: பாக்கெட் எழுதுதல் தோல்வியுற்றது - தரவு அதிகபட்ச பாக்கெட் அளவை மீறுகிறது

source: packet write failed: %s
ta: பாக்கெட் எழுத்து தோல்வியுற்றது: %s

source: read error
ta: பிழையைப் படியுங்கள்

source: the remote end hung up unexpectedly
ta: தொலைநிலை முடிவு எதிர்பாராத விதமாக தொங்கியது

source: protocol error: bad line length character: %.4s
ta: நெறிமுறை பிழை: மோசமான வரி நீள எழுத்து: %.4s

source: protocol error: bad line length %d
ta: நெறிமுறை பிழை: மோசமான வரி நீளம் %d

source: remote error: %s
ta: தொலை பிழை: %s

source: Refreshing index
ta: புத்துணர்ச்சியூட்டும் அட்டவணை

source: unable to create threaded lstat: %s
ta: திரிக்கப்பட்ட lstat ஐ உருவாக்க முடியவில்லை: %s

source: unable to parse --pretty format
ta: அலச முடியவில்லை --pretty வடிவம்

source: promisor-remote: unable to fork off fetch subprocess
ta: உறுதிமொழி-மறுபரிசீலனை: துணை செயலாக்கத்தைப் பெற முடியவில்லை

source: promisor-remote: could not write to fetch subprocess
ta: உறுதிமொழி-மறுபரிசீலனை: துணை செயலாக்கத்தைப் பெறுவதற்கு எழுத முடியவில்லை

source: promisor-remote: could not close stdin to fetch subprocess
ta: உறுதிமொழியாளர்-மறுபரிசீலனை: துணை செயலாக்கத்தைப் பெறுவதற்கு stdin ஐ மூட முடியவில்லை

source: promisor remote name cannot begin with '/': %s
ta: வாக்குறுதி தொலைநிலை பெயர் '/' உடன் தொடங்க முடியாது: %s

source: could not fetch %s from promisor remote
ta: ப்ராமிசர் தொலைடிலிருந்து %s பெற முடியவில்லை

source: object-info: expected flush after arguments
ta: பொருள்-இன்ஃபோ: வாதங்களுக்குப் பிறகு எதிர்பார்க்கப்படும் பறிப்பு

source: Removing duplicate objects
ta: நகல் பொருள்களை அகற்றுதல்

source: could not start `log`
ta: `log` ஐ தொடங்க முடியவில்லை

source: could not read `log` output
ta: `log` வெளியீட்டைப் படிக்க முடியவில்லை

source: could not parse commit '%s'
ta: '%s' செய்ய பாகுபடுத்த முடியவில்லை

source: could not parse first line of `log` output: did not start with 'commit ': '%s'
ta: `உள்நுழைவு` வெளியீட்டின் முதல் வரியை அலச முடியவில்லை: ' உறுதி' உடன் தொடங்கவில்லை: '%s'

source: could not parse git header '%.*s'
ta: அறிவிலி தலைப்பை '%.*s' என்று அலச முடியவில்லை

source: failed to generate diff
ta: வேறுபாட்டை உருவாக்கத் தவறிவிட்டது

source: could not parse log for '%s'
ta: '%s' க்கு பதிவை அலச முடியவில்லை

source: invalid extra cruft tip: '%s'
ta: தவறான கூடுதல் கைவினை உதவிக்குறிப்புகள்: '%s'

source: unable to enumerate additional recent objects
ta: கூடுதல் அண்மைக் கால பொருள்களை கணக்கிட முடியவில்லை

source: will not add file alias '%s' ('%s' already exists in index)
ta: கோப்பு மாற்றுப்பெயரை '%s' ('%s' ஏற்கனவே குறியீட்டில் உள்ளது) சேர்க்காது)

source: cannot create an empty blob in the object database
ta: பொருள் தரவுத்தளத்தில் வெற்று குமிழியை உருவாக்க முடியாது

source: %s: can only add regular files, symbolic links or git-directories
ta: %s: வழக்கமான கோப்புகள், குறியீட்டு இணைப்புகள் அல்லது கிட்-இயக்குநர்கள் மட்டுமே சேர்க்க முடியும்

source: unable to index file '%s'
ta: '%s' என்ற குறியீட்டு கோப்பை முடிக்க முடியவில்லை

source: unable to add '%s' to index
ta: குறியீட்டில் '%s' சேர்க்க முடியவில்லை

source: '%s' appears as both a file and as a directory
ta: '%s' ஒரு கோப்பாகவும் ஒரு கோப்பகமாகவும் தோன்றும்

source: Refresh index
ta: குறியீட்டை புதுப்பிக்கவும்

source: index.version set, but the value is invalid. Using version %i
ta: index.version set, ஆனால் மதிப்பு தவறானது. பதிப்பு %i ஐப் பயன்படுத்துதல்

source: GIT_INDEX_VERSION set, but the value is invalid. Using version %i
ta: GIT_INDEX_VERSION தொகுப்பு, ஆனால் மதிப்பு தவறானது. பதிப்பு %i ஐப் பயன்படுத்துதல்

source: bad signature 0x%08x
ta: மோசமான கையொப்பம் 0x%08x

source: bad index version %d
ta: மோசமான குறியீட்டு பதிப்பு %d

source: bad index file sha1 signature
ta: மோசமான குறியீட்டு கோப்பு sha1 கையொப்பம்

source: index uses %.4s extension, which we do not understand
ta: குறியீட்டு %.4s நீட்டிப்பைப் பயன்படுத்துகிறது, இது எங்களுக்கு புரியவில்லை

source: ignoring %.4s extension
ta: %.4s நீட்டிப்பை புறக்கணிக்கிறது

source: unknown index entry format 0x%08x
ta: அறியப்படாத குறியீட்டு நுழைவு வடிவம் 0x%08x

source: malformed name field in the index, near path '%s'
ta: குறியீட்டில் தவறாக பெயர் புலம், பாதைக்கு அருகில் '%s'

source: unordered stage entries in index
ta: குறியீட்டில் வரிசைப்படுத்தப்படாத நிலை உள்ளீடுகள்

source: multiple stage entries for merged file '%s'
ta: இணைக்கப்பட்ட கோப்பிற்கான பல நிலை உள்ளீடுகள் '%s'

source: unordered stage entries for '%s'
ta: '%s' க்கான வரிசைப்படுத்தப்படாத மேடை உள்ளீடுகள்

source: unable to create load_cache_entries thread: %s
ta: load_cache_entries நூல் உருவாக்க முடியவில்லை: %s

source: unable to join load_cache_entries thread: %s
ta: load_cache_entries நூல் சேர முடியவில்லை: %s

source: %s: index file open failed
ta: %s: குறியீட்டு கோப்பு திறந்த தோல்வியுற்றது

source: %s: cannot stat the open index
ta: %s: திறந்த குறியீட்டை நிறுத்த முடியாது

source: %s: index file smaller than expected
ta: %s: குறியீட்டு கோப்பு எதிர்பார்த்ததை விட சிறியது

source: %s: unable to map index file%s
ta: %s: குறியீட்டு கோப்பு%s ஐ வரைபடமாக்க முடியவில்லை

source: unable to create load_index_extensions thread: %s
ta: load_index_extensions நூல் உருவாக்க முடியவில்லை: %s

source: unable to join load_index_extensions thread: %s
ta: load_index_extensions நூல் சேர முடியவில்லை: %s

source: could not freshen shared index '%s'
ta: பகிரப்பட்ட குறியீட்டை '%s' புத்துணர்ச்சியடைய முடியவில்லை

source: broken index, expect %s in %s, got %s
ta: உடைந்த குறியீட்டு, %s இல் %s ஐ எதிர்பார்க்கலாம், %s கிடைத்தது

source: cannot write split index for a sparse index
ta: ஒரு சிதறிய குறியீட்டிற்கு பிளவு குறியீட்டை எழுத முடியாது

source: failed to convert to a sparse-index
ta: ஒரு சிதறிய-குறியீடாக மாற்றுவதில் தோல்வி

source: unable to open git dir: %s
ta: git அடைவு ஐ திறக்க முடியவில்லை: %s

source: unable to unlink: %s
ta: இணைக்க முடியவில்லை: %s

source: cannot fix permission bits on '%s'
ta: '%s' இல் இசைவு பிட்களை சரிசெய்ய முடியாது

source: %s: cannot drop to stage #0
ta: %s: நிலை #0 க்கு கைவிட முடியாது

source: unexpected diff status %c
ta: எதிர்பாராத வேறுபாடு நிலை %c

source: remove '%s'
ta: '%s' ஐ அகற்றவும்

source: You can fix this with 'git rebase --edit-todo' and then run 'git rebase --continue'. Or you can abort the rebase with 'git rebase --abort'.
ta: இதை நீங்கள் 'git rebase --edit-todo' மூலம் சரிசெய்யலாம், பின்னர் 'git rebase --continue' இயக்கலாம். அல்லது git rebase --abort முலம் மறுதளம் செய்யலாம்.

source: unrecognized setting %s for option rebase.missingCommitsCheck. Ignoring.
ta: rebase.missingCommitsCheck விருப்பத்திற்கான %s அங்கீகரிக்கப்படாத அமைப்பு. புறக்கணித்தல்.

source: Commands: p, pick <commit> = use commit r, reword <commit> = use commit, but edit the commit message e, edit <commit> = use commit, but stop for amending s, squash <commit> = use commit, but meld into previous commit f, fixup [-C | -c] <commit> = like "squash" but keep only the previous commit's log message, unless -C is used, in which case keep only this commit's message; -c is same as -C but opens the editor x, exec <command> = run command (the rest of the line) using shell b, break = stop here (continue rebase later with 'git rebase --continue') d, drop <commit> = remove commit l, label <label> = label current HEAD with a name t, reset <label> = reset HEAD to a label m, merge [-C <commit> | -c <commit>] <label> [# <oneline>] create a merge commit using the original merge commit's message (or the oneline, if no original merge commit was specified); use -c <commit> to reword the commit message u, update-ref <ref> = track a placeholder for the <ref> to be updated to this position in the new commits. The <ref> is updated at the end of the rebase These lines can be re-ordered; they are executed from top to bottom.
ta: கட்டளைகள்: p, தேர்வு <உறுதி> = உறுதிடைப் பயன்படுத்துங்கள் r, மறுபரிசீலனை <உறுதி> = உறுதிடைப் பயன்படுத்துங்கள், ஆனால் உறுதி செய்தியைத் திருத்தவும் e, திருத்து < உறுதி> = உறுதிடைப் பயன்படுத்துங்கள், ஆனால் திருத்துவதை நிறுத்துங்கள் s, ச்குவாச் < உறுதி> = உறுதிடைப் பயன்படுத்துங்கள், ஆனால் முந்தைய உறுதிப்பாட்டில் ஒன்றிணைக்கவும் f, சரிசெய் [-c | -c] < உறுதி> = "ச்குவாச்" போன்றவை ஆனால் முந்தையதை மட்டுமே வைத்திருங்கள் -c பயன்படுத்தப்படாவிட்டால், உறுதி இன் பதிவு செய்தி, இந்த விசயத்தில் இந்த உறுதி செய்தியை மட்டுமே வைத்திருங்கள்; -c என்பது -c ஆனால் திருத்தியைத் திறக்கிறது x, எக்செக் <கட்டளை> = செல்லைப் பயன்படுத்தி கட்டளை (மீதமுள்ள வரி) இயக்கம் கட்டளை (மீதமுள்ள வரியை) b, இடைவெளி = இங்கே நிறுத்துங்கள் (பின்னர் 'git rebase --continue' உடன் மறுசீரமைப்பைத் தொடரவும்) d, கைவிடவும் < உறுதி> = உறுதிடத்தை அகற்று எல், சிட்டை <லேபிள்> = சிட்டை தற்போதைய தலையை ஒரு பெயருடன் t, மீட்டமை <லேபிள்> = தலையை ஒரு லேபிளுக்கு மீட்டமைக்கவும் m, ஒன்றிணைத்தல் [-c < உறுதி> | -c < உறுதி>] <abile> [# <noneline>] அசல் ஒன்றிணைக்கும் உறுதிப்பாட்டைப் பயன்படுத்தி ஒரு ஒன்றிணைப்பு உறுதிப்பாட்டை உருவாக்கவும் செய்தி (அல்லது ஒன்லைன், அசல் ஒன்றிணைப்பு இல்லை என்றால் குறிப்பிடப்பட்டது); உறுதி செய்தியை மறுபரிசீலனை செய்ய -c < உறுதி> ஐப் பயன்படுத்தவும் u, update-ref <ref> = புதுப்பிக்க <ferp> க்கு ஒரு ஒதுக்கிடத்தைக் கண்காணிக்கவும் புதிய உறுதிடுகளில் இந்த நிலைக்கு. <ref> என்பது மறுசீரமைப்பின் முடிவில் புதுப்பிக்கப்பட்டது இந்த வரிகளை மீண்டும் ஒழுங்கு செய்யலாம்; அவை மேலிருந்து கீழாக செயல்படுத்தப்படுகின்றன.

source: Rebase %s onto %s (%d command)
ta: %s இல் %s ( %d கட்டளை)

source: Do not remove any line. Use 'drop' explicitly to remove a commit.
ta: எந்த வரியையும் அகற்ற வேண்டாம். ஒரு உறுதிப்பாட்டை அகற்ற 'டிராப்' ஐப் பயன்படுத்தவும்.

source: If you remove a line here THAT COMMIT WILL BE LOST.
ta: நீங்கள் இங்கே ஒரு வரியை அகற்றினால், அது இழக்கப்படும்.

source: You are editing the todo file of an ongoing interactive rebase. To continue rebase after editing, run: git rebase --continue
ta: தொடர்ச்சியான ஊடாடும் மறுசீரமைப்பின் செய்யவேண்டிய கோப்பை நீங்கள் திருத்துகிறீர்கள். திருத்துதல் செய்தபின் மறுசீரமைப்பைத் தொடர, இயக்கவும்: git rebase --continue

source: However, if you remove everything, the rebase will be aborted.
ta: இருப்பினும், நீங்கள் எல்லாவற்றையும் அகற்றினால், மறுசீரமைப்பு கைவிடப்படும்.

source: could not write '%s'.
ta: '%s' எழுத முடியவில்லை.

source: Warning: some commits may have been dropped accidentally. Dropped commits (newer to older):
ta: முன்னறிவிப்பு: சில உறுதிடுகள் தற்செயலாக கைவிடப்பட்டிருக்கலாம். கைவிடப்பட்ட உறுதிச் (பழையது முதல் பழையது):

source: To avoid this message, use "drop" to explicitly remove a commit. Use 'git config rebase.missingCommitsCheck' to change the level of warnings. The possible behaviours are: ignore, warn, error.
ta: இந்த செய்தியைத் தவிர்க்க, ஒரு உறுதிப்பாட்டை வெளிப்படையாக அகற்ற "டிராப்" ஐப் பயன்படுத்தவும். முன்னறிவிப்புகளின் அளவை மாற்ற 'git config rebase.missingCommitsCheck' ஐப் பயன்படுத்தவும். சாத்தியமான நடத்தைகள்: புறக்கணி, எச்சரிக்கவும், பிழை.

source: %s: 'preserve' superseded by 'merges'
ta: %s: 'ஒன்றிணைப்புகளால்' மீறப்பட்ட 'பாதுகாத்தல்'

source: gone
ta: சென்றது

source: ahead %d
ta: முன்னால் %d

source: behind %d
ta: %d பின்னால்

source: ahead %d, behind %d
ta: %d முன்னால் மற்றும், %d க்கு பின்னால்

source: %%(%.*s) does not take arguments
ta: %%(%.*s) வாதங்களை எடுக்காது

source: unrecognized %%(%.*s) argument: %s
ta: அங்கீகரிக்கப்படாத %%(%.*s) வாதம்: %s

source: expected format: %%(color:<color>)
ta: எதிர்பார்க்கப்படும் வடிவம்: %%(color:<color>)

source: unrecognized color: %%(color:%s)
ta: அங்கீகரிக்கப்படாத வண்ணம்: %%(color:%s)

source: Integer value expected refname:lstrip=%s
ta: முழு எண் மதிப்பு எதிர்பார்க்கப்படும் refname: lstrip =%s

source: Integer value expected refname:rstrip=%s
ta: முழு எண் மதிப்பு எதிர்பார்க்கப்படும் refname: rstrip =%s

source: expected %%(trailers:key=<value>)
ta: எதிர்பார்க்கப்படும் %%(trailers:key=<மதிப்பு>)

source: unknown %%(trailers) argument: %s
ta: தெரியாத %%(trailers) வாதம்: %s

source: positive value expected contents:lines=%s
ta: நேர்மறை மதிப்பு எதிர்பார்க்கப்படும் உள்ளடக்கங்கள்: வரிகள் =%s

source: argument expected for %s
ta: %s எதிர்பார்க்கப்படும் உரையாடல்

source: positive value expected %s=%s
ta: நேர்மறை மதிப்பு எதிர்பார்க்கப்படுகிறது %s = %s

source: cannot fully parse %s=%s
ta: %s = %s ஐ முழுமையாக அலச முடியாது

source: value expected %s=
ta: மதிப்பு எதிர்பார்க்கப்படும் %s =

source: positive value expected '%s' in %%(%s)
ta: நேர்மறை மதிப்பு '%s' எதிர்பார்க்கப்படுகிறது %%(%s) இல்

source: expected format: %%(align:<width>,<position>)
ta: எதிர்பார்க்கப்படும் வடிவம்: %%(align:<அகலம்>, <நிலை>)

source: unrecognized position:%s
ta: அங்கீகரிக்கப்படாத நிலை:%s

source: unrecognized width:%s
ta: அங்கீகரிக்கப்படாத அகலம்:%s

source: unrecognized %%(%s) argument: %s
ta: அங்கீகரிக்கப்படாத %%(%s) வாதம்: %s

source: positive width expected with the %%(align) atom
ta: %%(align) அணுவுடன் எதிர்பார்க்கப்படும் நேர்மறை அகலம்

source: expected format: %%(ahead-behind:<committish>)
ta: எதிர்பார்க்கப்படும் வடிவம்: %%(ahead-behind:<உறுதியாக>)

source: malformed field name: %.*s
ta: தவறாக புல பெயர்: %.*s

source: unknown field name: %.*s
ta: தெரியாத புலத்தின் பெயர்: %.*s

source: not a git repository, but the field '%.*s' requires access to object data
ta: ஒரு அறிவிலி களஞ்சியம் அல்ல, ஆனால் '%.*s' புலம் பொருள் தரவுகளுக்கு அணுகல் தேவை

source: format: %%(%s) atom used without a %%(%s) atom
ta: வடிவம்: %%(%s) அணு %%(%s) அணு இல்லாமல் பயன்படுத்தப்படுகிறது

source: format: %%(then) atom used more than once
ta: வடிவம்: %%(then) அணு ஒன்றுக்கு மேற்பட்ட முறை பயன்படுத்தப்பட்டது

source: format: %%(then) atom used after %%(else)
ta: வடிவம்: %%(then) அணு %%(else) க்குப் பிறகு பயன்படுத்தப்படுகிறது

source: format: %%(else) atom used more than once
ta: வடிவம்:%%(else) அணு ஒன்றுக்கு மேற்பட்ட முறை பயன்படுத்தப்பட்டது

source: format: %%(end) atom used without corresponding atom
ta: வடிவம்: %%(end) அணு தொடர்புடைய அணு இல்லாமல் பயன்படுத்தப்படுகிறது

source: malformed format string %s
ta: தவறான வடிவமைப்பு சரம் %s

source: this command reject atom %%(%.*s)
ta: இந்த கட்டளை அணுவை %%(%.*s) நிராகரி

source: --format=%.*s cannot be used with --python, --shell, --tcl
ta: --format=%.*s என்பது --python, --shell, --tcl உடன் பயன்படுத்தமுடியாது

source: failed to run 'describe'
ta: 'விவரிக்க' இயக்கத் தவறிவிட்டது

source: (no branch, rebasing %s)
ta: (கிளை இல்லை, %s மீண்டும் உருவாக்குதல்)

source: (no branch, rebasing detached HEAD %s)
ta: (கிளை இல்லை, பிரிக்கப்பட்ட தலை %s ஐ மீண்டும் மாற்றுகிறது)

source: (HEAD detached at %s)
ta: (தலை %s இல் பிரிக்கப்பட்டுள்ளது)

source: (HEAD detached from %s)
ta: ( %s இலிருந்து பிரிக்கப்பட்டுள்ளது)

source: (no branch)
ta: (கிளை இல்லை)

source: missing object %s for %s
ta: %s க்கு பொருள் %s

source: parse_object_buffer failed on %s for %s
ta: parse_object_buffer %s இல் %s இல் தோல்வியுற்றது

source: malformed object at '%s'
ta: '%s' இல் தவறாக பொருள்

source: ignoring ref with broken name %s
ta: உடைந்த பெயருடன் %s உடன் ref ஐ புறக்கணிக்கிறது

source: ignoring broken ref %s
ta: உடைந்த ref %s ஐ புறக்கணித்தல்

source: format: %%(end) atom missing
ta: வடிவம்: %%(end) அணு காணவில்லை

source: malformed object name %s
ta: தவறாக பொருள் பெயர் %s

source: option `%s' must point to a commit
ta: விருப்பம் `%s 'ஒரு உறுதிப்பாட்டை சுட்டிக்காட்ட வேண்டும்

source: key
ta: விசை

source: field name to sort on
ta: வரிசைப்படுத்த புல பெயர்

source: exclude refs which match pattern
ta: எந்த வடிவத்துடன் பொருந்துகிறது என்பதை விலக்கு

source: not a reflog: %s
ta: ஒரு பிரதிபலிப்பு அல்ல: %s

source: no reflog for '%s'
ta: '%s' க்கு பிரதிபலிப்பு இல்லை

source: %s does not point to a valid object!
ta: %s செல்லுபடியாகும் பொருளை சுட்டிக்காட்டாது!

source: Using '%s' as the name for the initial branch. This default branch name is subject to change. To configure the initial branch name to use in all of your new repositories, which will suppress this warning, call: git config --global init.defaultBranch <name> Names commonly chosen instead of 'master' are 'main', 'trunk' and 'development'. The just-created branch can be renamed via this command: git branch -m <name>
ta: ஆரம்ப கிளையின் பெயராக '%s' ஐப் பயன்படுத்துதல். இந்த இயல்புநிலை கிளை பெயர் மாற்றத்திற்கு உட்பட்டது. எல்லாவற்றிலும் பயன்படுத்த ஆரம்ப கிளை பெயரை உள்ளமைக்க இந்த முன்னறிவிப்புயை அடக்கும் உங்கள் புதிய களஞ்சியங்களில், அழைக்கவும்: git config --global init.defaultBranch <பெயர்> 'மாச்டர்' என்பதற்கு பதிலாக பொதுவாக தேர்ந்தெடுக்கப்பட்ட பெயர்கள் 'பிரதான', 'தண்டு' மற்றும் 'வளர்ச்சி'. இப்போது உருவாக்கப்பட்ட கிளையை இந்த கட்டளை மூலம் மறுபெயரிடலாம்: git branch -m <பெயர்>

source: could not retrieve `%s`
ta: `%s` மீட்டெடுக்க முடியவில்லை

source: invalid branch name: %s = %s
ta: தவறான கிளை பெயர்: %s = %s

source: ignoring dangling symref %s
ta: தொங்கும் சிமிரெஃப் %s புறக்கணித்தல்

source: log for ref %s has gap after %s
ta: ref %s க்கான பதிவு %s க்குப் பிறகு இடைவெளியைக் கொண்டுள்ளது

source: log for ref %s unexpectedly ended on %s
ta: ref %s எதிர்பாராத விதமாக %s இல் முடிவடைந்தது

source: log for %s is empty
ta: %s க்கான பதிவு காலியாக உள்ளது

source: refusing to update ref with bad name '%s'
ta: '%s' என்ற கெட்ட பெயருடன் ref ஐ புதுப்பிக்க மறுக்கிறது

source: update_ref failed for ref '%s': %s
ta: update_ref '%s' க்கு தோல்வியுற்றது: %s

source: multiple updates for ref '%s' not allowed
ta: ref '%s' அனுமதிக்கப்படாத பல புதுப்பிப்புகள்

source: ref updates forbidden inside quarantine environment
ta: தனிமைப்படுத்தப்பட்ட சூழலுக்குள் தடைசெய்யப்பட்ட புதுப்பிப்புகள்

source: ref updates aborted by hook
ta: ஊக் மூலம் கைவிடப்பட்ட புதுப்பிப்புகள்

source: '%s' exists; cannot create '%s'
ta: '%s' உள்ளது; '%s' உருவாக்க முடியாது

source: cannot process '%s' and '%s' at the same time
ta: ஒரே நேரத்தில் '%s' மற்றும் '%s' செயலாக்க முடியாது

source: could not delete reference %s: %s
ta: குறிப்பு %s: %s ஐ நீக்க முடியவில்லை

source: could not delete references: %s
ta: குறிப்புகளை நீக்க முடியவில்லை: %s

source: invalid quoting in push-option value: '%s'
ta: புச்-விருப்ப மதிப்பில் தவறான மேற்கோள்: '%s'

source: %sinfo/refs not valid: is this a git repository?
ta: %sதகவல்/குறிப்புகள் செல்லுபடியாகாது: இது ஒரு அறிவிலி களஞ்சியமா?

source: invalid server response; expected service, got flush packet
ta: தவறான சேவையக பதில்; எதிர்பார்க்கப்படும் பணி, பறிப்பு பாக்கெட் கிடைத்தது

source: invalid server response; got '%s'
ta: தவறான சேவையக பதில்; '%s' கிடைத்தது

source: repository '%s' not found
ta: களஞ்சியம் '%s' காணப்படவில்லை

source: Authentication failed for '%s'
ta: '%s' க்கு ஏற்பு தோல்வியடைந்தது

source: unable to access '%s' with http.pinnedPubkey configuration: %s
ta: http.pinnedPubkey உள்ளமைவுடன் '%s' ஐ அணுக முடியவில்லை: %s

source: unable to access '%s': %s
ta: '%s' ஐ அணுக முடியவில்லை: %s

source: redirecting to %s
ta: %s க்கு திருப்பி விடுதல்

source: shouldn't have EOF when not gentle on EOF
ta: eof இல் மென்மையாக இல்லாதபோது eof இருக்கக்கூடாது

source: remote server sent unexpected response end packet
ta: தொலை சேவையகம் எதிர்பாராத மறுமொழி முடிவு பாக்கெட்டை அனுப்பியது

source: unable to rewind rpc post data - try increasing http.postBuffer
ta: rpc இடுகை தரவை முன்னாடி வைக்க முடியவில்லை - http.postBuffer ஐ அதிகரிக்க முயற்சிக்கவும்

source: remote-curl: bad line length character: %.4s
ta: தொலை-சிமுகவரி: மோசமான வரி நீள எழுத்து: %.4s

source: remote-curl: unexpected response end packet
ta: தொலை-சிமுகவரி: எதிர்பாராத மறுமொழி இறுதி பாக்கெட்

source: RPC failed; %s
ta: ஆர்.பி.சி தோல்வியடைந்தது; %s

source: cannot handle pushes this big
ta: இந்த பெரிய தள்ளுதல்களைக் கையாள முடியாது

source: cannot deflate request; zlib deflate error %d
ta: கோரிக்கையை நீக்க முடியாது; ச்லிப் டெஃப்ளேட் பிழை %d

source: cannot deflate request; zlib end error %d
ta: கோரிக்கையை நீக்க முடியாது; ச்லிப் எண்ட் பிழை %d

source: %d bytes of length header were received
ta: நீளமான தலைப்பின் %d பைட்டுகள் பெறப்பட்டன

source: %d bytes of body are still expected
ta: உடலின் %d பைட்டுகள் இன்னும் எதிர்பார்க்கப்படுகின்றன

source: dumb http transport does not support shallow capabilities
ta: ஊமை http போக்குவரத்து ஆழமற்ற திறன்களை ஆதரிக்காது

source: fetch failed.
ta: ஃபெட்ச் தோல்வியுற்றது.

source: cannot fetch by sha1 over smart http
ta: அறிவுள்ள http க்கு மேல் sha1 மூலம் பெற முடியாது

source: protocol error: expected sha/ref, got '%s'
ta: நெறிமுறை பிழை: எதிர்பார்க்கப்படும் சா/ரெஃப், கிடைத்தது '%s'

source: http transport does not support %s
ta: http போக்குவரத்து %s ஐ ஆதரிக்காது

source: protocol error: expected '<url> <path>', missing space
ta: நெறிமுறை பிழை: எதிர்பார்க்கப்படும் '<url> <ath>', இடத்தைக் காணவில்லை

source: failed to download file at URL '%s'
ta: முகவரி '%s' இல் கோப்பைப் பதிவிறக்கத் தவறிவிட்டது

source: git-http-push failed
ta: git-http-push தோல்வியடைந்தது

source: remote-curl: usage: git remote-curl <remote> [<url>]
ta: தொலை-சிமுகவரி: பயன்பாடு: git remote-curl <தொலை> [<முகவரி>]

source: remote-curl: error reading command stream from git
ta: தொலை-குர்எல்: அறிவிலி இருந்து கட்டளை ச்ட்ரீமை வாசிப்பதில் பிழை

source: remote-curl: fetch attempted without a local repo
ta: தொலை-குர்ல்: உள்ளக ரெப்போ இல்லாமல் முயற்சித்தது

source: remote-curl: unknown command '%s' from git
ta: தொலை-curl: git இலிருந்து அறியப்படாத கட்டளை '%s'

source: config remote shorthand cannot begin with '/': %s
ta: உள்ளமைவு தொலை சுருக்கெழுத்து '/' உடன் தொடங்க முடியாது: %s

source: more than one receivepack given, using the first
ta: முதல் ஒன்றைப் பயன்படுத்தி ஒன்றுக்கு மேற்பட்ட கெட் கட்டு கொடுக்கப்பட்டுள்ளது

source: more than one uploadpack given, using the first
ta: முதல் ஒன்றைப் பயன்படுத்தி ஒன்றுக்கு மேற்பட்ட பதிவேற்ற கட்டு கொடுக்கப்பட்டுள்ளது

source: unrecognized value transfer.credentialsInUrl: '%s'
ta: அங்கீகரிக்கப்படாத மதிப்பு transfer.credentialsInUrl: '%s'

source: URL '%s' uses plaintext credentials
ta: முகவரி '%s' எளிய உரை நற்சான்றிதழ்களைப் பயன்படுத்துகிறது

source: Cannot fetch both %s and %s to %s
ta: %s மற்றும் %s முதல் %s வரை பெற முடியாது

source: %s usually tracks %s, not %s
ta: %s வழக்கமாக %s தடங்கள், %s அல்ல

source: %s tracks both %s and %s
ta: %s %s மற்றும் %s இரண்டையும் கண்காணிக்கின்றன

source: src refspec %s does not match any
ta: src refspec %s எதையும் பொருந்தவில்லை

source: src refspec %s matches more than one
ta: எச்.ஆர்.சி ரெஃப்ச்பெக் %s ஒன்றுக்கு மேற்பட்டவற்றுடன் பொருந்துகிறது

source: The destination you provided is not a full refname (i.e., starting with "refs/"). We tried to guess what you meant by: - Looking for a ref that matches '%s' on the remote side. - Checking if the <src> being pushed ('%s') is a ref in "refs/{heads,tags}/". If so we add a corresponding refs/{heads,tags}/ prefix on the remote side. Neither worked, so we gave up. You must fully qualify the ref.
ta: நீங்கள் வழங்கிய இலக்கு முழு reffname அல்ல (அதாவது, "refs/" உடன் தொடங்கி). நீங்கள் என்ன சொன்னீர்கள் என்று யூகிக்க முயற்சித்தோம்: - தொலை பக்கத்தில் '%s' உடன் பொருந்தக்கூடிய ஒரு ref ஐத் தேடுகிறது. - <src> தள்ளப்பட்டதா ('%s') "refs/{heads,tags}/" இல் ஒரு ref. அப்படியானால், அதனுடன் தொடர்புடையதாகச் சேர்க்கிறோம் refs/{heads,tags}/ தொலைநிலை பக்கத்தில் முன்னொட்டு. இருவரும் பணி செய்யவில்லை, எனவே நாங்கள் கைவிட்டோம். நீங்கள் முழுமையாக தகுதி பெற வேண்டும்.

source: The <src> part of the refspec is a commit object. Did you mean to create a new branch by pushing to '%s:refs/heads/%s'?
ta: refspec இன் <முலம்> பகுதி ஒரு உறுதியான பொருள். ஒரு புதிய கிளையை உருவாக்குவதன் மூலம் நீங்கள் சொன்னீர்களா? '%s:refs/heads/%s'?

source: The <src> part of the refspec is a tag object. Did you mean to create a new tag by pushing to '%s:refs/tags/%s'?
ta: refspec இன் <src> பகுதி ஒரு குறிச்சொல் பொருள். தள்ளுவதன் மூலம் புதிய குறிச்சொல்லை உருவாக்க நீங்கள் சொன்னீர்களா? '%s: refs/tags/%s'?

source: The <src> part of the refspec is a tree object. Did you mean to tag a new tree by pushing to '%s:refs/tags/%s'?
ta: refspec இன் <src> பகுதி ஒரு மர பொருள். தள்ளுவதன் மூலம் ஒரு புதிய மரத்தை குறிக்க நீங்கள் சொன்னீர்களா? '%s: refs/tags/%s'?

source: The <src> part of the refspec is a blob object. Did you mean to tag a new blob by pushing to '%s:refs/tags/%s'?
ta: refspec இன் <src> பகுதி ஒரு குமிழ் பொருள். ஒரு புதிய குமிழியைக் குறிக்க நீங்கள் சொன்னீர்களா? '%s: refs/tags/%s'?

source: %s cannot be resolved to branch
ta: %s கிளைக்கு தீர்க்க முடியாது

source: unable to delete '%s': remote ref does not exist
ta: '%s' ஐ நீக்க முடியவில்லை: தொலை ரெஃப் இல்லை
