Repository: Nizhal/git-ta-po
Catalog: po/*.po
Languages: ta

source: git fetch [<options>] [<repository> [<refspec>...]]
ta: அறிவிலி பெறுதல் [<விருப்பங்கள்>] [<களஞ்சிய> [<குறிகுறிப்பு> ...]]

source: git fetch [<options>] <group>
ta: அறிவிலி பெறுதல் [<விருப்பங்கள்>] <குழு>

source: git fetch --multiple [<options>] [(<repository> | <group>)...]
ta: git fetch --multiple [<விருப்பங்கள்>] [(<களஞ்சிய> | <குழு>) ...]

source: git fetch --all [<options>]
ta: git fetch --all [<விருப்பங்கள்>]

source: fetch.parallel cannot be negative
ta: fetch.parallel எதிர்மறையாக இருக்க முடியாது

source: couldn't find remote ref HEAD
ta: தொலை ரெஃப் தலையைக் கண்டுபிடிக்க முடியவில்லை

source: From %.*s
ta: %.*s

source: object %s not found
ta: பொருள் %s காணப்படவில்லை

source: [up to date]
ta: [புதுப்பித்த]

source: [rejected]
ta: [நிராகரிக்கப்பட்டது]

source: can't fetch into checked-out branch
ta: சரிபார்க்கப்பட்ட கிளையில் பெற முடியாது

source: [tag update]
ta: [குறிச்சொல் புதுப்பிப்பு]

source: unable to update local ref
ta: உள்ளக ref ஐப் புதுப்பிக்க முடியவில்லை

source: would clobber existing tag
ta: தற்போதுள்ள குறிச்சொல்லைக் கவரும்

source: [new tag]
ta: [புதிய குறிச்சொல்]

source: [new branch]
ta: [புதிய கிளை]

source: [new ref]
ta: [புதிய குறிப்பு]

source: forced update
ta: கட்டாய புதுப்பிப்பு

source: non-fast-forward
ta: வேகமான முன்னோக்கி

source: cannot open '%s'
ta: '%s' திறக்க முடியாது

source: fetch normally indicates which branches had a forced update, but that check has been disabled; to re-enable, use '--show-forced-updates' flag or run 'git config fetch.showForcedUpdates true'
ta: எந்த கிளைகள் கட்டாய புதுப்பிப்பைக் கொண்டிருப்பதைக் குறிக்கிறது, ஆனால் அந்த காசோலை முடக்கப்பட்டுள்ளது; மீண்டும் இயக்க, '--show-forced-updates' பயன்படுத்தவும் கொடி அல்லது இயக்க 'git config fetch.showForcedUpdates true'

source: it took %.2f seconds to check forced updates; you can use '--no-show-forced-updates' or run 'git config fetch.showForcedUpdates false' to avoid this check
ta: கட்டாய புதுப்பிப்புகளை சரிபார்க்க %.2f நொடிகள் ஆனது; நீங்கள் பயன்படுத்தலாம் '--no-show-forced-updates' அல்லது இயக்கம் 'git config fetch.showForcedUpdates false' இந்த சரிபார்ப்பைத் தவிர்க்க

source: rejected %s because shallow roots are not allowed to be updated
ta: நிராகரிக்கப்பட்ட %s ஏனெனில் ஆழமற்ற வேர்கள் புதுப்பிக்க அனுமதிக்கப்படாது

source: some local refs could not be updated; try running 'git remote prune %s' to remove any old, conflicting branches
ta: சில உள்ளக குறிப்புகளை புதுப்பிக்க முடியவில்லை; ஓட முயற்சிக்கவும் எந்தவொரு பழைய, முரண்பட்ட கிளைகளையும் அகற்ற 'தொலை ப்ரூன் %s'

source: (%s will become dangling)
ta: (%s தொங்கும்)

source: (%s has become dangling)
ta: (%s தொங்கிக்கொண்டுள்ளன)

source: [deleted]
ta: [நீக்கப்பட்டது]

source: (none)
ta: (எதுவுமில்லை)

source: refusing to fetch into branch '%s' checked out at '%s'
ta: '%s' இல் கிளைக்குக் கொடுக்க மறுப்பது '%s' இல் சரிபார்க்கப்பட்டது

source: option "%s" value "%s" is not valid for %s
ta: விருப்பம் "%s" மதிப்பு "%s"%s க்கு செல்லுபடியாகாது

source: %s is not a valid object
ta: %s சரியான பொருள் அல்ல

source: the object %s does not exist
ta: பொருள் %s இல்லை

source: multiple branches detected, incompatible with --set-upstream
ta: பல கிளைகள் கண்டறியப்பட்டன, --set-upstream உடன் பொருந்தாது

source: could not set upstream of HEAD to '%s' from '%s' when it does not point to any branch.
ta: எந்தவொரு கிளையையும் சுட்டிக்காட்டாதபோது, '%s' இலிருந்து '%s' என தலையின் மேல்நோக்கி அமைக்க முடியவில்லை.

source: not setting upstream for a remote remote-tracking branch
ta: தொலைநிலை தொலை கண்காணிப்பு கிளைக்கு அப்ச்ட்ரீமை அமைக்கவில்லை

source: not setting upstream for a remote tag
ta: தொலைநிலை குறிச்சொல்லுக்கு அப்ச்ட்ரீமை அமைக்கவில்லை

source: unknown branch type
ta: தெரியாத கிளை வகை

source: no source branch found; you need to specify exactly one branch with the --set-upstream option
ta: எந்த மூல கிளை கிடைக்கவில்லை; --set-upstream விருப்பத்துடன் நீங்கள் ஒரு கிளையை சரியாக குறிப்பிட வேண்டும்

source: Fetching %s
ta: %s பெறுதல்

source: could not fetch %s
ta: %s பெற முடியவில்லை

source: could not fetch '%s' (exit code: %d)
ta: '%s' (வெளியேறும் குறியீடு: %d) பெற முடியவில்லை

source: no remote repository specified; please specify either a URL or a remote name from which new revisions should be fetched
ta: தொலைநிலை களஞ்சியம் எதுவும் குறிப்பிடப்படவில்லை; தயவுசெய்து ஒரு முகவரி அல்லது a ஐக் குறிப்பிடவும் புதிய திருத்தங்கள் பெற வேண்டிய தொலை பெயர்

source: you need to specify a tag name
ta: நீங்கள் ஒரு குறிச்சொல் பெயரைக் குறிப்பிட வேண்டும்

source: fetch from all remotes
ta: எல்லா தொலைதூரங்களிலிருந்தும் பெறுங்கள்

source: set upstream for git pull/fetch
ta: அறிவிலி புல்/பெறுவதற்கு மேலோடை அமைக்கவும்

source: append to .git/FETCH_HEAD instead of overwriting
ta: மேலெழுதலுக்கு பதிலாக .git/FETCH_HEAD இல் சேர்க்கவும்

source: use atomic transaction to update references
ta: குறிப்புகளைப் புதுப்பிக்க அணு பரிவர்த்தனையைப் பயன்படுத்தவும்

source: path to upload pack on remote end
ta: தொலைநிலை முடிவில் கட்டு பதிவேற்றுவதற்கான பாதை

source: force overwrite of local reference
ta: உள்ளக குறிப்பின் கட்டாய மேலெழுதும்

source: fetch from multiple remotes
ta: பல தொலைடுகளிலிருந்து பெறவும்

source: fetch all tags and associated objects
ta: எல்லா குறிச்சொற்களையும் அதனுடன் தொடர்புடைய பொருட்களையும் பெறுங்கள்

source: do not fetch all tags (--no-tags)
ta: எல்லா குறிச்சொற்களையும் பெற வேண்டாம் (--no-tags)

source: number of submodules fetched in parallel
ta: இணையாக பெறப்பட்ட துணைதொகுதிகளின் எண்ணிக்கை

source: modify the refspec to place all refs within refs/prefetch/
ta: அனைத்து குறிப்புகளையும் refs/prefetch/ க்குள் வைக்க குறிஅள ஐ மாற்றவும்

source: prune remote-tracking branches no longer on remote
ta: தொலைதூரத்தில் தொலைதூரத்தில் இல்லை

source: prune local tags no longer on remote and clobber changed tags
ta: உள்ளக குறிச்சொற்களை தொலை மற்றும் க்ளோபர் மாற்றப்பட்ட குறிச்சொற்களில் இல்லை

source: on-demand
ta: தேவைக்கேற்ப

source: control recursive fetching of submodules
ta: துணைதொகுதிகளின் சுழல்நிலை பெறுதலைக் கட்டுப்படுத்துங்கள்

source: write fetched references to the FETCH_HEAD file
ta: FETCH_HEAD கோப்புக்கு குறிப்பை எழுதுங்கள்

source: keep downloaded pack
ta: பதிவிறக்கம் செய்யப்பட்ட கட்டு

source: allow updating of HEAD ref
ta: எட் ரெஃப் புதுப்பிக்க அனுமதிக்கவும்

source: deepen history of shallow clone
ta: ஆழமற்ற குளோனின் வரலாற்றை ஆழப்படுத்துங்கள்

source: deepen history of shallow repository based on time
ta: காலத்தின் அடிப்படையில் ஆழமற்ற களஞ்சியத்தின் வரலாற்றை ஆழப்படுத்துங்கள்

source: convert to a complete repository
ta: ஒரு முழுமையான களஞ்சியமாக மாற்றவும்

source: re-fetch without negotiating common commits
ta: பொதுவான உறுதிடுகளை பேச்சுவார்த்தை நடத்தாமல் மீண்டும் எடுக்கவும்

source: prepend this to submodule path output
ta: துணைதொகுதி பாதை வெளியீட்டிற்கு இதை ஆயத்தம் செய்யுங்கள்

source: default for recursive fetching of submodules (lower priority than config files)
ta: துணைதொகுதிகளின் சுழல்நிலை பெறுவதற்கான இயல்புநிலை (கட்டமைப்பு கோப்புகளை விட குறைந்த முன்னுரிமை)

source: accept refs that update .git/shallow
ta: அந்த புதுப்பிப்பை refs ஐ ஏற்றுக்கொள்ளுங்கள் .git/ஆழமற்றது

source: specify fetch refmap
ta: ரெஃப்மேப்பைப் பெறுக

source: revision
ta: திருத்தம்

source: report that we have only objects reachable from this object
ta: இந்த பொருளிலிருந்து அடையக்கூடிய பொருள்கள் மட்டுமே எங்களிடம் உள்ளன என்று புகாரளிக்கவும்

source: do not fetch a packfile; instead, print ancestors of negotiation tips
ta: ஒரு பேக்ஃபைலை பெற வேண்டாம்; அதற்கு பதிலாக, பேச்சுவார்த்தை உதவிக்குறிப்புகளின் மூதாதையர்களை அச்சிடுங்கள்

source: run 'maintenance --auto' after fetching
ta: கிடைத்த பிறகு 'பராமரிப்பு --auto' ஐ இயக்கவும்

source: check for forced-updates on all updated branches
ta: புதுப்பிக்கப்பட்ட அனைத்து கிளைகளிலும் கட்டாய-புதுப்பிப்புகளைச் சரிபார்

source: write the commit-graph after fetching
ta: பெறப்பட்ட பிறகு உறுதி-வரைபடத்தை எழுதுங்கள்

source: accept refspecs from stdin
ta: stdin இலிருந்து refspecs ஐ ஏற்றுக்கொள்ளுங்கள்

source: --negotiate-only needs one or more --negotiation-tip=*
ta: --negotiate-only ஒன்று அல்லது அதற்கு மேற்பட்டவை --negotiation-tip=* தேவை

source: negative depth in --deepen is not supported
ta: --deepen எதிர்மறை ஆழம் ஆதரிக்கப்படவில்லை

source: --unshallow on a complete repository does not make sense
ta: ஒரு முழுமையான களஞ்சியத்தில் --unshallow பொருளில்லை

source: failed to fetch bundles from '%s'
ta: '%s' இலிருந்து மூட்டைகளைப் பெறுவதில் தோல்வி

source: fetch --all does not take a repository argument
ta: fetch --all ஒரு களஞ்சிய வாதத்தை எடுக்காது

source: fetch --all does not make sense with refspecs
ta: fetch --all குறிகுறிப்புகளுடன் பொருளல்ல

source: no such remote or remote group: %s
ta: அத்தகைய தொலைநிலை அல்லது தொலைநிலை குழு இல்லை: %s

source: fetching a group and specifying refspecs does not make sense
ta: ஒரு குழுவைப் பெறுவதும், ரெஃப்ச்பெக்சைக் குறிப்பிடுவதும் பொருளல்ல

source: must supply remote when using --negotiate-only
ta: --negotiate-only பயன்படுத்தும் போது தொலை வழங்க வேண்டும்

source: protocol does not support --negotiate-only, exiting
ta: நெறிமுறை ஆதரிக்கவில்லை --negotiate-only, வெளியேறும்

source: --filter can only be used with the remote configured in extensions.partialclone
ta: extensions.partialclone இல் தொலை உள்ளமைவுடன் மட்டுமே --filter யைப் பயன்படுத்த முடியும்

source: --atomic can only be used when fetching from one remote
ta: --atomic ஒரு தொலைதூரத்திலிருந்து பெறும்போது மட்டுமே பயன்படுத்த முடியும்

source: --stdin can only be used when fetching from one remote
ta: --stdin ஒரு தொலைதூரத்திலிருந்து பெறும்போது மட்டுமே பயன்படுத்த முடியும்

source: git fmt-merge-msg [-m <message>] [--log[=<n>] | --no-log] [--file <file>]
ta: git fmt-merge-msg [-m <செய்தி>] [--log[=<எ>] | --no-log] [--file <கோப்பு>]

source: populate log with at most <n> entries from shortlog
ta: சார்ட்லாக் இருந்து அதிகபட்சம் <n> உள்ளீடுகளுடன் பதிவை விரிவுபடுத்துங்கள்

source: alias for --log (deprecated)
ta: --log இதற்கான மாற்றுப்பெயர் (நீக்கப்பட்டது)

source: text
ta: உரை

source: use <text> as start of message
ta: செய்தியின் தொடக்கமாக <உரை> ஐப் பயன்படுத்தவும்

source: use <name> instead of the real target branch
ta: உண்மையான இலக்கு கிளைக்கு பதிலாக <பெயர்> ஐப் பயன்படுத்தவும்

source: file to read from
ta: இருந்து படிக்க கோப்பு

source: git for-each-ref [<options>] [<pattern>]
ta: git for-each-ref [<விருப்பங்கள்>] [<முறை>]

source: git for-each-ref [--points-at <object>]
ta: git for-each-ref [-புள்ளிகள்-at <பொருள்>]

source: git for-each-ref [--merged [<commit>]] [--no-merged [<commit>]]
ta: git for-each-ref [-இணைக்கப்பட்ட [< உறுதி>]]

source: git for-each-ref [--contains [<commit>]] [--no-contains [<commit>]]
ta: git for-each-ref [--contains [< உறுதி>]]

source: quote placeholders suitably for shells
ta: குண்டுகளுக்கு பொருத்தமான மேற்கோள் பிளேச்ஓல்டர்கள்

source: quote placeholders suitably for perl
ta: பெர்லுக்கு பொருத்தமான மேற்கோள் பிளேச்ஓல்டர்கள்

source: quote placeholders suitably for python
ta: பைத்தானுக்கு பொருத்தமான மேற்கோள் பிளேச்ஓல்டர்கள்

source: quote placeholders suitably for Tcl
ta: டி.சி.எல்

source: show only <n> matched refs
ta: <n> பொருந்திய குறிப்புகள் மட்டும் காட்டு

source: respect format colors
ta: வடிவமைப்பு வண்ணங்களை மதிக்கவும்

source: print only refs which points at the given object
ta: கொடுக்கப்பட்ட பொருளை எந்த சுட்டிக்காட்டுகிறது என்பதை மட்டும் அச்சிடுங்கள்

source: print only refs that are merged
ta: ஒன்றிணைக்கப்பட்டுள்ள குறிப்புகளை மட்டும் அச்சிடுங்கள்

source: print only refs that are not merged
ta: இணைக்கப்படாத குறிப்புகளை மட்டும் அச்சிடுங்கள்

source: print only refs which contain the commit
ta: உறுதிப்பாட்டைக் கொண்ட refs ஐ மட்டும் அச்சிடுங்கள்

source: print only refs which don't contain the commit
ta: உறுதிப்பாட்டைக் கொண்டிருக்காத குறிப்புகளை மட்டும் அச்சிடுங்கள்

source: read reference patterns from stdin
ta: stdin இலிருந்து குறிப்பு வடிவங்களைப் படியுங்கள்

source: unknown arguments supplied with --stdin
ta: --stdin உடன் வழங்கப்பட்ட அறியப்படாத வாதங்கள்

source: git for-each-repo --config=<config> [--] <arguments>
ta: git for-each-repo --config=<உள்ளமைவு> [--] <வாதங்கள்>

source: config
ta: கட்டமைப்பு

source: config key storing a list of repository paths
ta: களஞ்சிய விசை களஞ்சிய பாதைகளின் பட்டியலை சேமிக்கிறது

source: missing --config=<config>
ta: காணவில்லை --config=<உள்ளமைவு>

source: got bad config --config=%s
ta: மோசமான கட்டமைப்பு கிடைத்தது --config=%s

source: unknown
ta: தெரியவில்லை

source: error in %s %s: %s
ta: %s %s இல் பிழை: %s

source: warning in %s %s: %s
ta: %s %s இல் முன்னறிவிப்பு: %s

source: broken link from %7s %s
ta: %7s %s இலிருந்து உடைந்த இணைப்பு

source: wrong object type in link
ta: இணைப்பில் தவறான பொருள் வகை

source: broken link from %7s %s to %7s %s
ta: %7s %s இலிருந்து உடைந்த இணைப்பு பெறுநர் %7s %s

source: Checking connectivity
ta: இணைப்பைச் சரிபார்க்கிறது

source: missing %s %s
ta: %s %s காணவில்லை

source: unreachable %s %s
ta: அணுக முடியாத %s %s

source: dangling %s %s
ta: தொங்கும் %s %s

source: could not create lost-found
ta: இழந்துவிட்டதை உருவாக்க முடியவில்லை

source: could not write '%s'
ta: '%s' என்று எழுத முடியவில்லை

source: could not finish '%s'
ta: '%s' முடிக்க முடியவில்லை

source: Checking %s
ta: %s ஐ சரிபார்க்கிறது

source: Checking connectivity (%d objects)
ta: இணைப்பைச் சரிபார்க்கிறது (%d பொருள்கள்)

source: Checking %s %s
ta: %s %s ஐ சரிபார்க்கிறது

source: broken links
ta: உடைந்த இணைப்புகள்

source: root %s
ta: வேர் %s

source: tagged %s %s (%s) in %s
ta: குறிக்கப்பட்ட %s %s ( %s) %s இல்

source: %s: object corrupt or missing
ta: %s: பொருள் ஊழல் அல்லது காணவில்லை

source: %s: invalid reflog entry %s
ta: %s: தவறான பிரதிபலிப்பு நுழைவு %s

source: Checking reflog %s->%s
ta: refilog %s-> %s ஐ சரிபார்க்கிறது

source: %s: invalid sha1 pointer %s
ta: %s: தவறான sha1 சுட்டிக்காட்டி %s

source: %s: not a commit
ta: %s: ஒரு உறுதி அல்ல

source: notice: No default references
ta: அறிவிப்பு: இயல்புநிலை குறிப்புகள் இல்லை

source: %s: hash-path mismatch, found at: %s
ta: %s: ஆச்-பாதை பொருந்தாத தன்மை, காணப்படுகிறது: %s

source: %s: object corrupt or missing: %s
ta: %s: பொருள் ஊழல் அல்லது காணவில்லை: %s

source: %s: object could not be parsed: %s
ta: %s: பொருளை பாகுபடுத்த முடியவில்லை: %s

source: bad sha1 file: %s
ta: மோசமான sha1 கோப்பு: %s

source: Checking object directory
ta: பொருள் கோப்பகத்தை சரிபார்க்கிறது

source: Checking object directories
ta: பொருள் கோப்பகங்களை சரிபார்க்கிறது

source: Checking %s link
ta: %s இணைப்பைச் சரிபார்க்கிறது

source: invalid %s
ta: தவறான %s

source: %s points to something strange (%s)
ta: %s சுட்டிக்காட்டுகிறது (%s)

source: %s: detached HEAD points at nothing
ta: %s: பிரிக்கப்பட்ட தலை புள்ளிகள் ஒன்றும் இல்லை

source: notice: %s points to an unborn branch (%s)
ta: அறிவிப்பு: %s பிறக்காத கிளைக்கு ( %s) புள்ளிகள்

source: Checking cache tree of %s
ta: %s இன் கேச் மரத்தை சரிபார்க்கிறது

source: %s: invalid sha1 pointer in cache-tree of %s
ta: %s: %s இன் கேச்-மரத்தில் தவறான sha1 சுட்டிக்காட்டி

source: non-tree in cache-tree
ta: கேச்-மரத்தில் மரம் அல்லாதது

source: %s: invalid sha1 pointer in resolve-undo of %s
ta: %s: %s இன் தீர்மானத்தில் தவறான sha1 சுட்டிக்காட்டி

source: unable to load rev-index for pack '%s'
ta: '%s' கட்டு-க்கு ரெவ்-இன்டெக்சை ஏற்ற முடியவில்லை

source: invalid rev-index for pack '%s'
ta: கட்டு '%s' க்கு தவறான ரெவ்-இன்டெக்ச்

source: show unreachable objects
ta: அணுக முடியாத பொருள்களைக் காட்டு

source: show dangling objects
ta: தொங்கும் பொருள்களைக் காட்டு

source: report tags
ta: குறிச்சொற்களைப் புகாரளிக்கவும்

source: report root nodes
ta: வேர் முனைகளை புகாரளிக்கவும்

source: make index objects head nodes
ta: குறியீட்டு பொருள்களின் தலை முனைகளை உருவாக்குங்கள்

source: make reflogs head nodes (default)
ta: பிரதிபலிப்பு தலை முனைகளை உருவாக்கவும் (இயல்புநிலை)

source: also consider packs and alternate objects
ta: பொதிகள் மற்றும் மாற்று பொருள்களையும் கவனியுங்கள்

source: check only connectivity
ta: இணைப்பை மட்டும் சரிபார்

source: enable more strict checking
ta: மேலும் கடுமையான சோதனையை இயக்கவும்

source: write dangling objects in .git/lost-found
ta: தொங்கும் பொருள்களை எழுதுங்கள்

source: show progress
ta: முன்னேற்றத்தைக் காட்டு

source: show verbose names for reachable objects
ta: அடையக்கூடிய பொருள்களுக்கு வாய்மொழி பெயர்களைக் காட்டு

source: Checking objects
ta: பொருள்களைச் சரிபார்க்கிறது

source: %s: object missing
ta: %s: பொருள் இல்லை

source: invalid parameter: expected sha1, got '%s'
ta: தவறான அளவுரு: எதிர்பார்க்கப்படும் சா 1, '%s' கிடைத்தது

source: git fsmonitor--daemon start [<options>]
ta: git fsmonitor--daemon start [<விருப்பங்கள்>]

source: git fsmonitor--daemon run [<options>]
ta: git fsmonitor--daemon run [<விருப்பங்கள்>]

source: value of '%s' out of range: %d
ta: வரம்பிற்கு வெளியே '%s' மதிப்பு: %d

source: value of '%s' not bool or int: %d
ta: '%s' மதிப்பு பூல் அல்லது இன்ட்: %d

source: fsmonitor-daemon is watching '%s'
ta: fsmonitor-daen '%s' ஐப் பார்க்கிறது

source: fsmonitor-daemon is not watching '%s'
ta: fsmonitor-daen '%s' ஐப் பார்க்கவில்லை

source: could not create fsmonitor cookie '%s'
ta: fsmonitor குக்கீ '%s' ஐ உருவாக்க முடியவில்லை

source: fsmonitor: cookie_result '%d' != SEEN
ta: fsmonitor: cookie_result '%d'! = பார்த்தது

source: could not start IPC thread pool on '%s'
ta: '%s' இல் ஐபிசி நூல் குளத்தைத் தொடங்க முடியவில்லை

source: could not start fsmonitor listener thread
ta: fsmonitor கேட்பவர் நூலைத் தொடங்க முடியவில்லை

source: could not start fsmonitor health thread
ta: fsmonitor சுகாதார நூலைத் தொடங்க முடியவில்லை

source: could not initialize listener thread
ta: கேட்போர் நூலைத் தொடங்க முடியவில்லை

source: could not initialize health thread
ta: சுகாதார நூலைத் தொடங்க முடியவில்லை

source: could not cd home '%s'
ta: சிடி ஓம் '%s'

source: fsmonitor--daemon is already running '%s'
ta: fsmonitor--daemon ஏற்கனவே '%s' ஐ இயக்குகிறார்

source: running fsmonitor-daemon in '%s'
ta: '%s' இல் fsmonitor-daemon ஐ இயக்குகிறது

source: starting fsmonitor-daemon in '%s'
ta: '%s' இல் fsmonitor-daenmen ஐத் தொடங்குகிறது

source: daemon failed to start
ta: டீமான் தொடங்கத் தவறிவிட்டார்

source: daemon not online yet
ta: டீமான் இன்னும் ஆன்லைனில் இல்லை

source: daemon terminated
ta: டீமான் நிறுத்தப்பட்டது

source: detach from console
ta: கன்சோலில் இருந்து பிரிக்கவும்

source: use <n> ipc worker threads
ta: <n> ஐபிசி தொழிலாளி நூல்களைப் பயன்படுத்தவும்

source: max seconds to wait for background daemon startup
ta: பின்னணி டீமான் தொடக்கத்திற்காக காத்திருக்க அதிகபட்ச வினாடிகள்

source: invalid 'ipc-threads' value (%d)
ta: தவறான 'ஐபிசி-த்ரெட்ச்' மதிப்பு (%d)

source: Unhandled subcommand '%s'
ta: கட்டுப்படுத்தப்படாத துணைக் கழுவுதல் '%s'

source: fsmonitor--daemon not supported on this platform
ta: fsmonitor--daemon இந்த மேடையில் ஆதரிக்கப்படவில்லை

source: git gc [<options>]
ta: git gc [<விருப்பங்கள்>]

source: Failed to fstat %s: %s
ta: fstat %s இல் தோல்வியுற்றது: %s

source: failed to parse '%s' value '%s'
ta: '%s' மதிப்பு '%s' ஐ அலசத் தவறிவிட்டது

source: cannot stat '%s'
ta: '%s' ச்டேட் செய்ய முடியாது

source: The last gc run reported the following. Please correct the root cause and remove %s Automatic cleanup will not be performed until the file is removed. %s
ta: கடைசி சி.சி இயக்கம் பின்வருவனவற்றைப் புகாரளித்தது. மூல காரணத்தை சரிசெய்யவும் மற்றும் %s ஐ அகற்றவும் கோப்பு அகற்றப்படும் வரை தானியங்கி தூய்மை செய்யப்படாது. %s

source: prune unreferenced objects
ta: குறிப்பிடப்படாத பொருள்களை கத்தரிக்கவும்

source: pack unreferenced objects separately
ta: குறிப்பிடப்படாத பொருள்களை தனித்தனியாக கட்டு செய்யுங்கள்

source: with --cruft, limit the size of new cruft packs
ta: --cruft உடன், புதிய க்ரூஃப்ட் பொதிகளின் அளவைக் கட்டுப்படுத்துங்கள்

source: be more thorough (increased runtime)
ta: மேலும் முழுமையானதாக இருங்கள் (அதிகரித்த இயக்க நேரம்)

source: enable auto-gc mode
ta: ஆட்டோ-சி.சி பயன்முறையை இயக்கவும்

source: force running gc even if there may be another gc running
ta: மற்றொரு சி.சி இயங்கினாலும் சி.சி.

source: repack all other packs except the largest pack
ta: மிகப்பெரிய கட்டு தவிர மற்ற எல்லா பொதிகளையும் மறுபரிசீலனை செய்யுங்கள்

source: pack prefix to store a pack containing pruned objects
ta: கத்தரிக்காய் பொருள்களைக் கொண்ட ஒரு பேக்கை சேமிக்க முன்னொட்டு

source: failed to parse gc.logExpiry value %s
ta: gc.logExpiry மதிப்பு %s ஐ பாகுபடுத்துவதில் தோல்வி

source: failed to parse prune expiry value %s
ta: கத்தரிக்காய் காலாவதி மதிப்பு %s அலசத் தவறிவிட்டது

source: Auto packing the repository in background for optimum performance.
ta: உகந்த செயல்திறனுக்காக பின்னணியில் களஞ்சியத்தை தானாக பொதி செய்தல்.

source: Auto packing the repository for optimum performance.
ta: உகந்த செயல்திறனுக்காக களஞ்சியத்தை தானாக பொதி செய்தல்.

source: See "git help gc" for manual housekeeping.
ta: கையேடு வீட்டு பராமரிப்புக்கு "அறிவிலி உதவி சி.சி" ஐப் பார்.

source: gc is already running on machine '%s' pid %<PRIuMAX> (use --force if not)
ta: சி.சி ஏற்கனவே இயந்திரத்தில் '%s' பிஐடி %<PRIuMAX> இல் இயங்குகிறது (பயன்படுத்த --force இல்லையென்றால்)

source: There are too many unreachable loose objects; run 'git prune' to remove them.
ta: அணுக முடியாத தளர்வான பொருள்கள் உள்ளன; அவற்றை அகற்ற 'அறிவிலி ப்ரூன்' இயக்கவும்.

source: git maintenance run [--auto] [--[no-]quiet] [--task=<task>] [--schedule]
ta: git maintenance run [--auto] [--[no-]quiet] [--task=<பணி>] [--schedule]

source: --no-schedule is not allowed
ta: --no-schedule அனுமதிக்கவில்லை

source: unrecognized --schedule argument '%s'
ta: அங்கீகரிக்கப்படாத --schedule உரையாடல் '%s'

source: failed to write commit-graph
ta: உறுதி-வரைபடம் எழுதத் தவறிவிட்டது

source: failed to prefetch remotes
ta: தொலைடுகளை முன்னறிவிப்பதில் தோல்வி

source: failed to start 'git pack-objects' process
ta: 'git pack-objects' செயல்முறையைத் தொடங்குவதில் தோல்வி

source: failed to finish 'git pack-objects' process
ta: 'git pack-objects' செயல்முறையை முடிக்கத் தவறிவிட்டது

source: failed to write multi-pack-index
ta: பல-கட்டு-குறியிடு எழுதத் தவறிவிட்டது

source: 'git multi-pack-index expire' failed
ta: 'git multi-pack-index expire காலாவதியாகும்' தோல்வியுற்றது

source: 'git multi-pack-index repack' failed
ta: 'git multi-pack-index repack' தோல்வியுற்றது

source: skipping incremental-repack task because core.multiPackIndex is disabled
ta: core.multiPackIndex முடக்கப்பட்டுள்ளதால் அதிகரிக்கும்-ரிப்பேக் பணியைத் தவிர்க்கிறது

source: lock file '%s' exists, skipping maintenance
ta: பூட்டு கோப்பு '%s' உள்ளது, பராமரிப்பைத் தவிர்க்கிறது

source: task '%s' failed
ta: பணி '%s' தோல்வியடைந்தது

source: '%s' is not a valid task
ta: '%s' சரியான பணி அல்ல

source: task '%s' cannot be selected multiple times
ta: பணி '%s' பல முறை தேர்ந்தெடுக்க முடியாது

source: run tasks based on the state of the repository
ta: களஞ்சியத்தின் நிலையின் அடிப்படையில் பணிகளை இயக்கவும்

source: frequency
ta: மீடிறன், மீள்திறன், நிகழ்வெண், நிகழ்வு

source: run tasks based on frequency
ta: அதிர்வெண்ணின் அடிப்படையில் பணிகளை இயக்கவும்

source: do not report progress or other information over stderr
ta: ச்டெர்ர் மீது முன்னேற்றம் அல்லது பிற தகவல்களைப் புகாரளிக்க வேண்டாம்

source: task
ta: பணி

source: run a specific task
ta: ஒரு குறிப்பிட்ட பணியை இயக்கவும்

source: use at most one of --auto and --schedule=<frequency>
ta: --auto மற்றும் --schedule=<அதிர்வெண்> இல் ஒன்றைப் பயன்படுத்தவும்

source: unable to add '%s' value of '%s'
ta: '%s' இன்%s 'மதிப்பைச் சேர்க்க முடியவில்லை'

source: return success even if repository was not registered
ta: களஞ்சியம் பதிவு செய்யப்படாவிட்டாலும் செய் திரும்பவும்

source: unable to unset '%s' value of '%s'
ta: '%s' இன் '%s' மதிப்பை இணைக்க முடியவில்லை

source: repository '%s' is not registered
ta: களஞ்சியம் '%s' பதிவு செய்யப்படவில்லை

source: failed to expand path '%s'
ta: '%s' பாதையை விரிவாக்குவதில் தோல்வி

source: failed to start launchctl
ta: துவக்கத்தைத் தொடங்குவதில் தோல்வி

source: failed to create directories for '%s'
ta: '%s' க்கான கோப்பகங்களை உருவாக்குவதில் தோல்வி

source: failed to bootstrap service %s
ta: சேவையை தொடக்கவார் செய்வதில் தோல்வி %s

source: failed to create temp xml file
ta: தற்காலிக எக்ச்எம்எல் கோப்பை உருவாக்குவதில் தோல்வி

source: failed to start schtasks
ta: ச்க்டாச்க்களைத் தொடங்குவதில் தோல்வி
