Repository: Nizhal/git-ta-po
Catalog: po/*.po
Languages: ta

source: Huh (%s)?
ta: ஊ (%s)?

source: could not read index
ta: குறியீட்டை படிக்க முடியவில்லை

source: binary
ta: இருமம்

source: nothing
ta: எதுவும்

source: unchanged
ta: மாறாமல்

source: Update
ta: புதுப்பிப்பு

source: could not stage '%s'
ta: '%s' நிலைநிறுத்த முடியவில்லை

source: could not write index
ta: குறியீட்டை எழுத முடியவில்லை

source: updated %d path
ta: புதுப்பிக்கப்பட்டது %d பாதை

source: note: %s is untracked now.
ta: குறிப்பு: %s இப்போது கட்டுப்படுத்தப்படவில்லை.

source: make_cache_entry failed for path '%s'
ta: make_cache_entry பாதை '%s' க்கு தோல்வியுற்றது

source: Revert
ta: மாற்றியமைக்கவும்

source: Could not parse HEAD^{tree}
ta: தலையை அலச முடியவில்லை^{மரம்}

source: reverted %d path
ta: மாற்றியமைக்கப்பட்ட %d பாதை

source: No untracked files.
ta: கட்டுப்படுத்தப்படாத கோப்புகள் இல்லை.

source: Add untracked
ta: தடையின்றி சேர்க்கவும்

source: added %d path
ta: %d பாதை சேர்க்கப்பட்டது

source: ignoring unmerged: %s
ta: அவிழ்க்கப்பட்டதை புறக்கணித்தல்: %s

source: Only binary files changed.
ta: பைனரி கோப்புகள் மட்டுமே மாற்றப்பட்டன.

source: No changes.
ta: எந்த மாற்றங்களும் இல்லை.

source: Patch update
ta: இணைப்பு புதுப்பிப்பு

source: Review diff
ta: மதிப்பாய்வு வேறுபாடு

source: show paths with changes
ta: மாற்றங்களுடன் பாதைகளைக் காட்டு

source: add working tree state to the staged set of changes
ta: மாற்றங்களின் அரங்கில் உழைக்கும் மர நிலையைச் சேர்க்கவும்

source: revert staged set of changes back to the HEAD version
ta: எட் பதிப்பிற்கு மீண்டும் அரங்கேற்றப்பட்ட மாற்றங்களை மாற்றவும்

source: pick hunks and update selectively
ta: அன்க்சைத் தேர்ந்தெடுத்து தேர்ந்தெடுத்து புதுப்பிக்கவும்

source: view diff between HEAD and index
ta: தலை மற்றும் குறியீட்டுக்கு இடையில் வேறுபாட்டைக் காண்க

source: add contents of untracked files to the staged set of changes
ta: மாற்றப்படாத கோப்புகளின் உள்ளடக்கங்களை மாற்றங்களின் தொகுப்பில் சேர்க்கவும்

source: Prompt help:
ta: உடனடி உதவி:

source: select a single item
ta: ஒரு உருப்படியைத் தேர்ந்தெடுக்கவும்

source: select a range of items
ta: உருப்படிகளின் வரம்பைத் தேர்ந்தெடுக்கவும்

source: select multiple ranges
ta: பல வரம்புகளைத் தேர்ந்தெடுக்கவும்

source: select item based on unique prefix
ta: தனித்துவமான முன்னொட்டின் அடிப்படையில் உருப்படியைத் தேர்ந்தெடுக்கவும்

source: unselect specified items
ta: குறிப்பிட்ட உருப்படிகளைத் தேர்ந்தெடுக்கவும்

source: choose all items
ta: எல்லா பொருட்களையும் தேர்வு செய்யவும்

source: (empty) finish selecting
ta: (வெற்று) தேர்ந்தெடுப்பதை முடிக்கவும்

source: select a numbered item
ta: எண்ணுள்ள உருப்படியைத் தேர்ந்தெடுக்கவும்

source: (empty) select nothing
ta: (வெற்று) எதையும் தேர்ந்தெடுக்கவும்

source: *** Commands ***
ta: *** கட்டளைகள் ***

source: What now
ta: இப்பொழுது என்ன

source: staged
ta: அரங்கேற்றப்பட்டது

source: unstaged
ta: நிலையற்ற

source: path
ta: பாதை

source: could not refresh index
ta: குறியீட்டை புதுப்பிக்க முடியவில்லை

source: Bye.
ta: வருகிறேன்.

source: Stage mode change [y,n,q,a,d%s,?]?
ta: நிலை முறை மாற்றம் [y, n, q, a, d%s,?]?

source: Stage deletion [y,n,q,a,d%s,?]?
ta: நிலை நீக்குதல் [y, n, q, a, d%s,?]?

source: Stage addition [y,n,q,a,d%s,?]?
ta: நிலை கூட்டல் [y, n, q, a, d%s,?]?

source: Stage this hunk [y,n,q,a,d%s,?]?
ta: இந்த அங்க் [y, n, q, a, d%s,?]?

source: If the patch applies cleanly, the edited hunk will immediately be marked for staging.
ta: இணைப்பு சுத்தமாக பொருந்தினால், திருத்தப்பட்ட அங்க் உடனடியாக அரங்கில் குறிக்கப்படும்.

source: y - stage this hunk n - do not stage this hunk q - quit; do not stage this hunk or any of the remaining ones a - stage this hunk and all later hunks in the file d - do not stage this hunk or any of the later hunks in the file
ta: ஒய் - இந்த அங்கை மேடை n - இந்த அங்கை அரங்கேற்ற வேண்டாம் கே - வெளியேறு; இந்த அங்க் அல்லது மீதமுள்ளவற்றை அரங்கேற்ற வேண்டாம் ப - இந்த அங்கையும் பின்னர் அனைத்து பின்னர் அங்குகளையும் கோப்பில் நிலைநிறுத்துங்கள் டி - இந்த அங்க் அல்லது பின்னர் கோப்பில் உள்ள எந்தவொரு அங்கையும் அரங்கேற்ற வேண்டாம்

source: Stash mode change [y,n,q,a,d%s,?]?
ta: ச்டாச் பயன்முறை மாற்றம் [y, n, q, a, d%s,?]?

source: Stash deletion [y,n,q,a,d%s,?]?
ta: ச்டாச் நீக்குதல் [y, n, q, a, d%s,?]?

source: Stash addition [y,n,q,a,d%s,?]?
ta: ச்டாச் சேர்த்தல் [y, n, q, a, d%s,?]?

source: Stash this hunk [y,n,q,a,d%s,?]?
ta: இந்த அங்கை [y, n, q, a, d%s,?] அடுக்கி வைக்கவும்?

source: If the patch applies cleanly, the edited hunk will immediately be marked for stashing.
ta: இணைப்பு சுத்தமாக பொருந்தினால், திருத்தப்பட்ட அங்க் உடனடியாக அடுக்கி வைப்பதைக் குறிக்கும்.

source: y - stash this hunk n - do not stash this hunk q - quit; do not stash this hunk or any of the remaining ones a - stash this hunk and all later hunks in the file d - do not stash this hunk or any of the later hunks in the file
ta: ஒய் - இந்த அங்கை ச்டாச் செய்யுங்கள் n - இந்த அங்கை அடுக்கி வைக்க வேண்டாம் கே - வெளியேறு; இந்த அங்கை அல்லது மீதமுள்ள ஒன்றையும் சேமிக்க வேண்டாம் a - இந்த அங்கையும் பின்னர் அனைத்து அங்குகளையும் கோப்பில் சேமிக்கவும் டி - இந்த அங்க் அல்லது பின்னர் எந்தவொரு அங்குகளையும் கோப்பில் அடுக்கி வைக்க வேண்டாம்

source: Unstage mode change [y,n,q,a,d%s,?]?
ta: instage பயன்முறை மாற்றம் [y, n, q, a, d%s,?]?

source: Unstage deletion [y,n,q,a,d%s,?]?
ta: ஒய், n, q, a, d%s,?]?

source: Unstage addition [y,n,q,a,d%s,?]?
ta: instage கூடுதலாக [y, n, q, a, d%s,?]?

source: Unstage this hunk [y,n,q,a,d%s,?]?
ta: இந்த அங்க் [y, n, q, a, d%s,?]?

source: If the patch applies cleanly, the edited hunk will immediately be marked for unstaging.
ta: இணைப்பு சுத்தமாக பொருந்தினால், திருத்தப்பட்ட அங்க் உடனடியாக நிலையற்றதாக குறிக்கப்படும்.

source: y - unstage this hunk n - do not unstage this hunk q - quit; do not unstage this hunk or any of the remaining ones a - unstage this hunk and all later hunks in the file d - do not unstage this hunk or any of the later hunks in the file
ta: ஒய் - இந்த அங்க் n - இந்த அங்கை அசைக்க வேண்டாம் கே - வெளியேறு; இந்த அங்க் அல்லது மீதமுள்ளவற்றில் ஏதேனும் ஒன்றைத் தூண்ட வேண்டாம் ப - இந்த அங்க் மற்றும் பின்னர் அனைத்து பின்னர் அங்க்ச் கோப்பில் டி - இந்த அங்க் அல்லது கோப்பில் உள்ள எந்தவொரு அங்குகளும் இல்லை

source: Apply mode change to index [y,n,q,a,d%s,?]?
ta: குறியீட்டுக்கு பயன்முறை மாற்றத்தைப் பயன்படுத்துங்கள் [y, n, q, a, d%s,?]?

source: Apply deletion to index [y,n,q,a,d%s,?]?
ta: குறியீட்டுக்கு நீக்குதலைப் பயன்படுத்துங்கள் [y, n, q, a, d%s,?]?

source: Apply addition to index [y,n,q,a,d%s,?]?
ta: குறியீட்டுக்கு கூடுதலாக [y, n, q, a, d%s,?] ஐப் பயன்படுத்துங்கள்?

source: Apply this hunk to index [y,n,q,a,d%s,?]?
ta: இந்த அங்கை குறியீட்டுக்கு [y, n, q, a, d%s,?] பயன்படுத்துங்கள்?

source: If the patch applies cleanly, the edited hunk will immediately be marked for applying.
ta: இணைப்பு சுத்தமாக பொருந்தினால், திருத்தப்பட்ட அங்க் உடனடியாக விண்ணப்பிக்க குறிக்கப்படும்.

source: y - apply this hunk to index n - do not apply this hunk to index q - quit; do not apply this hunk or any of the remaining ones a - apply this hunk and all later hunks in the file d - do not apply this hunk or any of the later hunks in the file
ta: ஒய் - இந்த அங்கை குறியீட்டுக்குப் பயன்படுத்துங்கள் n - இந்த அங்கை குறியீட்டுக்கு பயன்படுத்த வேண்டாம் கே - வெளியேறு; இந்த அங்க் அல்லது மீதமுள்ள ஒன்றைப் பயன்படுத்த வேண்டாம் ப - இந்த அங்கையும் பின்னர் அனைத்து அங்குகளையும் கோப்பில் பயன்படுத்துங்கள் டி - இந்த அங்க் அல்லது பின்னர் உள்ள எந்தவொரு அங்குகளையும் பயன்படுத்த வேண்டாம்

source: Discard mode change from worktree [y,n,q,a,d%s,?]?
ta: பணிச்சூழல்களிடமிருந்து பயன்முறை மாற்றத்தை நிராகரிக்கவும் [y, n, q, a, d%s,?]?

source: Discard deletion from worktree [y,n,q,a,d%s,?]?
ta: பணிச்சூழல்களிடமிருந்து நீக்குதலை நிராகரிக்கவும் [y, n, q, a, d%s,?]?

source: Discard addition from worktree [y,n,q,a,d%s,?]?
ta: பணியிடத்திலிருந்து சேர்த்தலை நிராகரிக்கவும் [y, n, q, a, d%s,?]?

source: Discard this hunk from worktree [y,n,q,a,d%s,?]?
ta: இந்த அங்கை பணியிடத்திலிருந்து நிராகரிக்கவும் [y, n, q, a, d%s,?]?

source: If the patch applies cleanly, the edited hunk will immediately be marked for discarding.
ta: இணைப்பு சுத்தமாக பொருந்தினால், திருத்தப்பட்ட அங்க் உடனடியாக நிராகரிக்க குறிக்கப்படும்.

source: y - discard this hunk from worktree n - do not discard this hunk from worktree q - quit; do not discard this hunk or any of the remaining ones a - discard this hunk and all later hunks in the file d - do not discard this hunk or any of the later hunks in the file
ta: ஒய் - இந்த அங்கை பணிப்பகுதியிலிருந்து நிராகரிக்கவும் n - இந்த அங்கை பணிப்பூக்கிலிருந்து நிராகரிக்க வேண்டாம் கே - வெளியேறு; இந்த அங்கை அல்லது மீதமுள்ளவற்றை நிராகரிக்க வேண்டாம் a - இந்த அங்கையும் பின்னர் அனைத்து பின்னர் அங்குகளையும் நிராகரிக்கவும் டி - கோப்பில் இந்த அங்கை அல்லது பின்னர் எதையும் நிராகரிக்க வேண்டாம்

source: Discard mode change from index and worktree [y,n,q,a,d%s,?]?
ta: குறியீட்டு மற்றும் பணியிடத்திலிருந்து முறை மாற்றத்தை நிராகரிக்கவும் [y, n, q, a, d%s,?]?

source: Discard deletion from index and worktree [y,n,q,a,d%s,?]?
ta: குறியீட்டு மற்றும் பணியிடத்திலிருந்து நீக்குதலை நிராகரிக்கவும் [y, n, q, a, d%s,?]?

source: Discard addition from index and worktree [y,n,q,a,d%s,?]?
ta: குறியீட்டு மற்றும் பணியிடத்திலிருந்து சேர்த்தலை நிராகரிக்கவும் [y, n, q, a, d%s,?]?

source: Discard this hunk from index and worktree [y,n,q,a,d%s,?]?
ta: குறியீட்டு மற்றும் பணியிடங்களிலிருந்து இந்த அங்கை நிராகரிக்கவும் [y, n, q, a, d%s,?]?

source: y - discard this hunk from index and worktree n - do not discard this hunk from index and worktree q - quit; do not discard this hunk or any of the remaining ones a - discard this hunk and all later hunks in the file d - do not discard this hunk or any of the later hunks in the file
ta: ஒய் - குறியீட்டு மற்றும் பணியிடத்திலிருந்து இந்த அங்கை நிராகரிக்கவும் n - குறியீட்டு மற்றும் பணிப்பூக்கத்திலிருந்து இந்த அங்கை நிராகரிக்க வேண்டாம் கே - வெளியேறு; இந்த அங்கை அல்லது மீதமுள்ளவற்றை நிராகரிக்க வேண்டாம் a - இந்த அங்கையும் பின்னர் அனைத்து பின்னர் அங்குகளையும் நிராகரிக்கவும் டி - கோப்பில் இந்த அங்கை அல்லது பின்னர் எதையும் நிராகரிக்க வேண்டாம்

source: Apply mode change to index and worktree [y,n,q,a,d%s,?]?
ta: குறியீட்டு மற்றும் பணியிடத்திற்கு பயன்முறை மாற்றத்தைப் பயன்படுத்துங்கள் [y, n, q, a, d%s,?]?

source: Apply deletion to index and worktree [y,n,q,a,d%s,?]?
ta: குறியீட்டு மற்றும் பணியிடத்திற்கு நீக்குதலைப் பயன்படுத்துங்கள் [y, n, q, a, d%s,?]?

source: Apply addition to index and worktree [y,n,q,a,d%s,?]?
ta: குறியீட்டு மற்றும் பணியிடத்திற்கு கூடுதலாக [y, n, q, a, d%s,?] ஐப் பயன்படுத்துங்கள்?

source: Apply this hunk to index and worktree [y,n,q,a,d%s,?]?
ta: இந்த அங்கை குறியீட்டு மற்றும் பணியிடத்திற்கு [y, n, q, a, d%s,?] பயன்படுத்தவும்?

source: y - apply this hunk to index and worktree n - do not apply this hunk to index and worktree q - quit; do not apply this hunk or any of the remaining ones a - apply this hunk and all later hunks in the file d - do not apply this hunk or any of the later hunks in the file
ta: ஒய் - இந்த அங்கை குறியீட்டு மற்றும் பணியிடத்திற்கு பயன்படுத்துங்கள் n - இந்த அங்கை குறியீட்டு மற்றும் பணிச்சூழலுக்குப் பயன்படுத்த வேண்டாம் கே - வெளியேறு; இந்த அங்க் அல்லது மீதமுள்ள ஒன்றைப் பயன்படுத்த வேண்டாம் ப - இந்த அங்கையும் பின்னர் அனைத்து அங்குகளையும் கோப்பில் பயன்படுத்துங்கள் டி - இந்த அங்க் அல்லது பின்னர் உள்ள எந்தவொரு அங்குகளையும் பயன்படுத்த வேண்டாம்

source: Apply mode change to worktree [y,n,q,a,d%s,?]?
ta: பணிச்சூழலுக்கு பயன்முறை மாற்றத்தைப் பயன்படுத்துங்கள் [y, n, q, a, d%s,?]?

source: Apply deletion to worktree [y,n,q,a,d%s,?]?
ta: பணியிடத்திற்கு நீக்குதலைப் பயன்படுத்துங்கள் [y, n, q, a, d%s,?]?

source: Apply addition to worktree [y,n,q,a,d%s,?]?
ta: பணியிடத்திற்கு கூடுதலாக [y, n, q, a, d%s,?] ஐப் பயன்படுத்துங்கள்?

source: Apply this hunk to worktree [y,n,q,a,d%s,?]?
ta: இந்த அங்கை பணியிடத்திற்கு [y, n, q, a, d%s,?] பயன்படுத்துங்கள்?

source: y - apply this hunk to worktree n - do not apply this hunk to worktree q - quit; do not apply this hunk or any of the remaining ones a - apply this hunk and all later hunks in the file d - do not apply this hunk or any of the later hunks in the file
ta: ஒய் - இந்த அங்கை பணியிடத்திற்கு பயன்படுத்துங்கள் n - இந்த அங்கை பணிப்பூக்குக்கு பயன்படுத்த வேண்டாம் கே - வெளியேறு; இந்த அங்க் அல்லது மீதமுள்ள ஒன்றைப் பயன்படுத்த வேண்டாம் ப - இந்த அங்கையும் பின்னர் அனைத்து அங்குகளையும் கோப்பில் பயன்படுத்துங்கள் டி - இந்த அங்க் அல்லது பின்னர் உள்ள எந்தவொரு அங்குகளையும் பயன்படுத்த வேண்டாம்

source: could not parse hunk header '%.*s'
ta: அங்க் தலைப்பை '%.*s' என்று அலச முடியவில்லை

source: could not parse diff
ta: வேறுபாட்டை அலச முடியவில்லை

source: could not parse colored diff
ta: வண்ண வேறுபாட்டை அலச முடியவில்லை

source: failed to run '%s'
ta: '%s' இயக்கத் தவறிவிட்டது

source: mismatched output from interactive.diffFilter
ta: interactive.diffFilter இலிருந்து பொருந்தாத வெளியீடு

source: Your filter must maintain a one-to-one correspondence between its input and output lines.
ta: உங்கள் வடிகட்டி ஒன்றுக்கு ஒன்று கடிதத்தை பராமரிக்க வேண்டும் அதன் உள்ளீடு மற்றும் வெளியீட்டு கோடுகளுக்கு இடையில்.

source: expected context line #%d in %.*s
ta: எதிர்பார்க்கப்படும் சூழல் வரி #%d %.*s

source: hunks do not overlap: %.*s does not end with: %.*s
ta: அங்க்ச் ஒன்றுடன் ஒன்று இல்லை: %.*s உடன் முடிவடையாது: %.*s

source: Manual hunk edit mode -- see bottom for a quick guide.
ta: கையேடு அங்க் திருத்து பயன்முறை - விரைவான வழிகாட்டிக்கு கீழே பார்.

source: If it does not apply cleanly, you will be given an opportunity to edit again. If all lines of the hunk are removed, then the edit is aborted and the hunk is left unchanged.
ta: அது சுத்தமாக பொருந்தவில்லை என்றால், உங்களுக்கு ஒரு வாய்ப்பு வழங்கப்படும் மீண்டும் திருத்து. அங்கின் அனைத்து வரிகளும் அகற்றப்பட்டால், திருத்து கருக்கலைப்பு மற்றும் அங்க் மாறாமல் விடப்படுகிறது.

source: could not parse hunk header
ta: அங்க் தலைப்பை அலச முடியவில்லை

source: 'git apply --cached' failed
ta: 'git apply --cached' தோல்வியுற்றது

source: Your edited hunk does not apply. Edit again (saying "no" discards!) [y/n]?
ta: உங்கள் திருத்தப்பட்ட அங்க் பொருந்தாது. மீண்டும் திருத்தவும் ("இல்லை" என்று கூறி!) [y/n]?

source: The selected hunks do not apply to the index!
ta: தேர்ந்தெடுக்கப்பட்ட அங்க்ச் குறியீட்டுக்கு பொருந்தாது!

source: Apply them to the worktree anyway?
ta: எப்படியும் அவற்றை பணியாளர்களிடம் தடவுகிறீர்களா?

source: Nothing was applied.
ta: எதுவும் பயன்படுத்தப்படவில்லை.

source: No previous hunk
ta: முந்தைய அங்க் இல்லை

source: No next hunk
ta: அடுத்த அங்க் இல்லை

source: No other hunks to goto
ta: கோட்டோவுக்கு வேறு அங்க்ச் இல்லை

source: go to which hunk (<ret> to see more)?
ta: எந்த அங்குக்குச் செல்லவும் (<ஐ ret> மேலும் காண)?

source: go to which hunk?
ta: எந்த அங்குக்குச் செல்லுங்கள்?

source: Invalid number: '%s'
ta: தவறான எண்: '%s'

source: Sorry, only %d hunk available.
ta: மன்னிக்கவும், %d அங்க் மட்டுமே கிடைக்கிறது.

source: No other hunks to search
ta: தேட வேறு அங்க்ச் இல்லை

source: search for regex?
ta: ரீசெக்சைத் தேடவா?

source: Malformed search regexp %s: %s
ta: தவறாக தேடல் regexp %s: %s

source: No hunk matches the given pattern
ta: கொடுக்கப்பட்ட வடிவத்துடன் எந்த அங்கும் பொருந்தாது

source: Sorry, cannot split this hunk
ta: மன்னிக்கவும், இந்த அங்கைப் பிரிக்க முடியாது

source: Split into %d hunks.
ta: %d அங்குகளாக பிரிக்கவும்.

source: Sorry, cannot edit this hunk
ta: மன்னிக்கவும், இந்த அங்கை திருத்த முடியாது

source: 'git apply' failed
ta: 'அறிவிலி விண்ணப்பிக்கவும்' தோல்வியுற்றது

source: Cherry-picking is not possible because you have unmerged files.
ta: உங்களிடம் அமைக்கப்படாத கோப்புகள் இருப்பதால் செர்ரி எடுப்பது சாத்தியமில்லை.

source: Committing is not possible because you have unmerged files.
ta: உங்களிடம் அமைக்கப்படாத கோப்புகள் இருப்பதால் அர்ப்பணிப்பது சாத்தியமில்லை.

source: Merging is not possible because you have unmerged files.
ta: உங்களிடம் அமைக்கப்படாத கோப்புகள் இருப்பதால் ஒன்றிணைப்பது சாத்தியமில்லை.

source: Pulling is not possible because you have unmerged files.
ta: உங்களிடம் அமைக்கப்படாத கோப்புகள் இருப்பதால் இழுப்பது சாத்தியமில்லை.

source: Reverting is not possible because you have unmerged files.
ta: உங்களிடம் அமைக்கப்படாத கோப்புகள் இருப்பதால் மாற்றுவது சாத்தியமில்லை.

source: Rebasing is not possible because you have unmerged files.
ta: உங்களிடம் அமைக்கப்படாத கோப்புகள் இருப்பதால் மறுசீரமைப்பு சாத்தியமில்லை.

source: Fix them up in the work tree, and then use 'git add/rm <file>' as appropriate to mark resolution and make a commit.
ta: பணி மரத்தில் அவற்றை சரிசெய்யவும், பின்னர் 'git add/rm <file>' ஐப் பயன்படுத்தவும் தெளிவுத்திறனைக் குறிக்க பொருத்தமானது மற்றும் ஒரு உறுதிப்பாட்டை உருவாக்குதல்.

source: Exiting because of an unresolved conflict.
ta: தீர்க்கப்படாத மோதல் காரணமாக வெளியேறுதல்.

source: You have not concluded your merge (MERGE_HEAD exists).
ta: உங்கள் ஒன்றிணைவை நீங்கள் முடிவு செய்யவில்லை (MERGE_HEAD உள்ளது).

source: Please, commit your changes before merging.
ta: தயவுசெய்து, ஒன்றிணைவதற்கு முன் உங்கள் மாற்றங்களைச் செய்யுங்கள்.

source: Exiting because of unfinished merge.
ta: முடிக்கப்படாத ஒன்றிணைப்பு காரணமாக வெளியேறுகிறது.

source: Diverging branches can't be fast-forwarded, you need to either: git merge --no-ff or: git rebase
ta: வேறுபட்ட கிளைகளை வேகமாக முன்னோக்கி செல்ல முடியாது, நீங்கள் செய்ய வேண்டும்: git ஒன்றிணைப்பு --no-ff அல்லது: அறிவிலி மறுப்பு

source: Not possible to fast-forward, aborting.
ta: வேகமாக முன்னோக்கி, கருக்கலைப்பு செய்ய முடியாது.

source: The following paths and/or pathspecs matched paths that exist outside of your sparse-checkout definition, so will not be updated in the index:
ta: பின்வரும் பாதைகள் மற்றும்/அல்லது பாத்ச்பெக்ச் இருக்கும் பாதைகள் உங்கள் சிதறிய-சோதனை வரையறைக்கு வெளியே, எனவே இருக்காது குறியீட்டில் புதுப்பிக்கப்பட்டது:

source: If you intend to update such entries, try one of the following: * Use the --sparse option. * Disable or modify the sparsity rules.
ta: அத்தகைய உள்ளீடுகளைப் புதுப்பிக்க நீங்கள் விரும்பினால், பின்வருவனவற்றில் ஒன்றை முயற்சிக்கவும்: * --sparse விருப்பத்தைப் பயன்படுத்தவும். * ச்பார்சிட்டி விதிகளை முடக்கவும் அல்லது மாற்றவும்.

source: Note: switching to '%s'. You are in 'detached HEAD' state. You can look around, make experimental changes and commit them, and you can discard any commits you make in this state without impacting any branches by switching back to a branch. If you want to create a new branch to retain commits you create, you may do so (now or later) by using -c with the switch command. Example: git switch -c <new-branch-name> Or undo this operation with: git switch - Turn off this advice by setting config variable advice.detachedHead to false
ta: குறிப்பு: '%s' க்கு மாறுதல். நீங்கள் 'பிரிக்கப்பட்ட தலை' நிலையில் இருக்கிறீர்கள். நீங்கள் சுற்றிப் பார்க்கலாம், சோதனை செய்யலாம் மாற்றங்கள் மற்றும் அவற்றைச் செய்யுங்கள், மேலும் இதில் நீங்கள் செய்யும் எந்தவொரு உறுதிடுகளையும் நீங்கள் நிராகரிக்கலாம் ஒரு கிளைக்கு மாறுவதன் மூலம் எந்த கிளைகளையும் பாதிக்காமல் மாநிலம். நீங்கள் உருவாக்கும் உறுதிப்பாட்டைத் தக்கவைக்க ஒரு புதிய கிளையை உருவாக்க விரும்பினால், நீங்கள் இருக்கலாம் சுவிட்ச் கட்டளையுடன் -c ஐப் பயன்படுத்துவதன் மூலம் (இப்போது அல்லது பின்னர்) செய்யுங்கள். உதாரணமாக: git switch -c <புதிய-கிளை-பெயர்> அல்லது இந்த செயல்பாட்டை செயல்தவிர்க்கவும்: git switch - கட்டமைப்பு மாறி advice.detachedHead ஐ அமைப்பதன் மூலம் இந்த ஆலோசனையை அணைக்கவும்.

source: The following paths have been moved outside the sparse-checkout definition but are not sparse due to local modifications.
ta: பின்வரும் பாதைகள் வெளியே நகர்த்தப்பட்டுள்ளன சிதறல்-சோதனை வரையறை ஆனால் உள்ளக காரணமாக அவை குறைவாக இல்லை மாற்றங்கள்.

source: To correct the sparsity of these paths, do the following: * Use "git add --sparse <paths>" to update the index * Use "git sparse-checkout reapply" to apply the sparsity rules
ta: இந்த பாதைகளின் இடைவெளியை சரிசெய்ய, பின்வருவனவற்றைச் செய்யுங்கள்: * குறியீட்டைப் புதுப்பிக்க "git add --sparse <பாதைகள்>" ஐப் பயன்படுத்தவும் * ச்பார்சிட்டி விதிகளைப் பயன்படுத்த "git sparse-checkout reapply" பயன்படுத்தவும்

source: cmdline ends with \
ta: cmdline உடன் முடிகிறது \

source: unclosed quote
ta: திறக்கப்படாத மேற்கோள்

source: too many arguments
ta: பல வாதங்கள்

source: unrecognized whitespace option '%s'
ta: அங்கீகரிக்கப்படாத வைட்ச்பேச் விருப்பம் '%s'

source: unrecognized whitespace ignore option '%s'
ta: அங்கீகரிக்கப்படாத இடைவெளி '%s' என்ற விருப்பத்தை புறக்கணி

source: options '%s' and '%s' cannot be used together
ta: விருப்பங்கள் '%s' மற்றும் '%s' ஆகியவற்றை ஒன்றாகப் பயன்படுத்த முடியாது

source: '%s' outside a repository
ta: ஒரு களஞ்சியத்திற்கு வெளியே '%s'

source: failed to read patch
ta: பேட்சைப் படிக்கத் தவறிவிட்டது

source: patch too large
ta: இணைப்பு மிகப் பெரியது

source: Cannot prepare timestamp regexp %s
ta: நேர முத்திரை regexp %s ஐ தயாரிக்க முடியாது

source: regexec returned %d for input: %s
ta: உள்ளீட்டிற்கு ரீசெக்செக் %d திரும்பியது: %s

source: unable to find filename in patch at line %d
ta: %d வரியில் பேட்சில் கோப்பு பெயரை கண்டுபிடிக்க முடியவில்லை

source: git apply: bad git-diff - expected /dev/null, got %s on line %d
ta: அறிவிலி பொருந்தும்: மோசமான git-diff - எதிர்பார்க்கப்படுகிறது /தேவ் /பூச்யம், %s வரி %d இல் கிடைத்தது

source: git apply: bad git-diff - inconsistent new filename on line %d
ta: அறிவிலி பொருந்தும்: மோசமான git-diff - வரி %d இல் சீரற்ற புதிய கோப்பு பெயர்

source: git apply: bad git-diff - inconsistent old filename on line %d
ta: அறிவிலி விண்ணப்பிக்க: மோசமான git-diff - வரி %d இல் சீரற்ற பழைய கோப்பு பெயர்

source: git apply: bad git-diff - expected /dev/null on line %d
ta: அறிவிலி பொருந்தும்: மோசமான git-diff - எதிர்பார்த்த /தேவ் /பூச்யத்தில் வரி %d

source: invalid mode on line %d: %s
ta: வரி %d இல் தவறான பயன்முறை: %s

source: inconsistent header lines %d and %d
ta: சீரற்ற தலைப்பு வரிகள் %d மற்றும் %d

source: git diff header lacks filename information when removing %d leading pathname component (line %d)
ta: %d முன்னணி பாதை பெயர் (வரி %d) ஐ அகற்றும்போது git வேறுபாடு தலைப்பு கோப்பு பெயர் செய்தி இல்லை

source: git diff header lacks filename information (line %d)
ta: அறிவிலி டிஃப் தலைப்புக்கு கோப்பு பெயர் செய்தி இல்லை (வரி %d)

source: recount: unexpected line: %.*s
ta: மறுபரிசீலனை: எதிர்பாராத வரி: %.*s

source: patch fragment without header at line %d: %.*s
ta: வரி %d: %.*s என்ற தலைப்பு இல்லாமல் இணைப்பு துண்டு

source: new file depends on old contents
ta: புதிய கோப்பு பழைய உள்ளடக்கங்களைப் பொறுத்தது

source: deleted file still has contents
ta: நீக்கப்பட்ட கோப்பில் இன்னும் உள்ளடக்கங்கள் உள்ளன

source: corrupt patch at line %d
ta: வரி %d இல் ஊழல் இணைப்பு

source: new file %s depends on old contents
ta: புதிய கோப்பு %s பழைய உள்ளடக்கங்களைப் பொறுத்தது

source: deleted file %s still has contents
ta: நீக்கப்பட்ட கோப்பு %s இன்னும் உள்ளடக்கங்களைக் கொண்டுள்ளது

source: ** warning: file %s becomes empty but is not deleted
ta: ** முன்னறிவிப்பு: கோப்பு %s காலியாக மாறும், ஆனால் அவை நீக்கப்படவில்லை

source: corrupt binary patch at line %d: %.*s
ta: %d: %.*s வரியில் ஊழல் பைனரி இணைப்பு

source: unrecognized binary patch at line %d
ta: வரியில் அங்கீகரிக்கப்படாத பைனரி இணைப்பு %d

source: patch with only garbage at line %d
ta: %d வரியில் குப்பைகளை மட்டுமே கொண்ட இணைப்பு

source: unable to read symlink %s
ta: சிம்லிங்க் %s படிக்க முடியவில்லை

source: unable to open or read %s
ta: %s ஐ திறக்க அல்லது படிக்க முடியவில்லை

source: invalid start of line: '%c'
ta: வரியின் தவறான தொடக்க: '%c'

source: Hunk #%d succeeded at %d (offset %d line).
ta: அங்க் # %d %d (ஆஃப்செட் %d வரி) இல் செய் பெற்றார்.

source: Context reduced to (%ld/%ld) to apply fragment at %d
ta: சூழல் (%ld/%ld) ஆகக் குறைக்கப்பட்டது %d இல் துண்டுகளைப் பயன்படுத்த

source: while searching for: %.*s
ta: தேடும்போது: %.*s

source: missing binary patch data for '%s'
ta: '%s' க்கான பைனரி ஒட்டு தரவைக் காணவில்லை

source: cannot reverse-apply a binary patch without the reverse hunk to '%s'
ta: தலைகீழ் அங்க் இல்லாமல் '%s' இல்லாமல் ஒரு பைனரி இணைப்பு தலைகீழாக இருக்க முடியாது

source: cannot apply binary patch to '%s' without full index line
ta: முழு குறியீட்டு வரி இல்லாமல் '%s' க்கு பைனரி பேட்சைப் பயன்படுத்த முடியாது

source: the patch applies to '%s' (%s), which does not match the current contents.
ta: ஒட்டு '%s' (%s) க்கு பொருந்தும், இது தற்போதைய உள்ளடக்கங்களுடன் பொருந்தவில்லை.
