Repository: Nizhal/git-ta-po
Catalog: po/*.po
Languages: ta

source: the patch applies to an empty '%s' but it is not empty
ta: ஒட்டு வெற்று '%s' க்கு பொருந்தும், ஆனால் அது காலியாக இல்லை

source: the necessary postimage %s for '%s' cannot be read
ta: '%s' க்கு தேவையான போச்டிமேச் %s படிக்க முடியாது

source: binary patch does not apply to '%s'
ta: பைனரி இணைப்பு '%s' க்கு பொருந்தாது

source: binary patch to '%s' creates incorrect result (expecting %s, got %s)
ta: '%s' க்கு பைனரி இணைப்பு தவறான முடிவை உருவாக்குகிறது ( %s ஐ எதிர்பார்க்கிறது, %s கிடைத்தன)

source: patch failed: %s:%ld
ta: இணைப்பு தோல்வியுற்றது: %s: %ld

source: cannot checkout %s
ta: %s புதுப்பிக்க முடியாது

source: failed to read %s
ta: %s படிக்கத் தவறிவிட்டது

source: reading from '%s' beyond a symbolic link
ta: ஒரு குறியீட்டு இணைப்பிற்கு அப்பால் '%s' இலிருந்து படித்தல்

source: path %s has been renamed/deleted
ta: பாதை %s மறுபெயரிடப்பட்டது/நீக்கப்பட்டது

source: %s: does not exist in index
ta: %s: குறியீட்டில் இல்லை

source: %s: does not match index
ta: %s: குறியீட்டுடன் பொருந்தவில்லை

source: repository lacks the necessary blob to perform 3-way merge.
ta: களஞ்சியத்தில் 3-வழி ஒன்றிணைக்க தேவையான குமிழ் இல்லை.

source: Performing three-way merge...
ta: மூன்று வழி ஒன்றிணைப்பு ...

source: cannot read the current contents of '%s'
ta: '%s' இன் தற்போதைய உள்ளடக்கங்களை படிக்க முடியாது

source: Failed to perform three-way merge...
ta: மூன்று வழி ஒன்றிணைக்கத் தவறிவிட்டது ...

source: Applied patch to '%s' with conflicts.
ta: மோதல்களுடன் '%s' க்கு ஒட்டு பயன்படுத்தப்பட்டது.

source: Applied patch to '%s' cleanly.
ta: '%s' க்கு சுத்தமாக பயன்படுத்தப்பட்டது.

source: Falling back to direct application...
ta: நேரடி பயன்பாட்டிற்கு மீண்டும் விழுகிறது ...

source: removal patch leaves file contents
ta: அகற்றுதல் இணைப்பு கோப்பு உள்ளடக்கங்களை இலைகள்

source: %s: wrong type
ta: %s: தவறான வகை

source: %s has type %o, expected %o
ta: %s வகை %o, எதிர்பார்க்கப்படும் %o

source: invalid path '%s'
ta: தவறான பாதை '%s'

source: %s: already exists in index
ta: %s: ஏற்கனவே குறியீட்டில் உள்ளது

source: %s: already exists in working directory
ta: %s: ஏற்கனவே பணி கோப்பகத்தில் உள்ளது

source: new mode (%o) of %s does not match old mode (%o)
ta: (%o) புதிய பயன்முறை %s இன் (%o) பழைய பயன்முறையுடன் பொருந்தாது

source: new mode (%o) of %s does not match old mode (%o) of %s
ta: (%o) புதிய பயன்முறை %s இன் (%o) பழைய பயன்முறையுடன் %s இன் பொருந்தாது

source: affected file '%s' is beyond a symbolic link
ta: பாதிக்கப்பட்ட கோப்பு '%s' ஒரு குறியீட்டு இணைப்பிற்கு அப்பாற்பட்டது

source: %s: patch does not apply
ta: %s: ஒட்டு பொருந்தாது

source: Checking patch %s...
ta: ஒட்டு %s ஐ சரிபார்க்கிறது ...

source: sha1 information is lacking or useless for submodule %s
ta: sha1 செய்தி துணைதொகுதி %s க்கு இல்லை அல்லது பயனற்றது

source: mode change for %s, which is not in current HEAD
ta: %s க்கான பயன்முறை மாற்றம், இது தற்போதைய தலையில் இல்லை

source: sha1 information is lacking or useless (%s).
ta: sha1 செய்தி இல்லாதது அல்லது பயனற்றது (%s).

source: could not add %s to temporary index
ta: தற்காலிக குறியீட்டில் %s ஐ சேர்க்க முடியவில்லை

source: could not write temporary index to %s
ta: %s க்கு தற்காலிக குறியீட்டை எழுத முடியவில்லை

source: unable to remove %s from index
ta: குறியீட்டிலிருந்து %s ஐ அகற்ற முடியவில்லை

source: corrupt patch for submodule %s
ta: துணைதொகுதி %s க்கான ஊழல் இணைப்பு

source: unable to stat newly created file '%s'
ta: புதிதாக உருவாக்கப்பட்ட கோப்பு '%s'

source: unable to create backing store for newly created file %s
ta: புதிதாக உருவாக்கப்பட்ட கோப்பு %s க்கான பின்னணி கடையை உருவாக்க முடியவில்லை

source: unable to add cache entry for %s
ta: %s க்கு கேச் நுழைவு சேர்க்க முடியவில்லை

source: failed to write to '%s'
ta: '%s' க்கு எழுதத் தவறிவிட்டது

source: closing file '%s'
ta: மூடல் கோப்பு '%s'

source: unable to write file '%s' mode %o
ta: '%s' பயன்முறை %o ஐ எழுத முடியவில்லை

source: Applied patch %s cleanly.
ta: ஒட்டு %s சுத்தமாக பயன்படுத்தப்படுகின்றன.

source: internal error
ta: உள் பிழை

source: Applying patch %%s with %d reject...
ta: %d நிராகரிப்புடன் ஒட்டு %% s ஐப் பயன்படுத்துதல் ...

source: cannot open %s
ta: %s திறக்க முடியாது

source: cannot unlink '%s'
ta: '%s' ஐ இணைக்க முடியாது

source: Hunk #%d applied cleanly.
ta: அங்க் #%d சுத்தமாக பயன்படுத்தப்படுகிறது.

source: Rejected hunk #%d.
ta: நிராகரிக்கப்பட்ட அங்க் #%d.

source: Skipped patch '%s'.
ta: ச்கிட் செய்யப்பட்ட ஒட்டு '%s'.

source: No valid patches in input (allow with "--allow-empty")
ta: உள்ளீட்டில் செல்லுபடியாகும் திட்டுகள் இல்லை ("--allow-empty" உடன் அனுமதிக்கவும்)

source: unable to read index file
ta: குறியீட்டு கோப்பைப் படிக்க முடியவில்லை

source: can't open patch '%s': %s
ta: ஒட்டு '%s' ஐ திறக்க முடியாது: %s

source: squelched %d whitespace error
ta: கசப்பான %d வைட்ச்பேச் பிழை

source: %d line adds whitespace errors.
ta: %d வரி இடைவெளி பிழைகளைச் சேர்க்கிறது.

source: %d line applied after fixing whitespace errors.
ta: வைட்ச்பேச் பிழைகளை சரிசெய்த பிறகு %d வரி பயன்படுத்தப்படுகிறது.

source: Unable to write new index file
ta: புதிய குறியீட்டு கோப்பை எழுத முடியவில்லை

source: don't apply changes matching the given path
ta: கொடுக்கப்பட்ட பாதையுடன் பொருந்தக்கூடிய மாற்றங்களைப் பயன்படுத்த வேண்டாம்

source: apply changes matching the given path
ta: கொடுக்கப்பட்ட பாதையுடன் பொருந்தக்கூடிய மாற்றங்களைப் பயன்படுத்துங்கள்

source: num
ta: எண்

source: remove <num> leading slashes from traditional diff paths
ta: பாரம்பரிய வேறுபாடு பாதைகளிலிருந்து <எண்> முன்னணி குறைப்புகளை அகற்று

source: ignore additions made by the patch
ta: ஒட்டு செய்த சேர்த்தல்களைப் புறக்கணி

source: instead of applying the patch, output diffstat for the input
ta: பேட்சைப் பயன்படுத்துவதற்குப் பதிலாக, உள்ளீட்டிற்கான வெளியீடு டிஃப்ச்டாட்

source: show number of added and deleted lines in decimal notation
ta: தசம குறியீட்டில் சேர்க்கப்பட்ட மற்றும் நீக்கப்பட்ட வரிகளின் எண்ணிக்கையைக் காட்டு

source: instead of applying the patch, output a summary for the input
ta: பேட்சைப் பயன்படுத்துவதற்குப் பதிலாக, உள்ளீட்டிற்கான சுருக்கத்தை வெளியிடுங்கள்

source: instead of applying the patch, see if the patch is applicable
ta: பேட்சைப் பயன்படுத்துவதற்குப் பதிலாக, இணைப்பு பொருந்துமா என்று பாருங்கள்

source: make sure the patch is applicable to the current index
ta: தற்போதைய குறியீட்டிற்கு இணைப்பு பொருந்தும் என்பதை உறுதிப்படுத்தவும்

source: mark new files with `git add --intent-to-add`
ta: புதிய கோப்புகளை `git add --intent-to-add` உடன் குறிக்கவும்

source: apply a patch without touching the working tree
ta: பணி மரத்தைத் தொடாமல் ஒரு பேட்சைப் பயன்படுத்துங்கள்

source: accept a patch that touches outside the working area
ta: பணி பகுதிக்கு வெளியே தொடும் ஒரு இணைப்பை ஏற்றுக்கொள்ளுங்கள்

source: also apply the patch (use with --stat/--summary/--check)
ta: ஒட்டையும் பயன்படுத்துங்கள் (--stat/--summary/--check மூலம் பயன்படுத்தவும்)

source: attempt three-way merge, fall back on normal patch if that fails
ta: மூன்று வழி ஒன்றிணைக்க முயற்சிக்கவும், அது தோல்வியுற்றால் சாதாரண பேட்சில் மீண்டும் விழும்

source: for conflicts, use our version
ta: மோதல்களுக்கு, எங்கள் பதிப்பைப் பயன்படுத்தவும்

source: for conflicts, use their version
ta: மோதல்களுக்கு, அவற்றின் பதிப்பைப் பயன்படுத்தவும்

source: for conflicts, use a union version
ta: மோதல்களுக்கு, தொழிற்சங்க பதிப்பைப் பயன்படுத்தவும்

source: build a temporary index based on embedded index information
ta: உட்பொதிக்கப்பட்ட குறியீட்டு தகவல்களின் அடிப்படையில் தற்காலிக குறியீட்டை உருவாக்குங்கள்

source: paths are separated with NUL character
ta: பாதைகள் நுல் தன்மையுடன் பிரிக்கப்படுகின்றன

source: ensure at least <n> lines of context match
ta: சூழல் பொருத்தத்தின் குறைந்தபட்சம் <n> வரிகளை உறுதிசெய்க

source: action
ta: செயல்

source: detect new or modified lines that have whitespace errors
ta: இடைவெளி பிழைகள் கொண்ட புதிய அல்லது மாற்றியமைக்கப்பட்ட வரிகளைக் கண்டறியவும்

source: ignore changes in whitespace when finding context
ta: சூழலைக் கண்டறியும்போது இடைவெளியில் ஏற்படும் மாற்றங்களை புறக்கணி

source: apply the patch in reverse
ta: தலைகீழாக பேட்சைப் பயன்படுத்துங்கள்

source: don't expect at least one line of context
ta: சூழலின் ஒரு வரியையாவது எதிர்பார்க்க வேண்டாம்

source: leave the rejected hunks in corresponding *.rej files
ta: நிராகரிக்கப்பட்ட அன்களை தொடர்புடைய *.rej கோப்புகளில் விடுங்கள்

source: allow overlapping hunks
ta: ஒன்றுடன் ஒன்று அன்க்சை அனுமதிக்கவும்

source: tolerate incorrectly detected missing new-line at the end of file
ta: கோப்பின் முடிவில் காணாமல் போன புதிய வரியை தவறாகக் கண்டறியவும்

source: do not trust the line counts in the hunk headers
ta: அங்க் தலைப்புகளில் வரி எண்ணிக்கையை நம்ப வேண்டாம்

source: root
ta: மூலம்

source: prepend <root> to all filenames
ta: அனைத்து கோப்பு பெயர்களுக்கும் <வேர்> ஆயத்தம் செய்யுங்கள்

source: don't return error for empty patches
ta: வெற்று திட்டுகளுக்கு பிழையைத் தர வேண்டாம்

source: cannot stream blob %s
ta: குமிழ் %s ஐ ச்ட்ரீம் செய்ய முடியாது

source: unsupported file mode: 0%o (SHA1: %s)
ta: ஆதரிக்கப்படாத கோப்பு முறை: 0 %o (sha1: %s)

source: deflate error (%d)
ta: பிழையை நீக்குதல் (%d)

source: unable to start '%s' filter
ta: '%s' வடிப்பானைத் தொடங்க முடியவில்லை

source: unable to redirect descriptor
ta: விளக்கத்தை திருப்பிவிட முடியவில்லை

source: '%s' filter reported error
ta: '%s' வடிகட்டி பிழை

source: path is not valid UTF-8: %s
ta: பாதை செல்லுபடியாகும் utf-8: %s

source: path too long (%d chars, SHA1: %s): %s
ta: பாதை மிக நீளமானது ( %d எழுத்துக்கள், sha1: %s): %s

source: timestamp too large for this system: %<PRIuMAX>
ta: இந்த அமைப்புக்கு நேர முத்திரை மிகப் பெரியது: %<PRIuMAX>

source: git archive [<options>] <tree-ish> [<path>...]
ta: அறிவிலி காப்பகம் [<விருப்பங்கள்>] <மரமாக> [<பாதை>...]

source: git archive --remote <repo> [--exec <cmd>] [<options>] <tree-ish> [<path>...]
ta: git archive --remote <களஞ்சியம்> [--exec <கட்டளை>] [<விருப்பங்கள்>] <மரமாக> [<பாதை>...][<path>...]

source: git archive --remote <repo> [--exec <cmd>] --list
ta: git archive --remote <களஞ்சியம்> [--exec <கட்டளை>] --list

source: cannot read '%s'
ta: '%s' படிக்க முடியாது

source: pathspec '%s' matches files outside the current directory
ta: பாதைகுறிப்பு '%s' தற்போதைய கோப்பகத்திற்கு வெளியே கோப்புகளுடன் பொருந்துகிறது

source: pathspec '%s' did not match any files
ta: பாதைகுறிப்பு '%s' எந்த கோப்புகளும் பொருந்தவில்லை

source: no such ref: %.*s
ta: அத்தகைய குறிப்பு இல்லை: %.*s

source: not a valid object name: %s
ta: செல்லுபடியாகும் பொருள் பெயர் அல்ல: %s

source: not a tree object: %s
ta: ஒரு மர பொருள் அல்ல: %s

source: File not found: %s
ta: கோப்பு கிடைக்கவில்லை: %s

source: Not a regular file: %s
ta: வழக்கமான கோப்பு அல்ல: %s

source: unclosed quote: '%s'
ta: திறக்கப்படாத மேற்கோள்: '%s'

source: missing colon: '%s'
ta: பெருங்குடல் காணவில்லை: '%s'

source: empty file name: '%s'
ta: வெற்று கோப்பு பெயர்: '%s'

source: archive format
ta: காப்பக வடிவம்

source: prefix
ta: முன்னொட்டு

source: prepend prefix to each pathname in the archive
ta: காப்பகத்தில் ஒவ்வொரு பாதை பெயருக்கும் முன்னொட்டை ஆயத்தம் செய்யுங்கள்

source: file
ta: கோப்பு

source: add untracked file to archive
ta: காப்பகத்திற்கு கட்டுப்படுத்தப்படாத கோப்பைச் சேர்க்கவும்

source: path:content
ta: பாதை: உள்ளடக்கம்

source: write the archive to this file
ta: இந்த கோப்பில் காப்பகத்தை எழுதுங்கள்

source: read .gitattributes in working directory
ta: படிக்கவும்

source: report archived files on stderr
ta: காப்பகப்படுத்தப்பட்ட கோப்புகளை stderr இல் புகாரளிக்கவும்

source: time
ta: நேரம்

source: set modification time of archive entries
ta: காப்பக உள்ளீடுகளின் மாற்ற நேரத்தை அமைக்கவும்

source: set compression level
ta: சுருக்க அளவை அமைக்கவும்

source: list supported archive formats
ta: உதவி காப்பக வடிவங்களை பட்டியல்

source: repo
ta: களஞ்சி

source: retrieve the archive from remote repository <repo>
ta: தொலை களஞ்சியத்திலிருந்து காப்பகத்தை மீட்டெடுக்கவும் <repo>

source: command
ta: கட்டளை

source: path to the remote git-upload-archive command
ta: தொலைநிலை git-upload-archive கட்டளைக்கான பாதை

source: Unexpected option --remote
ta: எதிர்பாராத விருப்பம் --remote

source: the option '%s' requires '%s'
ta: '%s' விருப்பத்திற்கு '%s' தேவை

source: Unexpected option --output
ta: எதிர்பாராத விருப்பம் --output

source: extra command line parameter '%s'
ta: கூடுதல் கட்டளை வரி அளவுரு '%s'

source: Unknown archive format '%s'
ta: அறியப்படாத காப்பக வடிவமைப்பு '%s'

source: Argument not supported for format '%s': -%d
ta: '%s' வடிவத்திற்கு உரையாடல் ஆதரிக்கப்படவில்லை: -%d

source: %.*s is not a valid attribute name
ta: %.*s சரியான பண்புக்கூறு பெயர் அல்ல

source: unable to add additional attribute
ta: கூடுதல் பண்புகளைச் சேர்க்க முடியவில்லை

source: ignoring overly long attributes line %d
ta: அதிகப்படியான நீண்ட பண்புகளை புறக்கணித்தல் வரி %d

source: %s not allowed: %s:%d
ta: %s அனுமதிக்கப்படவில்லை: %s: %d

source: Negative patterns are ignored in git attributes Use '\!' for literal leading exclamation.
ta: git பண்புகளில் எதிர்மறை வடிவங்கள் புறக்கணிக்கப்படுகின்றன '\!' நேரடி முன்னணி ஆச்சரியத்திற்கு.

source: cannot fstat gitattributes file '%s'
ta: fstat gitattributes கோப்பு '%s'

source: ignoring overly large gitattributes file '%s'
ta: அதிகப்படியான பெரிய gitattributes கோப்பை புறக்கணித்தல் '%s'

source: ignoring overly large gitattributes blob '%s'
ta: அதிகப்படியான பெரிய gitattributes குமிழி '%s' ஐ புறக்கணித்தல்

source: bad --attr-source or GIT_ATTR_SOURCE
ta: மோசமான --attr-source அல்லது GIT_ATTR_SOURCE

source: unable to stat '%s'
ta: '%s' என்று ச்டேட் செய்ய முடியவில்லை

source: unable to read %s
ta: %s படிக்க முடியவில்லை

source: Badly quoted content in file '%s': %s
ta: '%s' கோப்பில் மோசமாக மேற்கோள் காட்டப்பட்ட உள்ளடக்கம்: %s

source: We cannot bisect more!
ta: நாம் இன்னும் பிளவுபட முடியாது!

source: Not a valid commit name %s
ta: செல்லுபடியாகும் உறுதி பெயர் %s அல்ல

source: The merge base %s is bad. This means the bug has been fixed between %s and [%s].
ta: ஒன்றிணைக்கும் அடிப்படை %s மோசமானவை. இதன் பொருள் %s மற்றும் [ %s] க்கு இடையில் பிழை சரி செய்யப்பட்டது.

source: The merge base %s is new. The property has changed between %s and [%s].
ta: ஒன்றிணைக்கும் அடிப்படை %s புதியவை. %s மற்றும் [ %s] க்கு இடையில் சொத்து மாறிவிட்டது.

source: The merge base %s is %s. This means the first '%s' commit is between %s and [%s].
ta: ஒன்றிணைக்கும் அடிப்படை %s %s ஆகும். இதன் பொருள் முதல் '%s' உறுதி%s மற்றும் [%s] க்கு இடையில் உள்ளது.

source: Some %s revs are not ancestors of the %s rev. git bisect cannot work properly in this case. Maybe you mistook %s and %s revs?
ta: சில %s revs %s rev இன் மூதாதையர்கள் அல்ல. இந்த விசயத்தில் அறிவிலி பி.எச்.ஐ.டி சரியாக பணி செய்ய முடியாது. %s மற்றும் %s revs ஐ நீங்கள் தவறாக நினைத்திருக்கலாம்?

source: the merge base between %s and [%s] must be skipped. So we cannot be sure the first %s commit is between %s and %s. We continue anyway.
ta: %s மற்றும் [ %s] க்கு இடையிலான ஒன்றிணைப்பு தளத்தைத் தவிர்க்க வேண்டும். எனவே முதல் %s உறுதி %s மற்றும் %s இடையே என்பதை நாம் உறுதியாக நம்ப முடியாது. நாங்கள் எப்படியும் தொடர்கிறோம்.

source: Bisecting: a merge base must be tested
ta: பிரித்தல்: ஒன்றிணைக்கும் தளத்தை சோதிக்க வேண்டும்

source: a %s revision is needed
ta: ஒரு %s திருத்தம் தேவை

source: could not create file '%s'
ta: '%s' கோப்பை உருவாக்க முடியவில்லை

source: unable to start 'show' for object '%s'
ta: பொருள் '%s' க்காக 'சோ' தொடங்க முடியவில்லை

source: could not read file '%s'
ta: '%s' கோப்பைப் படிக்க முடியவில்லை

source: reading bisect refs failed
ta: பி.எச்.இ.டி ரெஃப்சைப் படித்தல் தோல்வியடைந்தது

source: %s was both %s and %s
ta: %s இரண்டும் %s மற்றும் %s

source: No testable commit found. Maybe you started with bad path arguments?
ta: சோதனைக்குரிய உறுதி எதுவும் கிடைக்கவில்லை. ஒருவேளை நீங்கள் மோசமான பாதை வாதங்களுடன் தொடங்கியிருக்கலாம்?

source: (roughly %d step)
ta: (தோராயமாக %d படி)

source: Bisecting: %d revision left to test after this %s
ta: பிரித்தல்: சோதிக்க %d திருத்தம் எஞ்சியுள்ளது இந்த %s க்குப் பிறகு

source: --contents and --reverse do not blend well.
ta: --contents மற்றும் --reverse நன்றாக கலக்காது.

source: --reverse and --first-parent together require specified latest commit
ta: --reverse மற்றும் --first-parent ஒன்றாக குறிப்பிட்ட அண்மைக் கால உறுதிப்பாடு தேவை

source: revision walk setup failed
ta: திருத்த நடை அமைப்பு தோல்வியடைந்தது

source: --reverse --first-parent together require range along first-parent chain
ta: --reverse --first-parent ஒன்றாக முதல்-பெற்றோர் சங்கிலியுடன் வரம்பு தேவைப்படுகிறது

source: no such path %s in %s
ta: அத்தகைய பாதை %s இல் %s இல் இல்லை

source: cannot read blob %s for path %s
ta: பாதை %s க்கு blob %s ஐப் படிக்க முடியாது

source: cannot inherit upstream tracking configuration of multiple refs when rebasing is requested
ta: மறுசீரமைப்பு கோரப்படும்போது பல குறிப்புகளின் மேலோடை கண்காணிப்பு உள்ளமைவைப் பெற முடியாது

source: not setting branch '%s' as its own upstream
ta: கிளையை '%s' அதன் சொந்த அப்ச்ட்ரீமாக அமைக்கவில்லை

source: branch '%s' set up to track '%s' by rebasing.
ta: புனரமைப்பதன் மூலம் '%s' கண்காணிக்க கிளை '%s' அமைக்கப்படுகிறது.

source: branch '%s' set up to track '%s'.
ta: '%s' என்பதைக் கண்காணிக்க கிளை '%s' அமைக்கப்படுகிறது.

source: branch '%s' set up to track:
ta: கண்காணிக்க அமைக்கப்பட்ட கிளை '%s':

source: unable to write upstream branch configuration
ta: மேலோடை கிளை உள்ளமைவு எழுத முடியவில்லை

source: After fixing the error cause you may try to fix up the remote tracking information by invoking:
ta: பிழையை சரிசெய்த பிறகு நீங்கள் சரிசெய்ய முயற்சி செய்யலாம் தொலைநிலை கண்காணிப்பு செய்தி செயல்படுத்துவதன் மூலம்:

source: asked to inherit tracking from '%s', but no remote is set
ta: '%s' இலிருந்து கண்காணிப்பைப் பெறுமாறு கேட்டார், ஆனால் தொலை எதுவும் அமைக்கப்படவில்லை

source: asked to inherit tracking from '%s', but no merge configuration is set
ta: '%s' இலிருந்து கண்காணிப்பைப் பெறுமாறு கேட்டார், ஆனால் ஒன்றிணைக்கும் உள்ளமைவு எதுவும் அமைக்கப்படவில்லை

source: not tracking: ambiguous information for ref '%s'
ta: கண்காணிக்கவில்லை: ref '%s' க்கான தெளிவற்ற தகவல்கள்

source: There are multiple remotes whose fetch refspecs map to the remote tracking ref '%s': %s This is typically a configuration error. To support setting up tracking branches, ensure that different remotes' fetch refspecs map into different tracking namespaces.
ta: பல தொலைகள் உள்ளன, அவற்றின் refspecs வரைபடத்தை தொலைதூரத்திற்கு பெறுகின்றன கண்காணிப்பு ref '%s': %s இது பொதுவாக ஒரு உள்ளமைவு பிழை. கண்காணிப்பு கிளைகளை அமைப்பதை ஆதரிக்க, அதை உறுதிப்படுத்தவும் வெவ்வேறு தொலைகள் 'ரெஃப்ச்பெக்ச் வரைபடத்தை வேறுபடுத்துகின்றன பெயர்வெளிகளைக் கண்காணித்தல்.

source: '%s' is not a valid branch name
ta: '%s' என்பது சரியான கிளை பெயர் அல்ல

source: a branch named '%s' already exists
ta: '%s' என்ற ஒரு கிளை ஏற்கனவே உள்ளது

source: cannot force update the branch '%s' used by worktree at '%s'
ta: '%s' இல் பணியிடத்தால் பயன்படுத்தப்படும் கிளையை '%s' புதுப்பிக்க கட்டாயப்படுத்த முடியாது

source: cannot set up tracking information; starting point '%s' is not a branch
ta: கண்காணிப்பு தகவல்களை அமைக்க முடியாது; தொடக்க புள்ளி '%s' ஒரு கிளை அல்ல

source: the requested upstream branch '%s' does not exist
ta: கோரப்பட்ட மேலோடை கிளை '%s' இல்லை

source: If you are planning on basing your work on an upstream branch that already exists at the remote, you may need to run "git fetch" to retrieve it. If you are planning to push out a new local branch that will track its remote counterpart, you may want to use "git push -u" to set the upstream config as you push.
ta: உங்கள் பணியை ஒரு அப்ச்ட்ரீமில் அடிப்படையாகக் கொள்ள திட்டமிட்டால் ஏற்கனவே தொலைதூரத்தில் இருக்கும் கிளை, நீங்கள் செய்ய வேண்டியிருக்கலாம் அதை மீட்டெடுக்க "அறிவிலி ஃபெட்ச்" ஐ இயக்கவும். நீங்கள் ஒரு புதிய உள்ளக கிளையை வெளியேற்ற திட்டமிட்டால் அதன் தொலை எண்ணைக் கண்காணிக்கும், நீங்கள் பயன்படுத்த விரும்பலாம் நீங்கள் தள்ளும்போது மேலோடை உள்ளமைவை அமைக்க "அறிவிலி புச் -யூ".

source: not a valid object name: '%s'
ta: செல்லுபடியாகும் பொருள் பெயர் அல்ல: '%s'

source: ambiguous object name: '%s'
ta: தெளிவற்ற பொருள் பெயர்: '%s'

source: not a valid branch point: '%s'
ta: செல்லுபடியாகும் கிளை புள்ளி அல்ல: '%s'

source: submodule '%s': unable to find submodule
ta: துணைதொகுதி '%s': துணைதொகுதியைக் கண்டுபிடிக்க முடியவில்லை

source: You may try updating the submodules using 'git checkout --no-recurse-submodules %s && git submodule update --init'
ta: 'git checkout --no-recurse-submodules %s && git submodule update --init' ஆகியவற்றைப் பயன்படுத்தி துணைதொகுதிகளைப் புதுப்பிக்க முயற்சி செய்யலாம்

source: submodule '%s': cannot create branch '%s'
ta: துணைதொகுதி '%s': கிளைகளை உருவாக்க முடியாது '%s'

source: '%s' is already used by worktree at '%s'
ta: '%s' ஏற்கனவே '%s' என்ற இடத்தில் பணியாளர்களால் பயன்படுத்தப்படுகின்றன

source: git add [<options>] [--] <pathspec>...
ta: git சேர் [<விருப்பங்கள்>] [-] <adagspec> ...

source: cannot chmod %cx '%s'
ta: chmod %cx '%s'

source: Unstaged changes after refreshing the index:
ta: குறியீட்டைப் புதுப்பித்த பிறகு நிலையற்ற மாற்றங்கள்:

source: could not read the index
ta: குறியீட்டைப் படிக்க முடியவில்லை

source: editing patch failed
ta: திருத்துதல் ஒட்டு தோல்வியடைந்தது

source: could not stat '%s'
ta: '%s' ச்டேட் செய்ய முடியவில்லை

source: empty patch. aborted
ta: வெற்று இணைப்பு. கருக்கலைப்பு

source: could not apply '%s'
ta: '%s' விண்ணப்பிக்க முடியவில்லை

source: The following paths are ignored by one of your .gitignore files:
ta: உங்கள் .gitignore கோப்புகளில் ஒன்றால் பின்வரும் பாதைகள் புறக்கணிக்கப்படுகின்றன:

source: dry run
ta: உலர்ந்த ஓட்டம்

source: be verbose
ta: வாய்மொழியாக இருங்கள்

source: interactive picking
ta: ஊடாடும் எடுக்கும்

source: select hunks interactively
ta: ஊடாடும் வகையில் அங்குகளைத் தேர்ந்தெடுக்கவும்

source: edit current diff and apply
ta: தற்போதைய வேறுபாட்டைத் திருத்தி விண்ணப்பிக்கவும்

source: allow adding otherwise ignored files
ta: புறக்கணிக்கப்பட்ட கோப்புகளைச் சேர்க்க அனுமதிக்கவும்

source: update tracked files
ta: கண்காணிக்கப்பட்ட கோப்புகளைப் புதுப்பிக்கவும்

source: renormalize EOL of tracked files (implies -u)
ta: கண்காணிக்கப்பட்ட கோப்புகளின் eol ஐ மறுசீரமைக்கவும் (-u ஐ குறிக்கிறது)

source: record only the fact that the path will be added later
ta: பாதை பின்னர் சேர்க்கப்படும் என்ற உண்மையை மட்டுமே பதிவுசெய்க

source: add changes from all tracked and untracked files
ta: கண்காணிக்கப்பட்ட மற்றும் கட்டுப்படுத்தப்படாத அனைத்து கோப்புகளிலிருந்தும் மாற்றங்களைச் சேர்க்கவும்

source: ignore paths removed in the working tree (same as --no-all)
ta: பணி மரத்தில் அகற்றப்பட்ட பாதைகளை புறக்கணி (--no-all சமம்)

source: don't add, only refresh the index
ta: சேர்க்க வேண்டாம், குறியீட்டை மட்டும் புதுப்பிக்கவும்

source: just skip files which cannot be added because of errors
ta: பிழைகள் காரணமாக சேர்க்க முடியாத கோப்புகளைத் தவிர்க்கவும்

source: check if - even missing - files are ignored in dry run
ta: உலர் ரன்னில் கோப்புகள் புறக்கணிக்கப்படுகின்றனவா என்று சரிபார்

source: allow updating entries outside of the sparse-checkout cone
ta: சிதறிய-செக்அவுட் கூம்புக்கு வெளியே உள்ளீடுகளைப் புதுப்பிக்க அனுமதிக்கவும்

source: override the executable bit of the listed files
ta: பட்டியலிடப்பட்ட கோப்புகளின் இயங்கக்கூடிய பிட்டை மேலெழுதவும்

source: warn when adding an embedded repository
ta: உட்பொதிக்கப்பட்ட களஞ்சியத்தைச் சேர்க்கும்போது எச்சரிக்கவும்

source: You've added another git repository inside your current repository. Clones of the outer repository will not contain the contents of the embedded repository and will not know how to obtain it. If you meant to add a submodule, use: git submodule add <url> %s If you added this path by mistake, you can remove it from the index with: git rm --cached %s See "git help submodule" for more information.
ta: உங்கள் தற்போதைய களஞ்சியத்திற்குள் மற்றொரு அறிவிலி களஞ்சியத்தை சேர்த்துள்ளீர்கள். வெளிப்புற களஞ்சியத்தின் குளோன்களில் உள்ளடக்கங்கள் இருக்காது உட்பொதிக்கப்பட்ட களஞ்சியம் மற்றும் அதை எவ்வாறு பெறுவது என்று தெரியாது. நீங்கள் ஒரு துணைதொகுதியைச் சேர்க்க விரும்பினால், பயன்படுத்தவும்: git submodule add <முகவரி> %s இந்த பாதையை நீங்கள் தவறுதலாக சேர்த்தால், அதை அகற்றலாம் உடன் குறியீட்டு: git rm --cached %s மேலும் தகவலுக்கு "git help submodule" ஐப் பார்.

source: adding embedded git repository: %s
ta: உட்பொதிக்கப்பட்ட அறிவிலி களஞ்சியத்தைச் சேர்ப்பது: %s

source: adding files failed
ta: கோப்புகளைச் சேர்ப்பது தோல்வியடைந்தது
