Repository: Nizhal/git-ta-po
Catalog: po/*.po
Languages: ta

source: in the working copy of '%s', CRLF will be replaced by LF the next time Git touches it
ta: '%s' இன் பணி நகலில், அடுத்த முறை git அதைத் தொடும் போது சிஆர்எல்எஃப் எல்எஃப் ஆல் மாற்றப்படும்

source: LF would be replaced by CRLF in %s
ta: எல்.எஃப் %s இல் சி.ஆர்.எல்.எஃப் மாற்றப்படும்

source: in the working copy of '%s', LF will be replaced by CRLF the next time Git touches it
ta: '%s' இன் பணி நகலில், அடுத்த முறை அறிவிலி அதைத் தொடும்போது எல்.எஃப் சி.ஆர்.எல்.எஃப் ஆல் மாற்றப்படும்

source: BOM is prohibited in '%s' if encoded as %s
ta: %s என குறியிடப்பட்டால் '%s' இல் bom தடைசெய்யப்பட்டுள்ளது

source: The file '%s' contains a byte order mark (BOM). Please use UTF-%.*s as working-tree-encoding.
ta: '%s' கோப்பில் ஒரு பைட் ஆர்டர் குறி (bom) உள்ளது. தயவுசெய்து யுடிஎஃப்-%.*s பணி-மரம்-குறியாக்கமாக பயன்படுத்தவும்.

source: BOM is required in '%s' if encoded as %s
ta: %s என குறியிடப்பட்டால் '%s' இல் bom தேவைப்படுகிறது

source: The file '%s' is missing a byte order mark (BOM). Please use UTF-%sBE or UTF-%sLE (depending on the byte order) as working-tree-encoding.
ta: '%s' கோப்பு ஒரு பைட் ஆர்டர் குறி (bom) காணவில்லை. தயவுசெய்து utf-%sbe அல்லது utf-%sle (பைட் ஆர்டரைப் பொறுத்து) பணி-மரம்-குறியாக்கமாகப் பயன்படுத்தவும்.

source: failed to encode '%s' from %s to %s
ta: %s முதல் %s வரை '%s' ஐ குறியாக்கத் தவறிவிட்டது

source: encoding '%s' from %s to %s and back is not the same
ta: '%s' ஐ %s முதல் %s வரை குறியாக்கம் செய்வது ஒன்றல்ல

source: cannot fork to run external filter '%s'
ta: வெளிப்புற வடிப்பானை '%s' இயக்க முடியாது

source: cannot feed the input to external filter '%s'
ta: வெளிப்புற வடிகட்டி '%s' க்கு உள்ளீட்டை வழங்க முடியாது

source: external filter '%s' failed %d
ta: வெளிப்புற வடிகட்டி '%s' தோல்வியுற்றது %d

source: read from external filter '%s' failed
ta: வெளிப்புற வடிப்பானிலிருந்து படிக்கவும் '%s' தோல்வியடைந்தது

source: external filter '%s' failed
ta: வெளிப்புற வடிகட்டி '%s' தோல்வியடைந்தது

source: unexpected filter type
ta: எதிர்பாராத வடிகட்டி வகை

source: path name too long for external filter
ta: வெளிப்புற வடிப்பானுக்கு பாதை பெயர் மிக நீண்டது

source: external filter '%s' is not available anymore although not all paths have been filtered
ta: எல்லா பாதைகளும் வடிகட்டப்படவில்லை என்றாலும் வெளிப்புற வடிகட்டி '%s' இனி கிடைக்காது

source: true/false are no valid working-tree-encodings
ta: உண்மை/பொய் சரியான பணி-மரம்-குறியீடுகள் அல்ல

source: %s: clean filter '%s' failed
ta: %s: தூய்மையான வடிகட்டி '%s' தோல்வியடைந்தது

source: %s: smudge filter %s failed
ta: %s: ச்மட்ச் வடிகட்டி %s தோல்வியடைந்தன

source: skipping credential lookup for key: credential.%s
ta: விசைக்கான நற்சான்றிதழ் தேடலைத் தவிர்ப்பது: நற்சான்றிதழ்.%s

source: refusing to work with credential missing host field
ta: நற்சான்றிதழ் காணாமல் போன புரவலன் புலத்துடன் பணி செய்ய மறுக்கிறது

source: refusing to work with credential missing protocol field
ta: நற்சான்றிதழ் காணாமல் போன நெறிமுறை புலத்துடன் பணி செய்ய மறுக்கிறது

source: url contains a newline in its %s component: %s
ta: முகவரி அதன் %s கூறுகளில் ஒரு புதிய வரியைக் கொண்டுள்ளது: %s

source: url has no scheme: %s
ta: முகவரி க்கு எந்த திட்டமும் இல்லை: %s

source: credential url cannot be parsed: %s
ta: நற்சான்றிதழ் முகவரி ஐ பாகுபடுத்த முடியாது: %s

source: in the future
ta: எதிர்காலத்தில்

source: %<PRIuMAX> second ago
ta: %<PRIuMAX> இரண்டாவது முன்

source: %<PRIuMAX> minute ago
ta: %<PRIuMAX> நிமிடத்திற்கு முன்பு

source: %<PRIuMAX> hour ago
ta: %<PRIuMAX> மணி நேரத்திற்கு முன்பு

source: %<PRIuMAX> day ago
ta: %<PRIuMAX> நாள் முன்பு

source: %<PRIuMAX> week ago
ta: %<PRIuMAX> வாரத்திற்கு முன்பு

source: %<PRIuMAX> month ago
ta: %<PRIuMAX> மாதத்திற்கு முன்பு

source: %<PRIuMAX> year
ta: %<PRIuMAX> ஆண்டு

source: %s, %<PRIuMAX> month ago
ta: %s, %<PRIuMAX> மாதத்திற்கு முன்பு

source: %<PRIuMAX> year ago
ta: %<PRIuMAX> ஆண்டுக்கு முன்பு

source: Propagating island marks
ta: தீவு மதிப்பெண்களைப் பரப்புதல்

source: bad tree object %s
ta: மோசமான மர பொருள் %s

source: failed to load island regex for '%s': %s
ta: '%s' க்கு தீவு ரெசெக்சை ஏற்றுவதில் தோல்வி: %s

source: island regex from config has too many capture groups (max=%d)
ta: கட்டமைப்பிலிருந்து தீவு வழக்கவெளி பல பிட்சர் குழுக்களைக் கொண்டுள்ளது (அதிகபட்சம் =%d)

source: Marked %d islands, done.
ta: குறிக்கப்பட்ட %d தீவுகள், முடிந்தது.

source: invalid --%s value '%s'
ta: செல்லாது -%s மதிப்பு '%s'

source: could not archive missing directory '%s'
ta: காணாமல் போன கோப்பகத்தை '%s' காப்பகப்படுத்த முடியவில்லை

source: could not open directory '%s'
ta: கோப்பகத்தை '%s' திறக்க முடியவில்லை

source: skipping '%s', which is neither file nor directory
ta: '%s' ஐத் தவிர்ப்பது, இது கோப்பு அல்லது அடைவு அல்ல

source: could not duplicate stdout
ta: stdout ஐ நகலெடுக்க முடியவில்லை

source: could not add directory '%s' to archiver
ta: காப்பகத்திற்கு '%s' கோப்பகத்தை சேர்க்க முடியவில்லை

source: failed to write archive
ta: காப்பகம் எழுதத் தவறிவிட்டது

source: --merge-base does not work with ranges
ta: --merge-base வரம்புகளுடன் பணி செய்யாது

source: unable to get HEAD
ta: தலை பெற முடியவில்லை

source: no merge base found
ta: ஒன்றிணைக்கும் அடிப்படை எதுவும் கிடைக்கவில்லை

source: multiple merge bases found
ta: பல ஒன்றிணைப்பு தளங்கள் காணப்படுகின்றன

source: cannot compare stdin to a directory
ta: stdin ஐ ஒரு கோப்பகத்துடன் ஒப்பிட முடியாது

source: cannot compare a named pipe to a directory
ta: பெயரிடப்பட்ட குழாயை ஒரு கோப்பகத்துடன் ஒப்பிட முடியாது

source: git diff --no-index [<options>] <path> <path>
ta: git diff --no-index [<விருப்பங்கள்>] <பாதை> <பாதை>

source: Not a git repository. Use --no-index to compare two paths outside a working tree
ta: ஒரு அறிவிலி களஞ்சியம் அல்ல. பணி மரத்திற்கு வெளியே இரண்டு பாதைகளை ஒப்பிட்டுப் பார்க்க --no-index ஐப் பயன்படுத்தவும்

source: Failed to parse dirstat cut-off percentage '%s'
ta: டிர்ச்டாட் கட்-ஆஃப் சதவீதத்தை '%s' என்று அலசத் தவறிவிட்டது

source: Unknown dirstat parameter '%s'
ta: அறியப்படாத டிர்ச்டாட் அளவுரு '%s'

source: color moved setting must be one of 'no', 'default', 'blocks', 'zebra', 'dimmed-zebra', 'plain'
ta: வண்ண நகர்த்தப்பட்ட அமைப்பு 'இல்லை', 'இயல்புநிலை', 'தொகுதிகள்', 'சீப்ரா', 'மங்கலான-செப்ரா', 'வெற்று'

source: unknown color-moved-ws mode '%s', possible values are 'ignore-space-change', 'ignore-space-at-eol', 'ignore-all-space', 'allow-indentation-change'
ta: அறியப்படாத வண்ண-உமிழும்-ws பயன்முறை '%s', சாத்தியமான மதிப்புகள் 'புறக்கணிப்பு-இடத்தை-மாற்றம்', 'புறக்கணி-ச்பேச்-அட்-யோல்', 'புறக்கணிப்பு-ஆல்-ச்பேச்', 'அனுமதி-இன்டென்டேசன்-சேஞ்ச்'

source: color-moved-ws: allow-indentation-change cannot be combined with other whitespace modes
ta: வண்ண-அதிகரிக்கும்-ws: அனுமதி-இன்டென்டேசன்-சேஞ்ச் மற்ற இடைவெளி முறைகளுடன் இணைக்க முடியாது

source: Unknown value for 'diff.submodule' config variable: '%s'
ta: 'diff.submodule' கட்டமைப்பு மாறி: '%s' க்கான அறியப்படாத மதிப்பு

source: unknown value for config '%s': %s
ta: '%s' கட்டமைப்பிற்கான அறியப்படாத மதிப்பு: %s

source: Found errors in 'diff.dirstat' config variable: %s
ta: 'diff.dirstat' கட்டமைப்பு மாறியில் பிழைகள் காணப்படுகின்றன: %s

source: external diff died, stopping at %s
ta: வெளிப்புற வேறுபாடு இறந்தது, %s இல் நிறுத்தப்பட்டது

source: --follow requires exactly one pathspec
ta: --follow சரியாக ஒரு பாதைகுறிப்பு தேவை

source: pathspec magic not supported by --follow: %s
ta: பாதைகுறிப்பு மேசிக் ஆதரிக்கப்படவில்லை --follow: %s

source: options '%s', '%s', '%s', and '%s' cannot be used together
ta: விருப்பங்கள் '%s', '%s', '%s', மற்றும் '%s' ஆகியவற்றை ஒன்றாகப் பயன்படுத்த முடியாது

source: options '%s' and '%s' cannot be used together, use '%s' with '%s'
ta: விருப்பங்கள் '%s' மற்றும் '%s' ஆகியவற்றை ஒன்றாகப் பயன்படுத்த முடியாது, '%s' உடன் '%s' உடன் பயன்படுத்தவும்

source: options '%s' and '%s' cannot be used together, use '%s' with '%s' and '%s'
ta: விருப்பங்கள் '%s' மற்றும் '%s' ஒன்றாகப் பயன்படுத்த முடியாது, '%s' மற்றும் '%s' உடன் '%s' ஐப் பயன்படுத்தவும்

source: invalid --stat value: %s
ta: தவறான --stat மதிப்பு: %s

source: %s expects a numerical value
ta: %s ஒரு எண் மதிப்பை எதிர்பார்க்கிறது

source: Failed to parse --dirstat/-X option parameter: %s
ta: அலசிடுவதில் தோல்வி --dirstat/-X விருப்ப அளவுரு: %s

source: unknown change class '%c' in --diff-filter=%s
ta: அறியப்படாத மாற்றம் வகுப்பு '%c' in --diff-filter=%s

source: unknown value after ws-error-highlight=%.*s
ta: ws-error-highlight=%.*s க்குப் பிறகு அறியப்படாத மதிப்பு

source: unable to resolve '%s'
ta: '%s' தீர்க்க முடியவில்லை

source: %s expects <n>/<m> form
ta: %s <n>/<m> படிவத்தை எதிர்பார்க்கிறது

source: %s expects a character, got '%s'
ta: %s ஒரு பாத்திரத்தை எதிர்பார்க்கிறது, '%s' கிடைத்தது

source: bad --color-moved argument: %s
ta: மோசமான --color-moved வாதம்: %s

source: invalid mode '%s' in --color-moved-ws
ta: தவறான பயன்முறை '%s' --color-moved-ws

source: invalid argument to %s
ta: %s க்கு தவறான உரையாடல்

source: invalid regex given to -I: '%s'
ta: -i க்கு கொடுக்கப்பட்ட தவறான ரீசெக்ச்: '%s'

source: failed to parse --submodule option parameter: '%s'
ta: அலசிடுவதில் தோல்வி --submodule விருப்ப அளவுரு: '%s'

source: bad --word-diff argument: %s
ta: மோசமான --word-diff வாதம்: %s

source: Diff output format options
ta: வெளியீட்டு வடிவமைப்பு விருப்பங்கள்

source: generate patch
ta: பேட்சை உருவாக்குங்கள்

source: <n>
ta: <எ>

source: generate diffs with <n> lines context
ta: <n> வரிகள் சூழலுடன் வேறுபாடுகளை உருவாக்குங்கள்

source: generate the diff in raw format
ta: மூல வடிவத்தில் வேறுபாட்டை உருவாக்குங்கள்

source: synonym for '-p --raw'
ta: '-p --raw' க்கு ஒத்த பெயர்

source: synonym for '-p --stat'
ta: '-p --stat' க்கு ஒத்த பெயர்

source: machine friendly --stat
ta: இயந்திர நட்பு --stat

source: output only the last line of --stat
ta: --stat இன் கடைசி வரி மட்டுமே வெளியீடு

source: output the distribution of relative amount of changes for each sub-directory
ta: ஒவ்வொரு துணை அடைவுக்கும் மாற்றங்களின் ஒப்பீட்டு அளவு வழங்கல்

source: synonym for --dirstat=cumulative
ta: --dirstat=cumulative ஒத்த பெயர்

source: synonym for --dirstat=files,<param1>,<param2>...
ta: --dirstat=files,<param1>, <param2>... க்கான ஒத்த பெயர்

source: warn if changes introduce conflict markers or whitespace errors
ta: மாற்றங்கள் மோதல் குறிப்பான்கள் அல்லது இடைவெளி பிழைகளை அறிமுகப்படுத்தினால் எச்சரிக்கவும்

source: condensed summary such as creations, renames and mode changes
ta: படைப்புகள், மறுபெயரிடங்கள் மற்றும் பயன்முறை மாற்றங்கள் போன்ற அமுக்கப்பட்ட சுருக்கம்

source: show only names of changed files
ta: மாற்றப்பட்ட கோப்புகளின் பெயர்களை மட்டுமே காட்டுங்கள்

source: show only names and status of changed files
ta: மாற்றப்பட்ட கோப்புகளின் பெயர்களையும் நிலையையும் மட்டுமே காட்டுங்கள்

source: <width>[,<name-width>[,<count>]]
ta: <அகலம்> [, <பெயர் அகல> [, <count>]]

source: generate diffstat
ta: டிஃப்ச்டாட்டை உருவாக்குங்கள்

source: <width>
ta: <அகலம்>

source: generate diffstat with a given width
ta: கொடுக்கப்பட்ட அகலத்துடன் டிஃப்ச்டாட்டை உருவாக்குங்கள்

source: generate diffstat with a given name width
ta: கொடுக்கப்பட்ட பெயர் அகலத்துடன் டிஃப்ச்டாட்டை உருவாக்குங்கள்

source: generate diffstat with a given graph width
ta: கொடுக்கப்பட்ட வரைபட அகலத்துடன் டிஃப்ச்டாட்டை உருவாக்கவும்

source: <count>
ta: <எண்ணி>

source: generate diffstat with limited lines
ta: வரையறுக்கப்பட்ட கோடுகளுடன் டிஃப்ச்டாட்டை உருவாக்கவும்

source: generate compact summary in diffstat
ta: டிஃப்ச்டாட்டில் சிறிய சுருக்கத்தை உருவாக்குங்கள்

source: output a binary diff that can be applied
ta: பயன்படுத்தக்கூடிய பைனரி வேறுபாடு

source: show full pre- and post-image object names on the "index" lines
ta: "குறியீட்டு" வரிகளில் முழு முன் மற்றும் பிந்தைய பட பொருள் பெயர்களைக் காட்டுங்கள்

source: show colored diff
ta: வண்ண வேறுபாட்டைக் காட்டு

source: <kind>
ta: <வகையான>

source: highlight whitespace errors in the 'context', 'old' or 'new' lines in the diff
ta: வேறுபாட்டில் 'சூழல்', 'பழைய' அல்லது 'புதிய' வரிகளில் இடைவெளிகளை முன்னிலைப்படுத்தவும்

source: do not munge pathnames and use NULs as output field terminators in --raw or --numstat
ta: பாதைப் பெயர்களைப் பற்றிக் கொள்ளாதீர்கள் மற்றும் --raw அல்லது --numstat இல் NULs ஐ வெளியீட்டு புலம் டெர்மினேட்டர்களாகப் பயன்படுத்துங்கள்

source: <prefix>
ta: <முன்னொட்டு>

source: show the given source prefix instead of "a/"
ta: "a/" என்பதற்கு பதிலாக கொடுக்கப்பட்ட மூல முன்னொட்டைக் காட்டுங்கள்

source: show the given destination prefix instead of "b/"
ta: "பி/" க்கு பதிலாக கொடுக்கப்பட்ட இலக்கு முன்னொட்டைக் காட்டுங்கள்

source: prepend an additional prefix to every line of output
ta: வெளியீட்டின் ஒவ்வொரு வரிக்கும் கூடுதல் முன்னொட்டை ஆயத்தம் செய்யுங்கள்

source: do not show any source or destination prefix
ta: எந்த மூல அல்லது இலக்கு முன்னொட்டையும் காட்ட வேண்டாம்

source: use default prefixes a/ and b/
ta: இயல்புநிலை முன்னொட்டுகளைப் பயன்படுத்தவும்/ மற்றும் b/

source: show context between diff hunks up to the specified number of lines
ta: குறிப்பிட்ட எண்ணிக்கையிலான வரிகள் வரை வேறுபட்ட அங்குகளுக்கு இடையில் சூழலைக் காட்டுங்கள்

source: <char>
ta: <சார்>

source: specify the character to indicate a new line instead of '+'
ta: '+' க்கு பதிலாக புதிய வரியைக் குறிக்க எழுத்தைக் குறிப்பிடவும்

source: specify the character to indicate an old line instead of '-'
ta: '-' என்பதற்கு பதிலாக பழைய வரியைக் குறிக்க பாத்திரத்தைக் குறிப்பிடவும்

source: specify the character to indicate a context instead of ' '
ta: '' க்கு பதிலாக ஒரு சூழலைக் குறிக்க பாத்திரத்தைக் குறிப்பிடவும்

source: Diff rename options
ta: வேறுபாடு மறுபெயரிடுதல் விருப்பங்கள்

source: break complete rewrite changes into pairs of delete and create
ta: முழுமையான மாற்றங்களை நீக்குதல் சோடிகளாக மாற்றவும், உருவாக்கவும்

source: detect renames
ta: மறுபெயரிட்டுக் கண்டறியவும்

source: omit the preimage for deletes
ta: நீக்குவதற்கான முன்னுரிமையைத் தவிர்க்கவும்

source: detect copies
ta: நகல்களைக் கண்டறியவும்

source: use unmodified files as source to find copies
ta: நகல்களைக் கண்டுபிடிக்க மாற்றப்படாத கோப்புகளை ஆதாரமாகப் பயன்படுத்தவும்

source: disable rename detection
ta: மறுபெயரிடுதல் கண்டறிதல் முடக்கு

source: use empty blobs as rename source
ta: மறுபெயரிடு மூலமாக வெற்று குமிழ்களைப் பயன்படுத்தவும்

source: continue listing the history of a file beyond renames
ta: மறுபெயரிட முடியாத ஒரு கோப்பின் வரலாற்றை பட்டியலிடுவதைத் தொடரவும்

source: prevent rename/copy detection if the number of rename/copy targets exceeds given limit
ta: மறுபெயரிட/நகல் கண்டறிதலைத் தடுக்கவும் மறுபெயரிடு/நகல் இலக்குகளின் எண்ணிக்கை கொடுக்கப்பட்ட வரம்பை மீறுகிறது

source: Diff algorithm options
ta: வேறுபட்ட வழிமுறை விருப்பங்கள்

source: produce the smallest possible diff
ta: சாத்தியமான சிறிய வேறுபாட்டை உருவாக்குங்கள்

source: ignore whitespace when comparing lines
ta: வரிகளை ஒப்பிடும் போது இடைவெளியை புறக்கணி

source: ignore changes in amount of whitespace
ta: இடைவெளியின் அளவின் மாற்றங்களை புறக்கணி

source: ignore changes in whitespace at EOL
ta: eol இல் இடைவெளியின் மாற்றங்களை புறக்கணி

source: ignore carrier-return at the end of line
ta: வரியின் முடிவில் கேரியர்-திரும்புவதை புறக்கணி

source: ignore changes whose lines are all blank
ta: அதன் வரிகள் அனைத்தும் காலியாக இருக்கும் மாற்றங்களை புறக்கணி

source: <regex>
ta: <ரீசெக்ச்>

source: ignore changes whose all lines match <regex>
ta: எல்லா வரிகளும் <ரீசெக்ச்> உடன் பொருந்தக்கூடிய மாற்றங்களை புறக்கணி

source: heuristic to shift diff hunk boundaries for easy reading
ta: எளிதான வாசிப்புக்கு வேறுபட்ட அங்க் எல்லைகளை மாற்றுவதற்கான ஊரிச்டிக்

source: generate diff using the "patience diff" algorithm
ta: "பொறுமை வேறுபாடு" வழிமுறையைப் பயன்படுத்தி வேறுபாட்டை உருவாக்குங்கள்

source: generate diff using the "histogram diff" algorithm
ta: "இச்டோகிராம் டிஃப்" வழிமுறையைப் பயன்படுத்தி வேறுபாட்டை உருவாக்குங்கள்

source: <text>
ta: <உரை>

source: generate diff using the "anchored diff" algorithm
ta: "நங்கூரமிட்ட வேறுபாடு" வழிமுறையைப் பயன்படுத்தி வேறுபாட்டை உருவாக்குங்கள்

source: <mode>
ta: <பயன்முறை>

source: show word diff, using <mode> to delimit changed words
ta: மாற்றப்பட்ட சொற்களை வரையறுக்க <பயன்முறையைப் பயன்படுத்தி சொல் வேறுபாட்டைக் காட்டு

source: use <regex> to decide what a word is
ta: ஒரு சொல் என்றால் என்ன என்பதை தீர்மானிக்க <ரீசெக்ச்> ஐப் பயன்படுத்தவும்

source: equivalent to --word-diff=color --word-diff-regex=<regex>
ta: --word-diff=color --word-diff-regex=<வழக்கவெளி> க்கு சமம்

source: moved lines of code are colored differently
ta: குறியீட்டின் நகர்த்தப்பட்ட வரிகள் வித்தியாசமாக வண்ணமயமானவை

source: how white spaces are ignored in --color-moved
ta: --color-moved இல் வெள்ளை இடங்கள் எவ்வாறு புறக்கணிக்கப்படுகின்றன

source: Other diff options
ta: பிற வேறுபாடு விருப்பங்கள்

source: when run from subdir, exclude changes outside and show relative paths
ta: subdir இலிருந்து இயங்கும் போது, வெளியில் மாற்றங்களை விலக்கி, உறவினர் பாதைகளைக் காட்டுங்கள்

source: treat all files as text
ta: எல்லா கோப்புகளையும் உரையாக கருதுங்கள்

source: swap two inputs, reverse the diff
ta: இரண்டு உள்ளீடுகளை மாற்றவும், வேறுபாட்டை மாற்றவும்

source: exit with 1 if there were differences, 0 otherwise
ta: வேறுபாடுகள் இருந்தால் 1 உடன் வெளியேறவும், இல்லையெனில் 0

source: disable all output of the program
ta: நிரலின் அனைத்து வெளியீட்டையும் முடக்கு

source: allow an external diff helper to be executed
ta: வெளிப்புற வேறுபாடு உதவியாளரை செயல்படுத்த அனுமதிக்கவும்

source: run external text conversion filters when comparing binary files
ta: பைனரி கோப்புகளை ஒப்பிடும் போது வெளிப்புற உரை மாற்று வடிப்பான்களை இயக்கவும்

source: <when>
ta: <போது>

source: ignore changes to submodules in the diff generation
ta: வேறுபட்ட தலைமுறையில் துணைதொகுதிகளுக்கான மாற்றங்களை புறக்கணி

source: <format>
ta: <வடிவம்>

source: specify how differences in submodules are shown
ta: துணைதொகுதிகளில் உள்ள வேறுபாடுகள் எவ்வாறு காட்டப்படுகின்றன என்பதைக் குறிப்பிடவும்

source: hide 'git add -N' entries from the index
ta: குறியீட்டிலிருந்து 'அறிவிலி சேர் -என்' உள்ளீடுகளை மறைக்கவும்

source: treat 'git add -N' entries as real in the index
ta: குறியீட்டில் 'அறிவிலி சேர் -என்' உள்ளீடுகளை உண்மையானதாக நடத்துங்கள்

source: look for differences that change the number of occurrences of the specified string
ta: குறிப்பிட்ட சரத்தின் நிகழ்வுகளின் எண்ணிக்கையை மாற்றும் வேறுபாடுகளைத் தேடுங்கள்

source: look for differences that change the number of occurrences of the specified regex
ta: குறிப்பிட்ட ரீசெக்சின் நிகழ்வுகளின் எண்ணிக்கையை மாற்றும் வேறுபாடுகளைத் தேடுங்கள்

source: show all changes in the changeset with -S or -G
ta: -s அல்லது -g உடன் மாற்றங்களில் உள்ள அனைத்து மாற்றங்களையும் காட்டுங்கள்

source: treat <string> in -S as extended POSIX regular expression
ta: நீட்டிக்கப்பட்ட posix வழக்கமான வெளிப்பாடாக <string> இல் சிகிச்சையளிக்கவும்

source: control the order in which files appear in the output
ta: வெளியீட்டில் கோப்புகள் தோன்றும் வரிசையை கட்டுப்படுத்தவும்

source: <path>
ta: <பாதை>

source: show the change in the specified path first
ta: குறிப்பிட்ட பாதையில் மாற்றத்தை முதலில் காட்டு

source: skip the output to the specified path
ta: குறிப்பிட்ட பாதைக்கு வெளியீட்டைத் தவிர்க்கவும்

source: <object-id>
ta: <பொருள்-அடையாளம்>

source: look for differences that change the number of occurrences of the specified object
ta: குறிப்பிட்ட பொருளின் நிகழ்வுகளின் எண்ணிக்கையை மாற்றும் வேறுபாடுகளைத் தேடுங்கள்

source: [(A|C|D|M|R|T|U|X|B)...[*]]
ta: [(a | c | டி | m | r | t | உ | ஃச் | b) ... [*]]

source: select files by diff type
ta: டிஃப் வகை மூலம் கோப்புகளைத் தேர்ந்தெடுக்கவும்

source: <file>
ta: <கோப்பு>

source: output to a specific file
ta: ஒரு குறிப்பிட்ட கோப்பிற்கு வெளியீடு

source: exhaustive rename detection was skipped due to too many files.
ta: அதிகமான கோப்புகள் காரணமாக முழுமையான மறுபெயரிடுதல் கண்டறிதல் தவிர்க்கப்பட்டது.

source: only found copies from modified paths due to too many files.
ta: அதிகமான கோப்புகள் காரணமாக மாற்றியமைக்கப்பட்ட பாதைகளிலிருந்து மட்டுமே நகல்கள் கிடைத்தன.

source: you may want to set your %s variable to at least %d and retry the command.
ta: உங்கள் %s மாறியை குறைந்தபட்சம் %d ஆக அமைத்து கட்டளையை மீண்டும் முயற்சிக்க விரும்பலாம்.

source: failed to read orderfile '%s'
ta: ஆர்டர்ஃபைல் '%s' ஐப் படிக்கத் தவறிவிட்டது

source: Performing inexact rename detection
ta: துல்லியமாக மறுபெயரிடுதல் கண்டறிதல்

source: No such path '%s' in the diff
ta: வேறுபாட்டில் அத்தகைய பாதை '%s' இல்லை

source: pathspec '%s' did not match any file(s) known to git
ta: பாதைகுறிப்பு '%s' அறிவிலி அறியப்பட்ட எந்த கோப்பையும் (கள்) பொருந்தவில்லை

source: unrecognized pattern: '%s'
ta: அங்கீகரிக்கப்படாத முறை: '%s'

source: unrecognized negative pattern: '%s'
ta: அங்கீகரிக்கப்படாத எதிர்மறை முறை: '%s'

source: your sparse-checkout file may have issues: pattern '%s' is repeated
ta: உங்கள் சிதறிய-சோதனை கோப்பில் சிக்கல்கள் இருக்கலாம்: முறை '%s' மீண்டும் மீண்டும் செய்யப்படுகிறது

source: disabling cone pattern matching
ta: கூம்பு முறை பொருத்தத்தை முடக்குதல்

source: cannot use %s as an exclude file
ta: %s ஐ விலக்கு கோப்பாக பயன்படுத்த முடியாது

source: failed to get kernel name and information
ta: கர்னல் பெயர் மற்றும் தகவல்களைப் பெறுவதில் தோல்வி

source: untracked cache is disabled on this system or location
ta: இந்த அமைப்பு அல்லது இருப்பிடத்தில் கட்டுப்படுத்தப்படாத தற்காலிக சேமிப்பு முடக்கப்பட்டுள்ளது

source: No directory name could be guessed. Please specify a directory on the command line
ta: எந்த அடைவு பெயரையும் யூகிக்க முடியவில்லை. கட்டளை வரியில் ஒரு கோப்பகத்தைக் குறிப்பிடவும்

source: index file corrupt in repo %s
ta: ரெப்போ %s இல் குறியீட்டு கோப்பு ஊழல்

source: could not create directories for %s
ta: %s க்கான கோப்பகங்களை உருவாக்க முடியவில்லை

source: could not migrate git directory from '%s' to '%s'
ta: அறிவிலி கோப்பகத்தை '%s' இலிருந்து '%s' க்கு மாற்ற முடியவில்லை

source: hint: Waiting for your editor to close the file...%c
ta: குறிப்பு: உங்கள் எடிட்டர் கோப்பை மூடுவதற்கு காத்திருக்கிறது ...%c

source: could not write to '%s'
ta: '%s' க்கு எழுத முடியவில்லை

source: could not edit '%s'
ta: '%s' திருத்த முடியவில்லை

source: Filtering content
ta: உள்ளடக்கத்தை வடிகட்டுதல்

source: could not stat file '%s'
ta: '%s' ச்டேட் கோப்பு

source: bad git namespace path "%s"
ta: மோசமான அறிவிலி பெயர்வெளி பாதை "%s"

source: too many args to run %s
ta: %s இயக்க பல ஆர்க்ச்

source: git fetch-pack: expected shallow list
ta: git fetch-pack: எதிர்பார்க்கப்படும் ஆழமற்ற பட்டியல்

source: git fetch-pack: expected a flush packet after shallow list
ta: git fetch-pack: ஆழமற்ற பட்டியலுக்குப் பிறகு ஒரு பறிப்பு பாக்கெட்டை எதிர்பார்க்கலாம்

source: git fetch-pack: expected ACK/NAK, got a flush packet
ta: git fetch-pack: எதிர்பார்க்கப்படும் ack/nak, ஒரு பறிப்பு பாக்கெட் கிடைத்தது

source: git fetch-pack: expected ACK/NAK, got '%s'
ta: git fetch-pack: எதிர்பார்க்கப்படும் ack/nak, கிடைத்தது '%s'

source: unable to write to remote
ta: தொலைதூரத்திற்கு எழுத முடியவில்லை

source: Server supports filter
ta: சேவையகம் வடிகட்டியை ஆதரிக்கிறது

source: invalid shallow line: %s
ta: தவறான ஆழமற்ற வரி: %s

source: invalid unshallow line: %s
ta: தவறான அன்சல்லோ வரி: %s

source: object not found: %s
ta: பொருள் கிடைக்கவில்லை: %s

source: error in object: %s
ta: பொருளில் பிழை: %s

source: no shallow found: %s
ta: ஆழமற்ற எதுவும் இல்லை: %s

source: expected shallow/unshallow, got %s
ta: எதிர்பார்க்கப்படும் மேலோட்டமான/அன்சல்லோ, கிடைத்தது %s

source: got %s %d %s
ta: %s %d %s கிடைத்தது

source: invalid commit %s
ta: தவறான உறுதி %s

source: giving up
ta: கொடுப்பது

source: done
ta: முடிந்தது

source: got %s (%d) %s
ta: கிடைத்தது %s ( %d) %s

source: Marking %s as complete
ta: %s ஐக் குறிக்கும்

source: already have %s (%s)
ta: ஏற்கனவே %s ( %s) உள்ளது

source: fetch-pack: unable to fork off sideband demultiplexer
ta: ஃபெட்ச்-கட்டு: பக்கப்பட்டி டெமுல்டிப்ளெக்சரை முடக்க முடியவில்லை

source: protocol error: bad pack header
ta: நெறிமுறை பிழை: மோசமான கட்டு தலைப்பு

source: fetch-pack: unable to fork off %s
ta: ஃபெட்ச்-கட்டு: %s ஐ முடக்க முடியவில்லை

source: fetch-pack: invalid index-pack output
ta: ஃபெட்ச்-கட்டு: தவறான குறியீட்டு-கட்டு வெளியீடு

source: %s failed
ta: %s தோல்வியடைந்தன

source: error in sideband demultiplexer
ta: பக்கப்பட்டி டெமுல்டிப்ளெக்சரில் பிழை

source: Server version is %.*s
ta: சேவையக பதிப்பு %.*s

source: Server supports %s
ta: சேவையகம் %s ஐ ஆதரிக்கிறது

source: Server does not support shallow clients
ta: சேவையகம் ஆழமற்ற வாடிக்கையாளர்களை ஆதரிக்காது
