Repository: Nizhal/git-ta-po
Catalog: po/*.po
Languages: ta

source: Cannot rewrite branches: You have unstaged changes.
ta: கிளைகளை மீண்டும் எழுத முடியாது: உங்களிடம் நிலையற்ற மாற்றங்கள் உள்ளன.

source: Cannot $action: You have unstaged changes.
ta: முடியாது $action: உங்களிடம் நிலையற்ற மாற்றங்கள் உள்ளன.

source: Cannot $action: Your index contains uncommitted changes.
ta: முடியாது $action: உங்கள் குறியீட்டில் சேர்க்கப்படாத மாற்றங்கள் உள்ளன.

source: Additionally, your index contains uncommitted changes.
ta: கூடுதலாக, உங்கள் குறியீட்டில் சேர்க்கப்படாத மாற்றங்கள் உள்ளன.

source: You need to run this command from the toplevel of the working tree.
ta: இந்த கட்டளையை நீங்கள் பணி மரத்தின் டோப்லெவலிலிருந்து இயக்க வேண்டும்.

source: Unable to determine absolute path of git directory
ta: அறிவிலி கோப்பகத்தின் முழுமையான பாதையை தீர்மானிக்க முடியவில்லை

source: local zone differs from GMT by a non-minute interval
ta: உள்ளக மண்டலம் gmt இலிருந்து நிமிடமற்ற இடைவெளியால் வேறுபடுகிறது

source: local time offset greater than or equal to 24 hours
ta: உள்ளக நேரம் 24 மணிநேரத்தை விட அதிகமாகவோ அல்லது சமமாகவோ ஈடுசெய்யும்

source: fatal: command '%s' died with exit code %d
ta: அபாயகரமான: கட்டளை '%s' வெளியேறும் குறியீடு %d உடன் இறந்தது

source: the editor exited uncleanly, aborting everything
ta: ஆசிரியர் அசுத்தமாக வெளியேறினார், எல்லாவற்றையும் கருக்கலைப்பு செய்தார்

source: '%s' contains an intermediate version of the email you were composing.
ta: '%s' நீங்கள் இசையமைத்த மின்னஞ்சலின் இடைநிலை பதிப்பைக் கொண்டுள்ளது.

source: '%s.final' contains the composed email.
ta: '%s.final' இசையமைக்கப்பட்ட மின்னஞ்சலைக் கொண்டுள்ளது.

source: --dump-aliases incompatible with other options
ta: --dump-aliases மற்ற விருப்பங்களுடன் பொருந்தாது

source: fatal: found configuration options for 'sendmail' git-send-email is configured with the sendemail.* options - note the 'e'. Set sendemail.forbidSendmailVariables to false to disable this check.
ta: அபாயகரமான: 'sendmail' க்கான உள்ளமைவு விருப்பங்கள் கிடைத்தன git-send-email அனுப்பப்பட்டவை மூலம் கட்டமைக்கப்பட்டுள்ளது.* விருப்பங்கள்-'e' ஐக் கவனியுங்கள். இந்த காசோலையை முடக்க false க்கு sendemail.forbidSendmailVariables ஐ அமைக்கவும்.

source: Cannot run git format-patch from outside a repository
ta: ஒரு களஞ்சியத்திற்கு வெளியில் இருந்து git format-patch ஐ இயக்க முடியாது

source: `batch-size` and `relogin` must be specified together (via command-line or configuration option)
ta: `batch-size` மற்றும் `relogin` ஒன்றாக குறிப்பிடப்பட வேண்டும் (கட்டளை-வரி அல்லது உள்ளமைவு விருப்பம் வழியாக)

source: Unknown --suppress-cc field: '%s'
ta: தெரியாத --suppress-cc புலம்: '%s'

source: Unknown --confirm setting: '%s'
ta: தெரியாத --confirm அமைப்புகள் '%s'

source: warning: sendmail alias with quotes is not supported: %s
ta: முன்னறிவிப்பு: மேற்கோள்களுடன் sendmail மாற்றுப்பெயர் ஆதரிக்கப்படவில்லை: %s

source: warning: `:include:` not supported: %s
ta: முன்னறிவிப்பு: `: அடங்கும்:` ஆதரிக்கப்படவில்லை: %s

source: warning: `/file` or `|pipe` redirection not supported: %s
ta: முன்னறிவிப்பு: `/file` அல்லது` | குழாய்` திசைதிருப்பல் ஆதரிக்கப்படவில்லை: %s

source: warning: sendmail line is not recognized: %s
ta: முன்னறிவிப்பு: செண்ட்மெயில் வரி அங்கீகரிக்கப்படவில்லை: %s

source: File '%s' exists but it could also be the range of commits to produce patches for. Please disambiguate by... * Saying "./%s" if you mean a file; or * Giving --format-patch option if you mean a range.
ta: '%s' கோப்பு உள்ளது, ஆனால் இது உறுதிடுகளின் வரம்பாகவும் இருக்கலாம் திட்டுகளை உருவாக்க. தயவுசெய்து தயவுசெய்து ... * நீங்கள் ஒரு கோப்பைக் குறிக்கிறீர்கள் என்றால் "./%s" என்று சொல்வது; அல்லது * கொடுப்பது --format-patch நீங்கள் ஒரு வரம்பைக் குறிக்கிறீர்கள் என்றால்.

source: Failed to opendir %s: %s
ta: opendir %s: %s இல் தோல்வியுற்றது

source: No patch files specified!
ta: ஒட்டு கோப்புகள் எதுவும் குறிப்பிடப்படவில்லை!

source: No subject line in %s?
ta: %s இல் பொருள் வரி இல்லையா?

source: Failed to open for writing %s: %s
ta: %s: %s எழுதுவதற்கு திறக்கத் தவறிவிட்டது

source: Lines beginning in "GIT:" will be removed. Consider including an overall diffstat or table of contents for the patch you are writing. Clear the body content if you don't wish to send a summary.
ta: "கிட்:" இல் தொடங்கும் வரிகள் அகற்றப்படும். ஒட்டுமொத்த டிஃப்ச்டாட் அல்லது உள்ளடக்க அட்டவணை உள்ளிட்டவற்றைக் கவனியுங்கள் பேட்சிற்கு நீங்கள் எழுதுகிறீர்கள். நீங்கள் ஒரு சுருக்கத்தை அனுப்ப விரும்பவில்லை என்றால் உடல் உள்ளடக்கத்தை அழிக்கவும்.

source: Failed to open %s.final: %s
ta: %s.final ஐ திறக்கத் தவறிவிட்டது: %s

source: Failed to open %s: %s
ta: %s ஐ திறக்கத் தவறிவிட்டது: %s

source: Summary email is empty, skipping it
ta: சுருக்கம் மின்னஞ்சல் காலியாக உள்ளது, அதைத் தவிர்க்கிறது

source: Are you sure you want to use <%s> [y/N]?
ta: நீங்கள் <%s> ஐப் பயன்படுத்த விரும்புகிறீர்களா? [y/N]

source: The following files are 8bit, but do not declare a Content-Transfer-Encoding.
ta: பின்வரும் கோப்புகள் 8 இருமம், ஆனால் உள்ளடக்க-பரிமாற்ற-குறியாக்கத்தை அறிவிக்க வேண்டாம்.

source: Which 8bit encoding should I declare [UTF-8]?
ta: எந்த 8 இருமம் குறியாக்கத்தை நான் அறிவிக்க வேண்டும் [utf-8]?

source: Refusing to send because the patch %s has the template subject '*** SUBJECT HERE ***'. Pass --force if you really want to send.
ta: ஒட்டு என்பதால் அனுப்ப மறுக்கிறது %s வார்ப்புரு பொருள் '*** இங்கே பொருள் ***'. நீங்கள் உண்மையிலேயே அனுப்ப விரும்பினால் பாச் --force.

source: To whom should the emails be sent (if anyone)?
ta: மின்னஞ்சல்களை யாருக்கு அனுப்ப வேண்டும் (யாராவது இருந்தால்)?

source: fatal: alias '%s' expands to itself
ta: அபாயகரமானது: மாற்றுப்பெயர் '%s' தனக்குத்தானே விரிவடைகிறது

source: Message-ID to be used as In-Reply-To for the first email (if any)?
ta: முதல் மின்னஞ்சலுக்கான (ஏதேனும் இருந்தால்)-க்கு-பதில் என செய்தி-அடையாளம் பயன்படுத்தப்பட வேண்டுமா?

source: error: unable to extract a valid address from: %s
ta: பிழை: சரியான முகவரியைப் பிரித்தெடுக்க முடியவில்லை: %s

source: What to do with this address? ([q]uit|[d]rop|[e]dit):
ta: இந்த முகவரியை என்ன செய்வது? ([q]வெளியேறு|[d]கைவிடு|[e]திருத்து):

source: CA path "%s" does not exist
ta: சாஅ பாதை "%s" இல்லை

source: The Cc list above has been expanded by additional addresses found in the patch commit message. By default send-email prompts before sending whenever this occurs. This behavior is controlled by the sendemail.confirm configuration setting. For additional information, run 'git send-email --help'. To retain the current behavior, but squelch this message, run 'git config --global sendemail.confirm auto'.
ta: மேலே உள்ள நகல் பட்டியல் கூடுதல் மூலம் விரிவாக்கப்பட்டுள்ளது ஒட்டு செய்த செய்தியில் காணப்படும் முகவரிகள். இயல்பாக இது நிகழும் போதெல்லாம் அனுப்புவதற்கு முன் அனுப்பு-எமெயில் தூண்டுகிறது. இந்த நடத்தை sendemail.confirm ஆல் கட்டுப்படுத்தப்படுகிறது உள்ளமைவு அமைப்பு. கூடுதல் தகவலுக்கு, 'git send-email --help' இயக்கவும். தற்போதைய நடத்தையைத் தக்கவைக்க, ஆனால் இந்த செய்தியைக் குறைத்தல், 'git config --global sendemail.confirm auto' ஐ இயக்கவும்.

source: Send this email? ([y]es|[n]o|[e]dit|[q]uit|[a]ll):
ta: இந்த மின்னஞ்சலை அனுப்பவா? ([y]ஆம்|[n]இல்|[e]திருத்து|[q]வெளியேறு|[a]அனைத்தும்):

source: Send this email reply required
ta: இந்த மின்னஞ்சல் பதிலை அனுப்பவும்

source: The required SMTP server is not properly defined.
ta: தேவையான அஞ்சலக சேவையகம் சரியாக வரையறுக்கப்படவில்லை.

source: Server does not support STARTTLS! %s
ta: காப்புதுவக்கத்தை சேவையகம் ஆதரிக்காது! %s

source: STARTTLS failed! %s
ta: காப்புதுவக்கம் தோல்வியுற்றது! %s

source: Unable to initialize SMTP properly. Check config and use --smtp-debug.
ta: அஞ்சலகத்தை சரியாக துவக்க முடியவில்லை. கட்டமைப்பைச் சரிபார் மற்றும், --smtp-debug பயன்படுத்து.

source: Failed to send %s
ta: %s அனுப்புவதில் தோல்வி

source: Result:
ta: விளைவு:

source: can't open file %s
ta: கோப்பு %s ஐ திறக்க முடியாது

source: (mbox) Adding cc: %s from line '%s'
ta: (அபெட்டி) சேர்க்கிறது நகல்: %s வரி '%s' இருந்து

source: (mbox) Adding to: %s from line '%s'
ta: (அபெட்டி) சேர்க்கிறது பெறுநர்: %s வரி '%s' இருந்து

source: (non-mbox) Adding cc: %s from line '%s'
ta: (அபெட்டியல்லாத) சேர்க்கிறது நகல்: %s வரி '%s' இருந்து

source: (body) Adding cc: %s from line '%s'
ta: (உடல்) சேர்க்கிறது நகல்: %s வரி '%s' இருந்து

source: (%s) Could not execute '%s'
ta: (%s) '%s' ஐ செயல்படுத்த முடியவில்லை

source: (%s) Malformed output from '%s'
ta: (%s) தவறான வெளியீடு '%s' இலிருந்து

source: (%s) failed to close pipe to '%s'
ta: (%s) குழாயை '%s' என்று மூடுவதில் தோல்வியுற்றது

source: (%s) Adding %s: %s from: '%s'
ta: (%s) சேர்க்கிறது %s: %s இலிருந்து: '%s'

source: cannot send message as 7bit
ta: 7இருமம் என செய்தியை அனுப்ப முடியாது

source: invalid transfer encoding
ta: தவறான பரிமாற்ற குறியாக்கம்

source: fatal: %s: rejected by %s hook %s warning: no patches were sent
ta: அபாயகரமான: %s: %s கொக்கி மூலம் நிராகரிக்கப்பட்டது %s முன்னறிவிப்பு: திட்டுகள் எதுவும் அனுப்பப்படவில்லை

source: unable to open %s: %s
ta: %s ஐ திறக்க முடியவில்லை: %s

source: fatal: %s:%d is longer than 998 characters warning: no patches were sent
ta: அபாயகரமான: %s:%d என்பது 998 எழுத்துக்களை விட நீளமானது முன்னறிவிப்பு: திட்டுகள் எதுவும் அனுப்பப்படவில்லை

source: Skipping %s with backup suffix '%s'.
ta: காப்புப்பிரதி பின்னொட்டு '%s' உடன் %s ஐத் தவிர்க்கிறது.

source: Do you really want to send %s? [y|N]:
ta: நீங்கள் உண்மையில் %s அனுப்ப விரும்புகிறீர்களா? [y|N]:
