Repository: Nizhal/git-ta-po
Catalog: po/*.po
Languages: ta

source: object directory containing set of packfile and pack-index pairs
ta: பேக்ஃபைல் மற்றும் கட்டு-இன்டெக்ச் சோடிகளின் தொகுப்பைக் கொண்ட பொருள் அடைவு

source: preferred-pack
ta: விருப்பமான-கட்டு

source: pack for reuse when computing a multi-pack bitmap
ta: மல்டி கட்டு பிட்மேப்பைக் கணக்கிடும்போது மறுபயன்பாட்டிற்கு கட்டு செய்யுங்கள்

source: write multi-pack bitmap
ta: மல்டி கட்டு பிட்மேப்பை எழுதுங்கள்

source: write multi-pack index containing only given indexes
ta: கொடுக்கப்பட்ட குறியீடுகளை மட்டுமே கொண்ட மல்டி கட்டு குறியீட்டை எழுதுங்கள்

source: refs snapshot for selecting bitmap commits
ta: பிட்மேப் உறுதிடுகளைத் தேர்ந்தெடுப்பதற்கான ச்னாப்சாட்

source: during repack, collect pack-files of smaller size into a batch that is larger than this size
ta: மறுபிரவேசத்தின் போது, சிறிய அளவிலான கட்டு-கோப்புகளை இந்த அளவை விட பெரிய தொகுப்பில் சேகரிக்கவும்

source: Directory %s is in index and no submodule?
ta: அடைவு %s குறியீட்டில் உள்ளன, துணைதொகுதி அல்லவா?

source: Please stage your changes to .gitmodules or stash them to proceed
ta: தயவுசெய்து உங்கள் மாற்றங்களை .gitmodules க்கு அரங்கேற்றவும் அல்லது தொடரவும்

source: %.*s is in index
ta: %.*s குறியீட்டில் உள்ளன

source: force move/rename even if target exists
ta: இலக்கு இருந்தபோதும் படை நகர்வு/மறுபெயரிடுதல்

source: skip move/rename errors
ta: நகர்த்துவதைத் தவிர்க்கவும்/பிழைகள் மறுபெயரிடவும்

source: destination '%s' is not a directory
ta: இலக்கு '%s' ஒரு அடைவு அல்ல

source: Checking rename of '%s' to '%s'
ta: '%s' இன் மறுபெயரிட்டை '%s' க்கு சரிபார்க்கிறது

source: bad source
ta: மோசமான மூல

source: destination exists
ta: இலக்கு உள்ளது

source: can not move directory into itself
ta: கோப்பகத்தை தனக்குள் நகர்த்த முடியாது

source: destination already exists
ta: இலக்கு ஏற்கனவே உள்ளது

source: source directory is empty
ta: மூல அடைவு காலியாக உள்ளது

source: not under version control
ta: பதிப்பு கட்டுப்பாட்டின் கீழ் இல்லை

source: conflicted
ta: சண்டையிட்டனர்

source: overwriting '%s'
ta: '%s' ஐ மேலெழுதும்

source: Cannot overwrite
ta: மேலெழுத முடியாது

source: multiple sources for the same target
ta: ஒரே இலக்குக்கான பல ஆதாரங்கள்

source: destination directory does not exist
ta: இலக்கு அடைவு இல்லை

source: destination exists in the index
ta: குறியீட்டில் இலக்கு உள்ளது

source: %s, source=%s, destination=%s
ta: %s, மூல =%s, இலக்கு =%s

source: Renaming %s to %s
ta: %s க்கு %s க்கு மறுபெயரிடுதல்

source: renaming '%s' failed
ta: '%s' என மறுபெயரிடுவது தோல்வியடைந்தது

source: git name-rev [<options>] <commit>...
ta: git name-rev [<விருப்பங்கள்>] < உறுதி> ...

source: git name-rev [<options>] --all
ta: git name-rev [<விருப்பங்கள்>] --all

source: git name-rev [<options>] --annotate-stdin
ta: git name-rev [<விருப்பங்கள்>] --annotate-stdin

source: print only ref-based names (no object names)
ta: ref- அடிப்படையிலான பெயர்களை மட்டும் அச்சிடுக (பொருள் பெயர்கள் இல்லை)

source: only use tags to name the commits
ta: உறுதிடுகளுக்கு பெயரிட குறிச்சொற்களை மட்டுமே பயன்படுத்தவும்

source: only use refs matching <pattern>
ta: பொருந்தும் <முறை> மட்டுமே பயன்படுத்தவும்

source: ignore refs matching <pattern>
ta: பொருத்துதல் <முறை> ஐ புறக்கணி

source: list all commits reachable from all refs
ta: எல்லா குறிப்புகளிலிருந்தும் அடையக்கூடிய அனைத்தையும் பட்டியலிடுங்கள்

source: deprecated: use --annotate-stdin instead
ta: நீக்கப்பட்டது: அதற்கு பதிலாக --annotate-stdin ஐப் பயன்படுத்துங்கள்

source: annotate text from stdin
ta: stdin இலிருந்து உரையை சிறுகுறிப்பு செய்யுங்கள்

source: allow to print `undefined` names (default)
ta: `வரையறுக்கப்படாத` பெயர்களை (இயல்புநிலை) அச்சிட அனுமதிக்கவும்

source: dereference tags in the input (internal use)
ta: உள்ளீட்டில் உள்ள குறிச்சொற்கள் (உள் பயன்பாடு)

source: git notes [--ref <notes-ref>] [list [<object>]]
ta: அறிவிலி குறிப்புகள் [--ref <குறிப்புகள்-ref>] [பட்டியல் [<பொருள்>]]

source: git notes [--ref <notes-ref>] copy [-f] <from-object> <to-object>
ta: git குறிப்புகள் [--ref <குறிப்புகள்-குறி>] நகல்

source: git notes [--ref <notes-ref>] edit [--allow-empty] [<object>]
ta: git notes [--ref <குறிப்புகள்-ref>] திருத்து [--allow-empty] [<பொருள்>]

source: git notes [--ref <notes-ref>] show [<object>]
ta: git notes [--ref <குறிப்புகள்-குறி>] காட்டு [<பொருள்>]

source: git notes [--ref <notes-ref>] merge [-v | -q] [-s <strategy>] <notes-ref>
ta: git notes [--ref <குறிப்புகள்-ref>] ஒன்றிணைக்கவும் [-v | -q] [-s <மூலோபாயம்>] <குறிப்புகள்-ரெஃப்>

source: git notes [--ref <notes-ref>] remove [<object>...]
ta: அறிவிலி குறிப்புகள் [--ref <குறிப்புகள்-ref>] அகற்று [<பொருள்> ...]

source: git notes [--ref <notes-ref>] prune [-n] [-v]
ta: அறிவிலி குறிப்புகள் [--ref <குறிப்புகள்-ref>] ப்ரூன் [-n] [-v]

source: git notes [--ref <notes-ref>] get-ref
ta: அறிவிலி குறிப்புகள் [--ref <குறிப்புகள்-ரெஃப்>] கெட்-ரெஃப்

source: git notes [list [<object>]]
ta: அறிவிலி குறிப்புகள் [பட்டியல் [<பொருள்>]]

source: git notes add [<options>] [<object>]
ta: git குறிப்புகள் சேர்க்கவும் [<atomet>] [<பொருள்>]

source: git notes copy [<options>] <from-object> <to-object>
ta: git குறிப்புகள் நகலெடுக்கவும் [<atomet>] <இலிருந்து-பொருள்> <to-object>

source: git notes copy --stdin [<from-object> <to-object>]...
ta: git குறிப்புகள் நகலெடு --stdin [<பொருளிலிருந்து> <பொருளுக்கு>] ...

source: git notes append [<options>] [<object>]
ta: git குறிப்புகள் apend [<விருப்பங்கள்>] [<பொருள்>]

source: git notes edit [<object>]
ta: அறிவிலி குறிப்புகள் திருத்து [<பொருள்>]

source: git notes show [<object>]
ta: அறிவிலி குறிப்புகள் காட்டுகின்றன [<பொருள்>]

source: git notes merge [<options>] <notes-ref>
ta: git குறிப்புகள் ஒன்றிணைக்கவும் [<விருப்பங்கள்>] <குறிப்புகள்-ரெஃப்>

source: git notes merge --commit [<options>]
ta: அறிவிலி குறிப்புகள் ஒன்றிணைத்தல் --commit [<விருப்பங்கள்>]

source: git notes merge --abort [<options>]
ta: அறிவிலி குறிப்புகள் ஒன்றிணைக்க --abort [<விருப்பங்கள்>]

source: git notes remove [<object>]
ta: அறிவிலி குறிப்புகள் அகற்றவும் [<பொருள்>]

source: git notes prune [<options>]
ta: அறிவிலி குறிப்புகள் ப்ரூன் [<விருப்பங்கள்>]

source: Write/edit the notes for the following object:
ta: பின்வரும் பொருளுக்கான குறிப்புகளை எழுத/திருத்தவும்:

source: could not read 'show' output
ta: 'சோ' வெளியீட்டை படிக்க முடியவில்லை

source: failed to finish 'show' for object '%s'
ta: பொருள் '%s' க்கான 'சோ' முடிக்கத் தவறிவிட்டது

source: please supply the note contents using either -m or -F option
ta: -m அல்லது -f விருப்பத்தைப் பயன்படுத்தி குறிப்பு உள்ளடக்கங்களை வழங்கவும்

source: unable to write note object
ta: குறிப்பு பொருளை எழுத முடியவில்லை

source: the note contents have been left in %s
ta: குறிப்பு உள்ளடக்கங்கள் %s இல் விடப்பட்டுள்ளன

source: could not open or read '%s'
ta: '%s' திறக்கவோ படிக்கவோ முடியவில்லை

source: failed to resolve '%s' as a valid ref.
ta: செல்லுபடியாகும் ref ஆக '%s' ஐ தீர்க்கத் தவறிவிட்டது.

source: failed to read object '%s'.
ta: பொருள் '%s' படிக்கத் தவறிவிட்டது.

source: cannot read note data from non-blob object '%s'.
ta: இருமபெபொ அல்லாத பொருள் '%s' இலிருந்து குறிப்பு தரவைப் படிக்க முடியாது.

source: failed to copy notes from '%s' to '%s'
ta: '%s' இலிருந்து '%s' க்கு குறிப்புகளை நகலெடுப்பதில் தோல்வி

source: refusing to %s notes in %s (outside of refs/notes/)
ta: %s குறிப்புகளை %s இல் மறுக்கிறது (refs/notes/ க்கு வெளியே)

source: no note found for object %s.
ta: பொருள் %s க்கு எந்த குறிப்பும் கிடைக்கவில்லை.

source: note contents as a string
ta: உள்ளடக்கங்களை ஒரு சரமாக கவனியுங்கள்

source: note contents in a file
ta: ஒரு கோப்பில் உள்ளடக்கங்களை கவனியுங்கள்

source: reuse and edit specified note object
ta: குறிப்பிட்ட குறிப்பு பொருளை மீண்டும் பயன்படுத்தவும் திருத்தவும்

source: reuse specified note object
ta: குறிப்பிட்ட குறிப்பு பொருளை மறுபயன்பாடு செய்யுங்கள்

source: allow storing empty note
ta: வெற்று குறிப்பை சேமிக்க அனுமதிக்கவும்

source: replace existing notes
ta: இருக்கும் குறிப்புகளை மாற்றவும்

source: <paragraph-break>
ta: <பத்தி-முறிவு>

source: insert <paragraph-break> between paragraphs
ta: பத்திகளுக்கு இடையில் <பத்தி-பிரேக்> செருகவும்

source: remove unnecessary whitespace
ta: தேவையற்ற இடைவெளியை அகற்று

source: Cannot add notes. Found existing notes for object %s. Use '-f' to overwrite existing notes
ta: குறிப்புகளைச் சேர்க்க முடியாது. பொருள் %s க்கான ஏற்கனவே உள்ள குறிப்புகளைக் கண்டறிந்தது. இருக்கும் குறிப்புகளை மேலெழுத '-f' ஐப் பயன்படுத்தவும்

source: Overwriting existing notes for object %s
ta: பொருள் %s க்கான இருக்கும் குறிப்புகளை மேலெழுதும்

source: Removing note for object %s
ta: பொருள் %s க்கான குறிப்பை நீக்குதல்

source: read objects from stdin
ta: stdin இலிருந்து பொருள்களைப் படியுங்கள்

source: load rewriting config for <command> (implies --stdin)
ta: <கட்டளை> க்கான மீண்டும் எழுதும் கட்டமைப்பை ஏற்றவும் (--stdin குறிக்கிறது)

source: too few arguments
ta: மிகக் குறைவான வாதங்கள்

source: Cannot copy notes. Found existing notes for object %s. Use '-f' to overwrite existing notes
ta: குறிப்புகளை நகலெடுக்க முடியாது. பொருள் %s க்கான ஏற்கனவே உள்ள குறிப்புகளைக் கண்டறிந்தது. இருக்கும் குறிப்புகளை மேலெழுத '-f' ஐப் பயன்படுத்தவும்

source: missing notes on source object %s. Cannot copy.
ta: மூல பொருள் %s இல் குறிப்புகளைக் காணவில்லை. நகலெடுக்க முடியாது.

source: The -m/-F/-c/-C options have been deprecated for the 'edit' subcommand. Please use 'git notes add -f -m/-F/-c/-C' instead.
ta: -m/-f/-c/-c விருப்பங்கள் 'திருத்து' துணைக் கட்டளைக்கு நீக்கப்பட்டுள்ளன. அதற்கு பதிலாக 'git குறிப்புகள் கூட்டு -f -m/-f/-c/-c' ஐப் பயன்படுத்தவும்.

source: failed to delete ref NOTES_MERGE_PARTIAL
ta: ref NOTES_MERGE_PARTIAL நீக்குவதில் தோல்வி

source: failed to delete ref NOTES_MERGE_REF
ta: ref NOTES_MERGE_REF நீக்குவதில் தோல்வி

source: failed to remove 'git notes merge' worktree
ta: 'அறிவிலி குறிப்புகள் ஒன்றிணைக்க' பணிநீக்கத்தை அகற்றுவதில் தோல்வி

source: failed to read ref NOTES_MERGE_PARTIAL
ta: ref NOTES_MERGE_PARTIAL படிக்கத் தவறிவிட்டது

source: could not find commit from NOTES_MERGE_PARTIAL.
ta: NOTES_MERGE_PARTIAL ஆகியவற்றிலிருந்து உறுதிப்பாட்டைக் கண்டுபிடிக்க முடியவில்லை.

source: could not parse commit from NOTES_MERGE_PARTIAL.
ta: NOTES_MERGE_PARTIAL இருந்து அர்ப்பணிக்க முடியவில்லை.

source: failed to resolve NOTES_MERGE_REF
ta: NOTES_MERGE_REF தீர்க்கத் தவறிவிட்டது

source: failed to finalize notes merge
ta: குறிப்புகள் ஒன்றிணைக்கத் தவறிவிட்டன

source: unknown notes merge strategy %s
ta: அறியப்படாத குறிப்புகள் ஒன்றிணை நெறுமுறை %s

source: General options
ta: பொது விருப்பங்கள்

source: Merge options
ta: விருப்பங்களை ஒன்றிணைக்கவும்

source: resolve notes conflicts using the given strategy (manual/ours/theirs/union/cat_sort_uniq)
ta: கொடுக்கப்பட்ட மூலோபாயத்தைப் பயன்படுத்தி குறிப்புகள் மோதல்களைத் தீர்க்கவும் (கையேடு/நம்முடைய/அவர்களுடைய/யூனியன்/cat_sort_uniq)

source: Committing unmerged notes
ta: அவிழ்க்கப்பட்ட குறிப்புகளைச் செய்தல்

source: finalize notes merge by committing unmerged notes
ta: குறிப்புகளை முடிக்கவும், அவிழ்க்கப்பட்ட குறிப்புகளைச் செய்வதன் மூலம் ஒன்றிணைக்கவும்

source: Aborting notes merge resolution
ta: கருக்கலைப்பு குறிப்புகள் தீர்மானத்தை ஒன்றிணைக்கின்றன

source: abort notes merge
ta: கருக்கலைப்பு குறிப்புகள் ஒன்றிணைக்கவும்

source: cannot mix --commit, --abort or -s/--strategy
ta: --commit, --abort அல்லது -s/--strategy ஐ கலக்க முடியாது

source: must specify a notes ref to merge
ta: ஒன்றிணைக்க குறிப்புகள் ரெஃப் குறிப்பிட வேண்டும்

source: unknown -s/--strategy: %s
ta: தெரியாத -s/--strategy: %s

source: a notes merge into %s is already in-progress at %s
ta: ஒரு குறிப்புகள் %s இல் ஒன்றிணைகின்றன, ஏற்கனவே %s இல் முன்னேற்றம் உள்ளது

source: failed to store link to current notes ref (%s)
ta: தற்போதைய குறிப்புகள் ref (%s) உடன் இணைப்பை சேமிப்பதில் தோல்வி

source: Automatic notes merge failed. Fix conflicts in %s and commit the result with 'git notes merge --commit', or abort the merge with 'git notes merge --abort'.
ta: தானியங்கி குறிப்புகள் ஒன்றிணைந்தன. %s இல் மோதல்களை சரிசெய்து, 'git notes merge --commit' மூலம் முடிவை செய்யுங்கள் அல்லது 'git notes merge --abort'உடன் ஒன்றிணைக்கவும்.

source: Failed to resolve '%s' as a valid ref.
ta: செல்லுபடியாகும் ref ஆக '%s' ஐ தீர்க்கத் தவறிவிட்டது.

source: Object %s has no note
ta: பொருள் %s எந்த குறிப்பும் இல்லை

source: attempt to remove non-existent note is not an error
ta: இல்லாத குறிப்பை அகற்ற முயற்சிப்பது பிழை அல்ல

source: read object names from the standard input
ta: நிலையான உள்ளீட்டிலிருந்து பொருள் பெயர்களைப் படியுங்கள்

source: do not remove, show only
ta: அகற்ற வேண்டாம், காட்டவும்

source: report pruned notes
ta: கத்தரிக்கப்பட்ட குறிப்புகள் அறிக்கை

source: notes-ref
ta: குறிப்புகள்-ரெஃப்

source: use notes from <notes-ref>
ta: <குறிப்புகள்-ரெஃப்> இலிருந்து குறிப்புகளைப் பயன்படுத்தவும்

source: unknown subcommand: `%s'
ta: அறியப்படாத துணைக் கட்டளை: `%s '

source: git pack-objects --stdout [<options>] [< <ref-list> | < <object-list>]
ta: git pack-objects --stdout [<விருப்பங்கள்>] [< <குறி-பட்டியல்> | < <பொருள்-பட்டியல்>]

source: git pack-objects [<options>] <base-name> [< <ref-list> | < <object-list>]
ta: git pack-objects [<விருப்பங்கள்>] <அடிப்படை-பெயர்> [< <குறி-பட்டியல்> | < <பொருள்-பட்டியல்>]

source: write_reuse_object: could not locate %s, expected at offset %<PRIuMAX> in pack %s
ta: எழுது_மறுபயன்_பொருள்: %s ஐக் கண்டுபிடிக்க முடியவில்லை, ஆஃப்செட் %<PRIuMAX> இல் %s கட்டு எதிர்பார்க்கப்படுகிறது.

source: bad packed object CRC for %s
ta: %s க்கு மோசமான நிரம்பிய பொருள் crc

source: corrupt packed object for %s
ta: %s க்கு ஊழல் நிறைந்த நிரம்பிய பொருள்

source: recursive delta detected for object %s
ta: பொருள் %s க்கு சுழல்நிலை டெல்டா கண்டறியப்பட்டது

source: ordered %u objects, expected %<PRIu32>
ta: ஆர்டர் செய்யப்பட்ட %u பொருள்கள், எதிர்பார்க்கப்படும் %<PRIu32>

source: expected object at offset %<PRIuMAX> in pack %s
ta: ஆஃப்செட் %<PRIuMAX> கட்டு %s இல் எதிர்பார்க்கப்படும் பொருள்

source: disabling bitmap writing, packs are split due to pack.packSizeLimit
ta: பிட்மேப் எழுத்தை முடக்குதல், pack.packSizeLimit காரணமாக பொதிகள் பிரிக்கப்படுகின்றன

source: Writing objects
ta: பொருள்களை எழுதுதல்

source: failed to stat %s
ta: stat %s இல் தோல்வியுற்றது

source: failed utime() on %s
ta: %s இல் தோல்வியுற்ற utime ()

source: failed to write bitmap index
ta: பிட்மேப் குறியீட்டை எழுதுவதில் தோல்வி

source: wrote %<PRIu32> objects while expecting %<PRIu32>
ta: %<PRIu32> பொருள்களை %<PRIu32> எதிர்பார்க்கும்போது எழுதினார்

source: disabling bitmap writing, as some objects are not being packed
ta: பிட்மேப் எழுத்தை முடக்குவது, சில பொருள்கள் நிரம்பியிருக்கவில்லை என்பதால்

source: delta base offset overflow in pack for %s
ta: டெல்டா பேச் ஆஃப்செட் %s க்கு பேக்கில் வழிதல்

source: delta base offset out of bound for %s
ta: டெல்டா பேச் %s க்கு கட்டுப்பட்டது

source: Counting objects
ta: பொருள்களை எண்ணுதல்

source: unable to get size of %s
ta: %s அளவைப் பெற முடியவில்லை

source: unable to parse object header of %s
ta: %s இன் பொருள் தலைப்பை அலச முடியவில்லை

source: object %s cannot be read
ta: பொருள் %s படிக்க முடியாது

source: object %s inconsistent object length (%<PRIuMAX> vs %<PRIuMAX>)
ta: பொருள் %s சீரற்ற பொருள் நீளம் ( %<PRIuMAX> vs %<PRIuMAX>)

source: suboptimal pack - out of memory
ta: சப்டோப்டிமல் கட்டு - நினைவகத்திற்கு வெளியே

source: Delta compression using up to %d threads
ta: %d நூல்களைப் பயன்படுத்தி டெல்டா சுருக்க

source: unable to pack objects reachable from tag %s
ta: குறிச்சொல் %s இலிருந்து அடையக்கூடிய பொருள்களை கட்டு செய்ய முடியவில்லை

source: unable to get type of object %s
ta: பொருள் வகை %s பெற முடியவில்லை

source: Compressing objects
ta: பொருள்களை சுருக்கவும்

source: inconsistency with delta count
ta: டெல்டா எண்ணிக்கையுடன் முரண்பாடு

source: invalid pack.allowPackReuse value: '%s'
ta: தவறான கட்டு.அலோ பேக்ரூச் மதிப்பு: '%s'

source: value of uploadpack.blobpackfileuri must be of the form '<object-hash> <pack-hash> <uri>' (got '%s')
ta: uploadpack.blobpackfileuri இன் மதிப்பு '<பொருள்-ஆச்> <கட்டு-ஆச்> <uri>' (கிடைத்தது '%s') வடிவத்தில் இருக்க வேண்டும்

source: object already configured in another uploadpack.blobpackfileuri (got '%s')
ta: ஏற்கனவே மற்றொரு uploadpack.blobpackfileuri இல் கட்டமைக்கப்பட்ட பொருள் ('%s' கிடைத்தது)

source: could not get type of object %s in pack %s
ta: கட்டு %s இல் பொருள் %s வகை பெற முடியவில்லை

source: could not find pack '%s'
ta: கட்டு '%s' கண்டுபிடிக்க முடியவில்லை

source: packfile %s cannot be accessed
ta: பேக்ஃபைல் %s அணுக முடியாது

source: Enumerating cruft objects
ta: க்ரூஃப்ட் பொருள்களைக் கணக்கிடுதல்

source: unable to add cruft objects
ta: க்ரூஃப்ட் பொருள்களைச் சேர்க்க முடியவில்லை

source: Traversing cruft objects
ta: க்ரூஃப்ட் பொருள்களைக் கடந்து செல்கிறது

source: expected edge object ID, got garbage: %s
ta: எதிர்பார்க்கப்படும் எட்ச் பொருள் அடையாளம், குப்பை கிடைத்தது: %s

source: expected object ID, got garbage: %s
ta: எதிர்பார்க்கப்படும் பொருள் அடையாளம், குப்பை கிடைத்தது: %s

source: could not load cruft pack .mtimes
ta: க்ரூஃப்ட் பேக்கை ஏற்ற முடியவில்லை .எம்டைம்ச்

source: cannot open pack index
ta: கட்டு குறியீட்டை திறக்க முடியாது

source: loose object at %s could not be examined
ta: %s இல் தளர்வான பொருளை ஆராய முடியவில்லை

source: unable to force loose object
ta: தளர்வான பொருளை கட்டாயப்படுத்த முடியவில்லை

source: not a rev '%s'
ta: ஒரு ரெவ் '%s' அல்ல

source: bad revision '%s'
ta: மோசமான திருத்தம் '%s'

source: unable to add recent objects
ta: அண்மைக் கால பொருள்களைச் சேர்க்க முடியவில்லை

source: unsupported index version %s
ta: ஆதரிக்கப்படாத குறியீட்டு பதிப்பு %s

source: bad index version '%s'
ta: மோசமான குறியீட்டு பதிப்பு '%s'

source: show progress meter during object writing phase
ta: பொருள் எழுதும் கட்டத்தின் போது முன்னேற்ற மீட்டரைக் காட்டு

source: similar to --all-progress when progress meter is shown
ta: முன்னேற்ற மீட்டர் காட்டப்படும் போது --all-progress ஐப் போன்றது

source: <version>[,<offset>]
ta: <பதிப்பு> [, <offset>]

source: write the pack index file in the specified idx format version
ta: குறிப்பிட்ட ஐடிஎக்ச் வடிவமைப்பு பதிப்பில் கட்டு குறியீட்டு கோப்பை எழுதுங்கள்

source: maximum size of each output pack file
ta: ஒவ்வொரு வெளியீட்டு கட்டு கோப்பின் அதிகபட்ச அளவு

source: ignore borrowed objects from alternate object store
ta: மாற்று பொருள் கடையிலிருந்து கடன் வாங்கிய பொருட்களை புறக்கணி

source: ignore packed objects
ta: நிரம்பிய பொருட்களை புறக்கணி

source: limit pack window by objects
ta: பொருள்களால் கட்டு சாளரத்தைக் கட்டுப்படுத்துங்கள்

source: limit pack window by memory in addition to object limit
ta: பொருள் வரம்புக்கு கூடுதலாக கட்டு சாளரத்தை நினைவகம் மூலம் கட்டுப்படுத்தவும்

source: maximum length of delta chain allowed in the resulting pack
ta: இதன் விளைவாக வரும் பேக்கில் அனுமதிக்கப்பட்ட டெல்டா சங்கிலியின் அதிகபட்ச நீளம்

source: reuse existing deltas
ta: இருக்கும் டெல்டாக்களை மீண்டும் பயன்படுத்தவும்

source: reuse existing objects
ta: இருக்கும் பொருள்களை மீண்டும் பயன்படுத்தவும்

source: use OFS_DELTA objects
ta: OFS_DELTA பொருள்களைப் பயன்படுத்துதல்

source: use threads when searching for best delta matches
ta: சிறந்த டெல்டா போட்டிகளைத் தேடும்போது நூல்களைப் பயன்படுத்தவும்

source: do not create an empty pack output
ta: வெற்று கட்டு வெளியீட்டை உருவாக்க வேண்டாம்

source: read revision arguments from standard input
ta: நிலையான உள்ளீட்டிலிருந்து திருத்த வாதங்களைப் படியுங்கள்

source: limit the objects to those that are not yet packed
ta: இன்னும் கட்டு செய்யப்படாதவர்களுக்கு பொருள்களைக் கட்டுப்படுத்துங்கள்

source: include objects reachable from any reference
ta: எந்தவொரு குறிப்பிலிருந்தும் அடையக்கூடிய பொருள்களைச் சேர்க்கவும்

source: include objects referred by reflog entries
ta: பிரதிபலிப்பு உள்ளீடுகளால் குறிப்பிடப்படும் பொருள்களைச் சேர்க்கவும்

source: include objects referred to by the index
ta: குறியீட்டால் குறிப்பிடப்படும் பொருள்களைச் சேர்க்கவும்

source: read packs from stdin
ta: stdin இலிருந்து பொதிகளைப் படியுங்கள்

source: output pack to stdout
ta: வெளியீட்டு கட்டு முதல் stdout

source: include tag objects that refer to objects to be packed
ta: நிரம்ப வேண்டிய பொருள்களைக் குறிக்கும் குறிச்சொல் பொருள்களைச் சேர்க்கவும்

source: keep unreachable objects
ta: அணுக முடியாத பொருள்களை வைத்திருங்கள்

source: pack loose unreachable objects
ta: தளர்வான அணுக முடியாத பொருள்களைக் கட்டவும்

source: unpack unreachable objects newer than <time>
ta: <time> ஐ விட புதியதைத் திறக்க முடியாத பொருள்களைத் திறக்கவும்

source: create a cruft pack
ta: ஒரு க்ரூஃப்ட் பேக்கை உருவாக்கவும்

source: expire cruft objects older than <time>
ta: <time> ஐ விட பழைய க்ரூஃப்ட் பொருள்களை காலாவதியாகுங்கள்

source: use the sparse reachability algorithm
ta: சிதறிய அணுகல் வழிமுறையைப் பயன்படுத்தவும்

source: create thin packs
ta: மெல்லிய பொதிகளை உருவாக்கவும்

source: create packs suitable for shallow fetches
ta: ஆழமற்ற பெறுவதற்கு ஏற்ற பேக்கை உருவாக்கவும்

source: ignore packs that have companion .keep file
ta: தோழர் .கீப் கோப்பு கொண்ட பொதிகளை புறக்கணி

source: ignore this pack
ta: இந்த பேக்கை புறக்கணி

source: pack compression level
ta: சுருக்க நிலை கட்டு

source: do not hide commits by grafts
ta: ஒட்டுண்ணிகளால் உறுதிடுகளை மறைக்க வேண்டாம்

source: use a bitmap index if available to speed up counting objects
ta: எண்ணும் பொருள்களை விரைவுபடுத்துவதற்கு பிட்மேப் குறியீட்டைப் பயன்படுத்தவும்

source: write a bitmap index together with the pack index
ta: கட்டு குறியீட்டுடன் ஒரு பிட்மேப் குறியீட்டை எழுதுங்கள்

source: write a bitmap index if possible
ta: முடிந்தால் பிட்மேப் குறியீட்டை எழுதுங்கள்

source: handling for missing objects
ta: காணாமல் போன பொருள்களைக் கையாளுதல்

source: do not pack objects in promisor packfiles
ta: promisor பேக்ஃபைல்களில் பொருட்களை கட்டு செய்ய வேண்டாம்

source: respect islands during delta compression
ta: டெல்டா சுருக்கத்தின் போது தீவுகளை மதிக்கவும்

source: protocol
ta: நெறிமுறை

source: exclude any configured uploadpack.blobpackfileuri with this protocol
ta: இந்த நெறிமுறையுடன் எந்த கட்டமைக்கப்பட்ட uploadpack.blobpackfileuri விலக்கவும்

source: delta chain depth %d is too deep, forcing %d
ta: டெல்டா சங்கிலி ஆழம் %d மிகவும் ஆழமானது, %d கட்டாயப்படுத்துகிறது

source: pack.deltaCacheLimit is too high, forcing %d
ta: pack.deltaCacheLimit மிக அதிகமாக உள்ளது, %d கட்டாயப்படுத்துகிறது

source: bad pack compression level %d
ta: மோசமான கட்டு சுருக்க நிலை %d

source: --max-pack-size cannot be used to build a pack for transfer
ta: --max-pack-size பரிமாற்றத்திற்காக ஒரு பேக்கை உருவாக்க பயன்படுத்த முடியாது

source: minimum pack size limit is 1 MiB
ta: குறைந்தபட்ச கட்டு அளவு வரம்பு 1 mib ஆகும்

source: --thin cannot be used to build an indexable pack
ta: --thin குறியீட்டு செய்யக்கூடிய பேக்கை உருவாக்க தின் பயன்படுத்த முடியாது

source: cannot use --filter with --stdin-packs
ta: --stdin-packs உடன் --filter ஐப் பயன்படுத்த முடியாது

source: cannot use internal rev list with --stdin-packs
ta: --stdin-packs உடன் உள் ரெவ் பட்டியலைப் பயன்படுத்த முடியாது

source: cannot use internal rev list with --cruft
ta: --cruft உடன் உள் ரெவ் பட்டியலைப் பயன்படுத்த முடியாது

source: cannot use --stdin-packs with --cruft
ta: --cruft உடன் --stdin-packs ஐப் பயன்படுத்த முடியாது

source: Enumerating objects
ta: பொருள்களைக் கணக்கிடுதல்

source: Total %<PRIu32> (delta %<PRIu32>), reused %<PRIu32> (delta %<PRIu32>), pack-reused %<PRIu32> (from %<PRIuMAX>)
ta: மொத்தம் %<PRIu32> (டெல்டா %<PRIu32>), மீண்டும் பயன்படுத்தப்பட்டது %<PRIu32> (டெல்டா %<PRIu32>), கட்டு-மறுபிரசுரம் %<PRIu32> ( %<PRIuMAX> இலிருந்து)

source: 'git pack-redundant' is nominated for removal. If you still use this command, please add an extra option, '--i-still-use-this', on the command line and let us know you still use it by sending an e-mail to <git@vger.kernel.org>. Thanks.
ta: 'git pack-redundant' அகற்றுவதற்கு பரிந்துரைக்கப்பட்டுள்ளது. நீங்கள் இன்னும் இந்த கட்டளையைப் பயன்படுத்தினால், தயவுசெய்து கூடுதல் சேர்க்கவும் விருப்பம், '--i-still-use-this', கட்டளை வரியில் ஒரு மின்னஞ்சல் அனுப்புவதன் மூலம் நீங்கள் அதைப் பயன்படுத்துகிறீர்கள் என்பதை எங்களுக்குத் தெரியப்படுத்துங்கள் பெறுநர் <git@vger.kernel.org>. நன்றி.

source: refusing to run without --i-still-use-this
ta: --i-still-use-this இல்லாமல் ஓட மறுக்கிறது

source: pack everything
ta: எல்லாவற்றையும் கட்டு செய்யுங்கள்

source: prune loose refs (default)
ta: தளர்வான குறிப்புகள் (இயல்புநிலை)

source: references to include
ta: சேர்க்க வேண்டிய குறிப்புகள்
