Repository: Nizhal/git-ta-po
Catalog: po/*.po
Languages: ta

source: renamed a misnamed branch '%s' away
ta: தவறாக பெயரிடப்பட்ட கிளை '%s' தொலைவில் மறுபெயரிடப்பட்டது

source: branch renamed to %s, but HEAD is not updated
ta: கிளை %s என மறுபெயரிடப்பட்டது, ஆனால் தலை புதுப்பிக்கப்படவில்லை

source: branch is renamed, but update of config-file failed
ta: கிளை மறுபெயரிடப்பட்டது, ஆனால் கட்டமைப்பு-கோப்பின் புதுப்பிப்பு தோல்வியடைந்தது

source: branch is copied, but update of config-file failed
ta: கிளை நகலெடுக்கப்பட்டது, ஆனால் கட்டமைப்பு-கோப்பின் புதுப்பிப்பு தோல்வியடைந்தது

source: Generic options
ta: பொதுவான விருப்பங்கள்

source: show hash and subject, give twice for upstream branch
ta: ஆச் மற்றும் பொருளைக் காட்டு, மேலோடை கிளைக்கு இரண்டு முறை கொடுங்கள்

source: suppress informational messages
ta: செய்தி செய்திகளை அடக்கவும்

source: set branch tracking configuration
ta: கிளை கண்காணிப்பு உள்ளமைவை அமைக்கவும்

source: do not use
ta: பயன்படுத்த வேண்டாம்

source: upstream
ta: மேலோடை

source: change the upstream info
ta: மேலோடை தகவலை மாற்றவும்

source: unset the upstream info
ta: மேலோடை தகவலை அமைக்கவும்

source: use colored output
ta: வண்ண வெளியீட்டைப் பயன்படுத்தவும்

source: act on remote-tracking branches
ta: தொலை கண்காணிப்பு கிளைகளில் செயல்படுங்கள்

source: print only branches that contain the commit
ta: உறுதிப்பாட்டைக் கொண்ட கிளைகளை மட்டும் அச்சிடுங்கள்

source: print only branches that don't contain the commit
ta: உறுதிப்பாட்டைக் கொண்டிருக்காத கிளைகளை மட்டும் அச்சிடுங்கள்

source: Specific git-branch actions:
ta: குறிப்பிட்ட git-branch செயல்கள்:

source: list both remote-tracking and local branches
ta: தொலை-கண்காணிப்பு மற்றும் உள்ளக கிளைகள் இரண்டையும் பட்டியலிடுங்கள்

source: delete fully merged branch
ta: முழுமையாக இணைக்கப்பட்ட கிளையை நீக்கு

source: delete branch (even if not merged)
ta: கிளையை நீக்கு (ஒன்றிணைக்கப்படாவிட்டாலும் கூட)

source: move/rename a branch and its reflog
ta: ஒரு கிளையையும் அதன் பிரதிபலிப்பையும் நகர்த்தவும்/மறுபெயரிடவும்

source: move/rename a branch, even if target exists
ta: இலக்கு இருந்தாலும், ஒரு கிளையை நகர்த்தவும்/மறுபெயரிடவும்

source: do not output a newline after empty formatted refs
ta: வெற்று வடிவமைக்கப்பட்ட குறிப்புகளுக்குப் பிறகு ஒரு புதிய வரியை வெளியிட வேண்டாம்

source: copy a branch and its reflog
ta: ஒரு கிளை மற்றும் அதன் பிரதிபலிப்பை நகலெடுக்கவும்

source: copy a branch, even if target exists
ta: இலக்கு இருந்தாலும் ஒரு கிளையை நகலெடுக்கவும்

source: list branch names
ta: கிளை பெயர்களை பட்டியலிடுங்கள்

source: show current branch name
ta: தற்போதைய கிளை பெயரைக் காட்டு

source: create the branch's reflog
ta: கிளையின் பிரதிபலிப்பை உருவாக்கவும்

source: edit the description for the branch
ta: கிளைக்கான விளக்கத்தைத் திருத்தவும்

source: force creation, move/rename, deletion
ta: படை உருவாக்கம், நகர்த்த/மறுபெயரிடுதல், நீக்குதல்

source: print only branches that are merged
ta: ஒன்றிணைக்கப்பட்ட கிளைகளை மட்டும் அச்சிடுங்கள்

source: print only branches that are not merged
ta: ஒன்றிணைக்கப்படாத கிளைகளை மட்டும் அச்சிடுங்கள்

source: list branches in columns
ta: நெடுவரிசைகளில் கிளைகளை பட்டியலிடுங்கள்

source: object
ta: பொருள்

source: print only branches of the object
ta: பொருளின் கிளைகளை மட்டும் அச்சிடுக

source: sorting and filtering are case insensitive
ta: வரிசையாக்கம் மற்றும் வடிகட்டுதல் ஆகியவை வழக்கு உணர்வற்றவை

source: recurse through submodules
ta: துணைதொகுதிகள் மூலம் மீண்டும் உருவாக்குங்கள்

source: format to use for the output
ta: வெளியீட்டிற்கு பயன்படுத்த வடிவமைப்பு

source: failed to resolve HEAD as a valid ref
ta: தலையை செல்லுபடியாகும் ref ஆக தீர்க்கத் தவறிவிட்டது

source: HEAD not found below refs/heads!
ta: தலை கீழே காணப்படவில்லை refs/தலைகளுக்கு!

source: branch with --recurse-submodules can only be used if submodule.propagateBranches is enabled
ta: submodule.propagateBranches இயக்கப்பட்டிருந்தால் மட்டுமே --recurse-submodules உடன் கிளை உருவாக்க முடியும்

source: --recurse-submodules can only be used to create branches
ta: கிளைகளை உருவாக்க மட்டுமே --recurse-submodules பயன்படுத்தப்பட முடியும்

source: branch name required
ta: கிளை பெயர் தேவை

source: cannot give description to detached HEAD
ta: பிரிக்கப்பட்ட தலைக்கு விளக்கத்தை கொடுக்க முடியாது

source: cannot edit description of more than one branch
ta: ஒன்றுக்கு மேற்பட்ட கிளைகளின் விளக்கத்தைத் திருத்த முடியாது

source: cannot copy the current branch while not on any
ta: எந்தவொரு கிளையையும் நகலெடுக்க முடியாது

source: cannot rename the current branch while not on any
ta: எந்தவொரு மீதும் இல்லாத நிலையில் தற்போதைய கிளையை மறுபெயரிட முடியாது

source: too many branches for a copy operation
ta: நகல் செயல்பாட்டிற்கு பல கிளைகள்

source: too many arguments for a rename operation
ta: மறுபெயரிடும் செயல்பாட்டிற்கு பல வாதங்கள்

source: too many arguments to set new upstream
ta: புதிய அப்ச்ட்ரீமை அமைக்க பல வாதங்கள்

source: could not set upstream of HEAD to %s when it does not point to any branch
ta: எந்தவொரு கிளையையும் சுட்டிக்காட்டாதபோது தலையின் மேல்நோக்கி %s வரை அமைக்க முடியவில்லை

source: no such branch '%s'
ta: அத்தகைய கிளை '%s' இல்லை

source: branch '%s' does not exist
ta: கிளை '%s' இல்லை

source: too many arguments to unset upstream
ta: அப்ச்ட்ரீமில் இணைக்க பல வாதங்கள்

source: could not unset upstream of HEAD when it does not point to any branch
ta: எந்தவொரு கிளையையும் சுட்டிக்காட்டாதபோது தலையின் மேல்நோக்கி இணைக்க முடியவில்லை

source: branch '%s' has no upstream information
ta: கிளை '%s' மேலோடை தகவல்கள் இல்லை

source: the -a, and -r, options to 'git branch' do not take a branch name. Did you mean to use: -a|-r --list <pattern>?
ta: -a, மற்றும் -r, 'git branch' விருப்பங்கள் ஒரு கிளை பெயரை எடுக்காது. நீங்கள் பயன்படுத்த வேண்டுமா: -a | -r --list <முறை>?

source: the '--set-upstream' option is no longer supported. Please use '--track' or '--set-upstream-to' instead
ta: '--set-upstream' விருப்பம் இனி ஆதரிக்கப்படாது. அதற்கு பதிலாக '--track' அல்லது '--set-upstream-to' பயன்படுத்தவும்

source: git version:
ta: அறிவிலி பதிப்பு:

source: compiler info:
ta: கம்பைலர் தகவல்:

source: libc info:
ta: லிபிசி தகவல்:

source: not run from a git repository - no hooks to show
ta: ஒரு அறிவிலி களஞ்சியத்திலிருந்து ஓடவில்லை - காட்ட கொக்கிகள் இல்லை

source: Thank you for filling out a Git bug report! Please answer the following questions to help us understand your issue. What did you do before the bug happened? (Steps to reproduce your issue) What did you expect to happen? (Expected behavior) What happened instead? (Actual behavior) What's different between what you expected and what actually happened? Anything else you want to add: Please review the rest of the bug report below. You can delete any lines you don't wish to share.
ta: அறிவிலி பிழை அறிக்கையை நிரப்பியதற்கு நன்றி! உங்கள் சிக்கலைப் புரிந்துகொள்ள எங்களுக்கு உதவ பின்வரும் கேள்விகளுக்கு பதிலளிக்கவும். பிழை நடப்பதற்கு முன்பு நீங்கள் என்ன செய்தீர்கள்? (உங்கள் சிக்கலை இனப்பெருக்கம் செய்வதற்கான படிகள்) என்ன நடக்கும் என்று எதிர்பார்த்தீர்கள்? (எதிர்பார்க்கப்படும் நடத்தை) அதற்கு பதிலாக என்ன நடந்தது? (உண்மையான நடத்தை) நீங்கள் எதிர்பார்த்த மற்றும் உண்மையில் என்ன நடந்தது என்பதற்கு இடையில் என்ன வேறுபட்டது? நீங்கள் சேர்க்க விரும்பும் வேறு எதையும்: கீழே உள்ள பிழை அறிக்கையை மதிப்பாய்வு செய்யவும். நீங்கள் பகிர விரும்பாத எந்த வரிகளையும் நீக்கலாம்.

source: mode
ta: பயன்முறை

source: create an additional zip archive of detailed diagnostics (default 'stats')
ta: விரிவான நோயறிதலின் கூடுதல் சிப் காப்பகத்தை உருவாக்கவும் (இயல்புநிலை 'புள்ளிவிவரங்கள்')

source: specify a destination for the bugreport file(s)
ta: பக்ரெதுறைமுகம் கோப்பிற்கான இலக்கைக் குறிப்பிடவும் (கள்)

source: specify a strftime format suffix for the filename(s)
ta: கோப்பு பெயர் (கள்) க்கான strftime வடிவமைப்பு பின்னொட்டைக் குறிப்பிடவும்

source: unknown argument `%s'
ta: அறியப்படாத உரையாடல் `%s '

source: could not create leading directories for '%s'
ta: '%s' க்கான முன்னணி கோப்பகங்களை உருவாக்க முடியவில்லை

source: unable to create diagnostics archive %s
ta: கண்டறிதல் காப்பக %s உருவாக்க முடியவில்லை

source: System Info
ta: கணினி செய்தி

source: Enabled Hooks
ta: இயக்கப்பட்ட கொக்கிகள்

source: unable to write to %s
ta: %s க்கு எழுத முடியவில்லை

source: Created new report at '%s'.
ta: '%s' இல் புதிய அறிக்கையை உருவாக்கியது.

source: git bundle create [-q | --quiet | --progress] [--version=<version>] <file> <git-rev-list-args>
ta: git bundle create [-q | --quiet | --progress] [--version=<பதிப்பு>] <கோப்பு> <அறிவிலி-பதிப்பு-பட்டியல்-அளவுரு>

source: git bundle verify [-q | --quiet] <file>
ta: git bundle verify [-q | --quiet] <கோப்பு>

source: git bundle list-heads <file> [<refname>...]
ta: git bundle list-heads <கோப்பு> [<குறிபெயர்>...]

source: git bundle unbundle [--progress] <file> [<refname>...]
ta: git bundle unbundle [--progress] <கோப்பு> [<குறிபெயர்>...]

source: need a <file> argument
ta: <கோப்பு> உரையாடல் தேவை

source: do not show progress meter
ta: முன்னேற்ற மீட்டரைக் காட்ட வேண்டாம்

source: show progress meter
ta: முன்னேற்ற மீட்டரைக் காட்டு

source: historical; same as --progress
ta: வரலாற்று; --progress போன்றது

source: historical; does nothing
ta: வரலாற்று; ஏதும் செய்யவில்லை

source: specify bundle format version
ta: மூட்டை வடிவமைப்பு பதிப்பைக் குறிப்பிடவும்

source: Need a repository to create a bundle.
ta: ஒரு மூட்டை உருவாக்க ஒரு களஞ்சியம் தேவை.

source: do not show bundle details
ta: மூட்டை விவரங்களைக் காட்ட வேண்டாம்

source: need a repository to verify a bundle
ta: ஒரு மூட்டை சரிபார்க்க ஒரு களஞ்சியம் தேவை

source: %s is okay
ta: %s பரவாயில்லை

source: Need a repository to unbundle.
ta: அவிழ்க்க ஒரு களஞ்சியம் தேவை.

source: Unbundling objects
ta: அபாயகரமான பொருள்கள்

source: cannot read object %s '%s'
ta: பொருள் %s '%s' ஐப் படிக்க முடியாது

source: flush is only for --buffer mode
ta: ஃப்ளச் --buffer பயன்முறைக்கு மட்டுமே

source: empty command in input
ta: உள்ளீட்டில் வெற்று கட்டளை

source: whitespace before command: '%s'
ta: கட்டளைக்கு முன் வைட்ச்பேச்: '%s'

source: %s requires arguments
ta: %s வாதங்கள் தேவை

source: %s takes no arguments
ta: %s எந்த வாதங்களையும் எடுக்கவில்லை

source: only one batch option may be specified
ta: ஒரு தொகுதி விருப்பம் மட்டுமே குறிப்பிடப்படலாம்

source: git cat-file <type> <object>
ta: git cat-file <வகை> <பொருள்>

source: git cat-file (--textconv | --filters) [<rev>:<path|tree-ish> | --path=<path|tree-ish> <rev>]
ta: git cat-file (--textconv |--filters) [<பதி>:<பாதை| மரமாக> | --path=<பாதை|மரமாக> <பதி>]]

source: Check object existence or emit object contents
ta: பொருள் இருப்பை சரிபார் அல்லது பொருள் உள்ளடக்கங்களை வெளியிடவும்

source: check if <object> exists
ta: <பொருள்> இருக்கிறதா என்று சரிபார்

source: pretty-print <object> content
ta: அழகான-அச்சு <பொருள்> உள்ளடக்கம்

source: Emit [broken] object attributes
ta: [உடைந்த] பொருள் பண்புகளை வெளியிடுங்கள்

source: show object type (one of 'blob', 'tree', 'commit', 'tag', ...)
ta: பொருள் வகையைக் காட்டு ('குமிழ்', 'மரம்', ' உறுதி', 'குறிச்சொல்', ...)

source: show object size
ta: பொருள் அளவைக் காட்டு

source: use mail map file
ta: அஞ்சல் வரைபடக் கோப்பைப் பயன்படுத்தவும்

source: Batch objects requested on stdin (or --batch-all-objects)
ta: stdin இல் கோரப்பட்ட தொகுதி பொருள்கள் (அல்லது --batch-all-objects)

source: show full <object> or <rev> contents
ta: முழு <பொருள்> அல்லது <rev> உள்ளடக்கங்களைக் காட்டு

source: like --batch, but don't emit <contents>
ta: --batch போன்றது, ஆனால் வெளியிடாது <பொருளடக்கம்>

source: stdin is NUL-terminated
ta: stdin என்பது nul- தீர்மானிக்கப்படுகிறது

source: stdin and stdout is NUL-terminated
ta: stdin மற்றும் stdout ஆகியவை nul- நிறுத்தப்படுகின்றன

source: read commands from stdin
ta: stdin இலிருந்து கட்டளைகளைப் படியுங்கள்

source: with --batch[-check]: ignores stdin, batches all known objects
ta: --batch[-check] உடன்: stdin ஐ புறக்கணிக்கிறது, அறியப்பட்ட அனைத்து பொருள்களையும் தொகுதிகள்

source: Change or optimize batch output
ta: தொகுதி வெளியீட்டை மாற்றவும் அல்லது மேம்படுத்தவும்

source: buffer --batch output
ta: இடையக --batch வெளியீடு

source: follow in-tree symlinks
ta: மரம் சிம்லிங்க்களைப் பின்தொடரவும்

source: do not order objects before emitting them
ta: பொருள்களை வெளியேற்றுவதற்கு முன் அவற்றை ஆர்டர் செய்ய வேண்டாம்

source: Emit object (blob or tree) with conversion or filter (stand-alone, or with batch)
ta: மாற்றம் அல்லது வடிப்பானுடன் (தனித்து நிற்கும், அல்லது தொகுதிகளுடன்) பொருளை (குமிழ் அல்லது மரம்) வெளியிடுங்கள்

source: run textconv on object's content
ta: பொருளின் உள்ளடக்கத்தில் textconv ஐ இயக்கவும்

source: run filters on object's content
ta: பொருளின் உள்ளடக்கத்தில் வடிப்பான்களை இயக்கவும்

source: blob|tree
ta: குமிழ் | மரம்

source: use a <path> for (--textconv | --filters); Not with 'batch'
ta: (--textconv |--filters) க்கு ஒரு <பாதை> ஐப் பயன்படுத்தவும்; 'தொகுதி' உடன் அல்ல

source: '%s=<%s>' needs '%s' or '%s'
ta: '%s = <%s>' தேவைகள் '%s' அல்லது '%s'

source: path|tree-ish
ta: பாதை | மரம்-இச்

source: '%s' requires a batch mode
ta: '%s' க்கு ஒரு தொகுதி பயன்முறை தேவை

source: '-%c' is incompatible with batch mode
ta: '-%c' தொகுதி பயன்முறையுடன் பொருந்தாது

source: batch modes take no arguments
ta: தொகுதி பயன்முறை எந்த வாதங்களையும் எடுக்காது

source: <rev> required with '%s'
ta: <ver> '%s' உடன் தேவை

source: <object> required with '-%c'
ta: <பொருள்> '-%c' உடன் தேவை

source: only two arguments allowed in <type> <object> mode, not %d
ta: <வகை> <பொருள்> பயன்முறையில் அனுமதிக்கப்பட்ட இரண்டு வாதங்கள் மட்டுமே, %d அல்ல

source: git check-attr [--source <tree-ish>] [-a | --all | <attr>...] [--] <pathname>...
ta: git check-attr [--source <மரமாக>] [-a | --all | <பண்பு> ...] [-] <பாதைபெயர்>...

source: git check-attr --stdin [-z] [--source <tree-ish>] [-a | --all | <attr>...]
ta: git check-attr --stdin [-z] [--source <மரமாக>] [-a | --all | <பண்பு>...]

source: report all attributes set on file
ta: கோப்பில் அமைக்கப்பட்ட அனைத்து பண்புகளையும் புகாரளிக்கவும்

source: use .gitattributes only from the index
ta: பயன்படுத்தவும் .gitattributes குறியீட்டிலிருந்து மட்டுமே

source: read file names from stdin
ta: stdin இலிருந்து கோப்பு பெயர்களைப் படியுங்கள்

source: terminate input and output records by a NUL character
ta: உள்ளீடு மற்றும் வெளியீட்டு பதிவுகளை ஒரு nul எழுத்துக்குறி மூலம் நிறுத்தவும்

source: <tree-ish>
ta: <ட்ரீ-இச்>

source: which tree-ish to check attributes at
ta: பண்புகளை சரிபார்க்க எந்த மரம்-இச்

source: suppress progress reporting
ta: முன்னேற்ற அறிக்கையை அடக்கவும்

source: show non-matching input paths
ta: பொருந்தாத உள்ளீட்டு பாதைகளைக் காட்டு

source: ignore index when checking
ta: சரிபார்க்கும்போது குறியீட்டை புறக்கணி

source: cannot specify pathnames with --stdin
ta: --stdin உடன் பாதை பெயர்களைக் குறிப்பிட முடியாது

source: -z only makes sense with --stdin
ta: -z --stdin உடன் மட்டுமே பொருளுள்ளதாக இருக்கிறது

source: no path specified
ta: எந்த பாதையும் குறிப்பிடப்படவில்லை

source: --quiet is only valid with a single pathname
ta: -கயிட் ஒரு பாதை பெயருடன் மட்டுமே செல்லுபடியாகும்

source: cannot have both --quiet and --verbose
ta: -கியீட் மற்றும் --verbose இரண்டையும் கொண்டிருக்க முடியாது

source: --non-matching is only valid with --verbose
ta: --non-matching என்பது --verbose உடன் மட்டுமே செல்லுபடியாகும்

source: git check-mailmap [<options>] <contact>...
ta: git check-mailmap [<விருப்பங்கள்>] <தொடர்பு> ...

source: also read contacts from stdin
ta: stdin இலிருந்து தொடர்புகளையும் படியுங்கள்

source: no contacts specified
ta: தொடர்புகள் எதுவும் குறிப்பிடப்படவில்லை

source: git checkout--worker [<options>]
ta: git checkout--worker [<விருப்பங்கள்>]

source: string
ta: சரம்

source: when creating files, prepend <string>
ta: கோப்புகளை உருவாக்கும்போது, <string> ஐத் தயாரிக்கவும்

source: git checkout-index [<options>] [--] [<file>...]
ta: git checkout-index [<விருப்பங்கள்>] [-] [<file> ...]

source: stage should be between 1 and 3 or all
ta: நிலை 1 முதல் 3 வரை இருக்க வேண்டும்

source: check out all files in the index
ta: குறியீட்டில் உள்ள அனைத்து கோப்புகளையும் பாருங்கள்

source: do not skip files with skip-worktree set
ta: ச்கிப்-வொர்க் ட்ரீ செட் மூலம் கோப்புகளைத் தவிர்க்க வேண்டாம்

source: force overwrite of existing files
ta: இருக்கும் கோப்புகளை மேலெழுதும் கட்டாயப்படுத்தவும்

source: no warning for existing files and files not in index
ta: தற்போதுள்ள கோப்புகள் மற்றும் கோப்புகளுக்கு எந்த முன்னறிவிப்புயும் குறியீட்டில் இல்லை

source: don't checkout new files
ta: புதிய கோப்புகளைப் பார்க்க வேண்டாம்

source: update stat information in the index file
ta: குறியீட்டு கோப்பில் stat தகவல்களைப் புதுப்பிக்கவும்

source: read list of paths from the standard input
ta: நிலையான உள்ளீட்டிலிருந்து பாதைகளின் பட்டியலைப் படியுங்கள்

source: write the content to temporary files
ta: தற்காலிக கோப்புகளுக்கு உள்ளடக்கத்தை எழுதுங்கள்

source: copy out the files from named stage
ta: பெயரிடப்பட்ட மேடையில் இருந்து கோப்புகளை நகலெடுக்கவும்

source: git checkout [<options>] <branch>
ta: அறிவிலி புதுப்பித்தல் [<விருப்பங்கள்>] <கிளை>

source: git checkout [<options>] [<branch>] -- <file>...
ta: git checkout [<விருப்பங்கள்>] [<கிளை>] - <file> ...

source: git switch [<options>] [<branch>]
ta: அறிவிலி சுவிட்ச் [<விருப்பங்கள்>] [<கிளை>]

source: git restore [<options>] [--source=<branch>] <file>...
ta: git மீட்டமை [<atomers>] [--source = <sblack>] <file> ...

source: path '%s' does not have our version
ta: பாதை '%s' எங்கள் பதிப்பைக் கொண்டிருக்கவில்லை

source: path '%s' does not have their version
ta: பாதை '%s' அவற்றின் பதிப்பைக் கொண்டிருக்கவில்லை

source: path '%s' does not have all necessary versions
ta: பாதை '%s' தேவையான அனைத்து பதிப்புகளையும் கொண்டிருக்கவில்லை

source: path '%s' does not have necessary versions
ta: பாதை '%s' தேவையான பதிப்புகள் இல்லை

source: path '%s': cannot merge
ta: பாதை '%s': ஒன்றிணைக்க முடியாது

source: Unable to add merge result for '%s'
ta: '%s' க்கான ஒன்றிணைப்பு முடிவைச் சேர்க்க முடியவில்லை

source: Recreated %d merge conflict
ta: மீண்டும் உருவாக்கப்பட்ட %d ஒன்றிணைந்த மோதல்

source: Updated %d path from %s
ta: %d பாதை %s இலிருந்து புதுப்பிக்கப்பட்டது

source: Updated %d path from the index
ta: குறியீட்டிலிருந்து %d பாதை புதுப்பிக்கப்பட்டது

source: '%s' cannot be used with updating paths
ta: பாதைகளை புதுப்பிப்பதன் மூலம் '%s' பயன்படுத்த முடியாது

source: Cannot update paths and switch to branch '%s' at the same time.
ta: ஒரே நேரத்தில் பாதைகளைப் புதுப்பித்து, கிளைக்கு '%s' க்கு மாற முடியாது.

source: neither '%s' or '%s' is specified
ta: '%s' அல்லது '%s' எதுவும் குறிப்பிடப்படவில்லை

source: '%s' must be used when '%s' is not specified
ta: '%s' குறிப்பிடப்படாதபோது '%s' பயன்படுத்தப்பட வேண்டும்

source: '%s' or '%s' cannot be used with %s
ta: '%s' அல்லது '%s'%s உடன் பயன்படுத்த முடியாது

source: '%s', '%s', or '%s' cannot be used when checking out of a tree
ta: ஒரு மரத்திலிருந்து வெளியேறும்போது '%s', '%s', அல்லது '%s' ஐப் பயன்படுத்த முடியாது

source: path '%s' is unmerged
ta: பாதை '%s' அவிழ்க்கப்படாதது

source: unable to read tree (%s)
ta: மரத்தைப் படிக்க முடியவில்லை (%s)

source: you need to resolve your current index first
ta: உங்கள் தற்போதைய குறியீட்டை முதலில் தீர்க்க வேண்டும்

source: cannot continue with staged changes in the following files: %s
ta: பின்வரும் கோப்புகளில் அரங்கேற்றப்பட்ட மாற்றங்களுடன் தொடர முடியாது: %s

source: Can not do reflog for '%s': %s
ta: '%s' க்கு பிரதிபலிப்பு செய்ய முடியாது: %s

source: HEAD is now at
ta: தலை இப்போது உள்ளது

source: unable to update HEAD
ta: தலையைப் புதுப்பிக்க முடியவில்லை

source: Reset branch '%s'
ta: கிளை '%s' மீட்டமைக்கவும்

source: Already on '%s'
ta: ஏற்கனவே '%s'

source: Switched to and reset branch '%s'
ta: '%s' என்ற கிளைக்கு மாற்றப்பட்டு மீட்டமைக்கவும்

source: Switched to a new branch '%s'
ta: '%s' என்ற புதிய கிளைக்கு மாறியது

source: Switched to branch '%s'
ta: கிளைக்கு மாறியது '%s'

source: ... and %d more.
ta: ... மற்றும் %d மேலும்.

source: Warning: you are leaving %d commit behind, not connected to any of your branches: %s
ta: முன்னறிவிப்பு: நீங்கள் %d ஐ விட்டுவிடுகிறீர்கள், அதனுடன் இணைக்கப்படவில்லை உங்கள் கிளைகள் ஏதேனும்: %s

source: If you want to keep it by creating a new branch, this may be a good time to do so with: git branch <new-branch-name> %s
ta: புதிய கிளையை உருவாக்குவதன் மூலம் அதை வைத்திருக்க விரும்பினால், இது ஒரு நல்ல நேரமாக இருக்கலாம் அவ்வாறு செய்ய: அறிவிலி கிளை <புதிய-கிளை-பெயர்> %s

source: internal error in revision walk
ta: திருத்த நடைப்பயணத்தில் உள் பிழை

source: Previous HEAD position was
ta: முந்தைய தலை நிலை

source: You are on a branch yet to be born
ta: நீங்கள் இன்னும் பிறக்கவில்லை

source: '%s' could be both a local file and a tracking branch. Please use -- (and optionally --no-guess) to disambiguate
ta: '%s' ஒரு உள்ளக கோப்பு மற்றும் கண்காணிப்பு கிளையாக இருக்கலாம். தயவுசெய்து பயன்படுத்தவும் -- (மற்றும் விருப்பமாக --no-guess)

source: If you meant to check out a remote tracking branch on, e.g. 'origin', you can do so by fully qualifying the name with the --track option: git checkout --track origin/<name> If you'd like to always have checkouts of an ambiguous <name> prefer one remote, e.g. the 'origin' remote, consider setting checkout.defaultRemote=origin in your config.
ta: தொலைநிலை கண்காணிப்பு கிளையைப் பார்க்க நீங்கள் விரும்பினால், எ.கா. 'தோற்றம்', --track விருப்பத்துடன் பெயரை முழுமையாக தகுதி பெறுவதன் மூலம் நீங்கள் அவ்வாறு செய்யலாம்: git checkout --track origin/<பெயர்> நீங்கள் எப்போதும் தெளிவற்ற <amanel> ஐ விரும்ப விரும்பினால் ஒரு தொலைநிலை, எ.கா. 'தோற்றம்' தொலை, அமைப்பைக் கவனியுங்கள் checkout.defaultremote=தோற்றம் உங்கள் கட்டமைப்பில் .

source: '%s' matched multiple (%d) remote tracking branches
ta: '%s' பல (%d) தொலைநிலை கண்காணிப்பு கிளைகளுடன் பொருந்தியது

source: only one reference expected
ta: ஒரே ஒரு குறிப்பு மட்டுமே எதிர்பார்க்கப்படுகிறது

source: only one reference expected, %d given.
ta: ஒரே ஒரு குறிப்பு மட்டுமே எதிர்பார்க்கப்படுகிறது, %d கொடுக்கப்பட்டுள்ளது.

source: invalid reference: %s
ta: தவறான குறிப்பு: %s

source: reference is not a tree: %s
ta: குறிப்பு ஒரு மரம் அல்ல: %s

source: a branch is expected, got tag '%s'
ta: ஒரு கிளை எதிர்பார்க்கப்படுகிறது, '%s' என்ற குறிச்சொல் கிடைத்தது

source: a branch is expected, got remote branch '%s'
ta: ஒரு கிளை எதிர்பார்க்கப்படுகிறது, தொலைநிலை கிளை '%s' கிடைத்தது

source: a branch is expected, got '%s'
ta: ஒரு கிளை எதிர்பார்க்கப்படுகிறது, '%s' கிடைத்தது

source: a branch is expected, got commit '%s'
ta: ஒரு கிளை எதிர்பார்க்கப்படுகிறது, அறிவிலி '%s'

source: If you want to detach HEAD at the commit, try again with the --detach option.
ta: நீங்கள் உறுதிடில் தலையைப் பிரிக்க விரும்பினால், --detach விருப்பத்துடன் மீண்டும் முயற்சிக்கவும்.

source: cannot switch branch while merging Consider "git merge --quit" or "git worktree add".
ta: ஒன்றிணைக்கும் போது கிளையை மாற்ற முடியாது "git merge --quit" அல்லது "git worktree add" ஆகியவற்றைக் கவனியுங்கள்.

source: cannot switch branch in the middle of an am session Consider "git am --quit" or "git worktree add".
ta: am அமர்வின் நடுவில் கிளையை மாற்ற முடியாது "git am --quit" அல்லது "git worktree add" ஐக் கவனியுங்கள்.

source: cannot switch branch while rebasing Consider "git rebase --quit" or "git worktree add".
ta: மறுதொடக்கம் செய்யும் போது கிளையை மாற்ற முடியாது "git rebase --quit" அல்லது "git worktree add" ஐக் கவனியுங்கள்.

source: cannot switch branch while cherry-picking Consider "git cherry-pick --quit" or "git worktree add".
ta: செர்ரி எடுக்கும் போது கிளையை மாற்ற முடியாது "git cherry-pick --quit" அல்லது "git worktree add" ஆகியவற்றைக் கவனியுங்கள்.

source: cannot switch branch while reverting Consider "git revert --quit" or "git worktree add".
ta: மாற்றும் போது கிளையை மாற்ற முடியாது "git revert --quit" அல்லது "git worktree add" ஐக் கவனியுங்கள்.

source: you are switching branch while bisecting
ta: நீங்கள் பிரிக்கும்போது கிளையை மாற்றுகிறீர்கள்

source: paths cannot be used with switching branches
ta: மாறுதல் கிளைகளுடன் பாதைகளைப் பயன்படுத்த முடியாது

source: '%s' cannot be used with switching branches
ta: கிளைகளை மாற்றுவதன் மூலம் '%s' பயன்படுத்த முடியாது

source: '%s' cannot be used with '%s'
ta: '%s' '%s' உடன் பயன்படுத்த முடியாது

source: '%s' cannot take <start-point>
ta: '%s' <start-point> ஐ எடுக்க முடியாது

source: Cannot switch branch to a non-commit '%s'
ta: கிளையை ஒரு கட்டளை அல்லாத '%s' க்கு மாற்ற முடியாது

source: missing branch or commit argument
ta: கிளை காணவில்லை அல்லது உரையாடல்
